pointer-x/stm32f103c8_RCC_CMSIS_bitfields/CMSIS/stm32f103c8_bitfield.h
// attribute for AHB Periphearl Word aligned access


/* =========================================================================================================================== */
/* ================                            Device Specific Peripheral Section                             ================ */
/* =========================================================================================================================== */


/** @addtogroup Device_Peripheral_peripherals
  * @{
  */



/* =========================================================================================================================== */
/* ================                                           FSMC                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Flexible static memory controller (FSMC)
  */

typedef struct {                                /*!< (@ 0xA0000000) FSMC Structure                                             */

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000000) SRAM/NOR-Flash chip-select control register 1              */

    struct {
      __IOM uint32_t MBKEN      : 1;            /*!< (@ 0x00000000) MBKEN                                                      */
      __IOM uint32_t MUXEN      : 1;            /*!< (@ 0x00000001) MUXEN                                                      */
      __IOM uint32_t MTYP       : 2;            /*!< (@ 0x00000002) MTYP                                                       */
      __IOM uint32_t MWID       : 2;            /*!< (@ 0x00000004) MWID                                                       */
      __IOM uint32_t FACCEN     : 1;            /*!< (@ 0x00000006) FACCEN                                                     */
      __IM  uint32_t            : 1;
      __IOM uint32_t BURSTEN    : 1;            /*!< (@ 0x00000008) BURSTEN                                                    */
      __IOM uint32_t WAITPOL    : 1;            /*!< (@ 0x00000009) WAITPOL                                                    */
      __IM  uint32_t            : 1;
      __IOM uint32_t WAITCFG    : 1;            /*!< (@ 0x0000000B) WAITCFG                                                    */
      __IOM uint32_t WREN       : 1;            /*!< (@ 0x0000000C) WREN                                                       */
      __IOM uint32_t WAITEN     : 1;            /*!< (@ 0x0000000D) WAITEN                                                     */
      __IOM uint32_t EXTMOD     : 1;            /*!< (@ 0x0000000E) EXTMOD                                                     */
      __IOM uint32_t ASYNCWAIT  : 1;            /*!< (@ 0x0000000F) ASYNCWAIT                                                  */
      __IM  uint32_t            : 3;
      __IOM uint32_t CBURSTRW   : 1;            /*!< (@ 0x00000013) CBURSTRW                                                   */
    } bit;
  } BCR1;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000004) SRAM/NOR-Flash chip-select timing register 1               */

    struct {
      __IOM uint32_t ADDSET     : 4;            /*!< (@ 0x00000000) ADDSET                                                     */
      __IOM uint32_t ADDHLD     : 4;            /*!< (@ 0x00000004) ADDHLD                                                     */
      __IOM uint32_t DATAST     : 8;            /*!< (@ 0x00000008) DATAST                                                     */
      __IOM uint32_t BUSTURN    : 4;            /*!< (@ 0x00000010) BUSTURN                                                    */
      __IOM uint32_t CLKDIV     : 4;            /*!< (@ 0x00000014) CLKDIV                                                     */
      __IOM uint32_t DATLAT     : 4;            /*!< (@ 0x00000018) DATLAT                                                     */
      __IOM uint32_t ACCMOD     : 2;            /*!< (@ 0x0000001C) ACCMOD                                                     */
    } bit;
  } BTR1;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000008) SRAM/NOR-Flash chip-select control register 2              */

    struct {
      __IOM uint32_t MBKEN      : 1;            /*!< (@ 0x00000000) MBKEN                                                      */
      __IOM uint32_t MUXEN      : 1;            /*!< (@ 0x00000001) MUXEN                                                      */
      __IOM uint32_t MTYP       : 2;            /*!< (@ 0x00000002) MTYP                                                       */
      __IOM uint32_t MWID       : 2;            /*!< (@ 0x00000004) MWID                                                       */
      __IOM uint32_t FACCEN     : 1;            /*!< (@ 0x00000006) FACCEN                                                     */
      __IM  uint32_t            : 1;
      __IOM uint32_t BURSTEN    : 1;            /*!< (@ 0x00000008) BURSTEN                                                    */
      __IOM uint32_t WAITPOL    : 1;            /*!< (@ 0x00000009) WAITPOL                                                    */
      __IOM uint32_t WRAPMOD    : 1;            /*!< (@ 0x0000000A) WRAPMOD                                                    */
      __IOM uint32_t WAITCFG    : 1;            /*!< (@ 0x0000000B) WAITCFG                                                    */
      __IOM uint32_t WREN       : 1;            /*!< (@ 0x0000000C) WREN                                                       */
      __IOM uint32_t WAITEN     : 1;            /*!< (@ 0x0000000D) WAITEN                                                     */
      __IOM uint32_t EXTMOD     : 1;            /*!< (@ 0x0000000E) EXTMOD                                                     */
      __IOM uint32_t ASYNCWAIT  : 1;            /*!< (@ 0x0000000F) ASYNCWAIT                                                  */
      __IM  uint32_t            : 3;
      __IOM uint32_t CBURSTRW   : 1;            /*!< (@ 0x00000013) CBURSTRW                                                   */
    } bit;
  } BCR2;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000000C) SRAM/NOR-Flash chip-select timing register 2               */

