pointer-x/stm32f103c8_RCC_CMSIS_bitfields/CMSIS/stm32f103c8_bitfield.h
    struct {
      __IOM uint32_t ADDSET     : 4;            /*!< (@ 0x00000000) ADDSET                                                     */
      __IOM uint32_t ADDHLD     : 4;            /*!< (@ 0x00000004) ADDHLD                                                     */
      __IOM uint32_t DATAST     : 8;            /*!< (@ 0x00000008) DATAST                                                     */
      __IOM uint32_t BUSTURN    : 4;            /*!< (@ 0x00000010) BUSTURN                                                    */
      __IOM uint32_t CLKDIV     : 4;            /*!< (@ 0x00000014) CLKDIV                                                     */
      __IOM uint32_t DATLAT     : 4;            /*!< (@ 0x00000018) DATLAT                                                     */
      __IOM uint32_t ACCMOD     : 2;            /*!< (@ 0x0000001C) ACCMOD                                                     */
    } bit;
  } BTR4;
  __IM  uint32_t  RESERVED[16];

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000060) PC Card/NAND Flash control register 2                      */

    struct {
      __IM  uint32_t            : 1;
      __IOM uint32_t PWAITEN    : 1;            /*!< (@ 0x00000001) PWAITEN                                                    */
      __IOM uint32_t PBKEN      : 1;            /*!< (@ 0x00000002) PBKEN                                                      */
      __IOM uint32_t PTYP       : 1;            /*!< (@ 0x00000003) PTYP                                                       */
      __IOM uint32_t PWID       : 2;            /*!< (@ 0x00000004) PWID                                                       */
      __IOM uint32_t ECCEN      : 1;            /*!< (@ 0x00000006) ECCEN                                                      */
      __IM  uint32_t            : 2;
      __IOM uint32_t TCLR       : 4;            /*!< (@ 0x00000009) TCLR                                                       */
      __IOM uint32_t TAR        : 4;            /*!< (@ 0x0000000D) TAR                                                        */
      __IOM uint32_t ECCPS      : 3;            /*!< (@ 0x00000011) ECCPS                                                      */
    } bit;
  } PCR2;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000064) FIFO status and interrupt register 2                       */

    struct {
      __IOM uint32_t IRS        : 1;            /*!< (@ 0x00000000) IRS                                                        */
      __IOM uint32_t ILS        : 1;            /*!< (@ 0x00000001) ILS                                                        */
      __IOM uint32_t IFS        : 1;            /*!< (@ 0x00000002) IFS                                                        */
      __IOM uint32_t IREN       : 1;            /*!< (@ 0x00000003) IREN                                                       */
      __IOM uint32_t ILEN       : 1;            /*!< (@ 0x00000004) ILEN                                                       */
      __IOM uint32_t IFEN       : 1;            /*!< (@ 0x00000005) IFEN                                                       */
      __IM  uint32_t FEMPT      : 1;            /*!< (@ 0x00000006) FEMPT                                                      */
    } bit;
  } SR2;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000068) Common memory space timing register 2                      */

    struct {
      __IOM uint32_t MEMSETx    : 8;            /*!< (@ 0x00000000) MEMSETx                                                    */
      __IOM uint32_t MEMWAITx   : 8;            /*!< (@ 0x00000008) MEMWAITx                                                   */
      __IOM uint32_t MEMHOLDx   : 8;            /*!< (@ 0x00000010) MEMHOLDx                                                   */
      __IOM uint32_t MEMHIZx    : 8;            /*!< (@ 0x00000018) MEMHIZx                                                    */
    } bit;
  } PMEM2;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000006C) Attribute memory space timing register 2                   */

    struct {
      __IOM uint32_t ATTSETx    : 8;            /*!< (@ 0x00000000) Attribute memory x setup time                              */
      __IOM uint32_t ATTWAITx   : 8;            /*!< (@ 0x00000008) Attribute memory x wait time                               */
      __IOM uint32_t ATTHOLDx   : 8;            /*!< (@ 0x00000010) Attribute memory x hold time                               */
      __IOM uint32_t ATTHIZx    : 8;            /*!< (@ 0x00000018) Attribute memory x databus HiZ time                        */
    } bit;
  } PATT2;
  __IM  uint32_t  RESERVED1;

  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000074) ECC result register 2                                      */

    struct {
      __IM  uint32_t ECCx       : 32;           /*!< (@ 0x00000000) ECC result                                                 */
    } bit;
  } ECCR2;
  __IM  uint32_t  RESERVED2[2];

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000080) PC Card/NAND Flash control register 3                      */

    struct {
      __IM  uint32_t            : 1;
      __IOM uint32_t PWAITEN    : 1;            /*!< (@ 0x00000001) PWAITEN                                                    */
      __IOM uint32_t PBKEN      : 1;            /*!< (@ 0x00000002) PBKEN                                                      */
      __IOM uint32_t PTYP       : 1;            /*!< (@ 0x00000003) PTYP                                                       */
      __IOM uint32_t PWID       : 2;            /*!< (@ 0x00000004) PWID                                                       */
      __IOM uint32_t ECCEN      : 1;            /*!< (@ 0x00000006) ECCEN                                                      */
      __IM  uint32_t            : 2;
      __IOM uint32_t TCLR       : 4;            /*!< (@ 0x00000009) TCLR                                                       */
      __IOM uint32_t TAR        : 4;            /*!< (@ 0x0000000D) TAR                                                        */
      __IOM uint32_t ECCPS      : 3;            /*!< (@ 0x00000011) ECCPS                                                      */
    } bit;
  } PCR3;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000084) FIFO status and interrupt register 3                       */

