pointer-x/stm32f103c8_RCC_CMSIS_bitfields/CMSIS/stm32f103c8_bitfield.h
    struct {
      __IOM uint32_t IRS        : 1;            /*!< (@ 0x00000000) IRS                                                        */
      __IOM uint32_t ILS        : 1;            /*!< (@ 0x00000001) ILS                                                        */
      __IOM uint32_t IFS        : 1;            /*!< (@ 0x00000002) IFS                                                        */
      __IOM uint32_t IREN       : 1;            /*!< (@ 0x00000003) IREN                                                       */
      __IOM uint32_t ILEN       : 1;            /*!< (@ 0x00000004) ILEN                                                       */
      __IOM uint32_t IFEN       : 1;            /*!< (@ 0x00000005) IFEN                                                       */
      __IM  uint32_t FEMPT      : 1;            /*!< (@ 0x00000006) FEMPT                                                      */
    } bit;
  } SR3;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000088) Common memory space timing register 3                      */

    struct {
      __IOM uint32_t MEMSETx    : 8;            /*!< (@ 0x00000000) MEMSETx                                                    */
      __IOM uint32_t MEMWAITx   : 8;            /*!< (@ 0x00000008) MEMWAITx                                                   */
      __IOM uint32_t MEMHOLDx   : 8;            /*!< (@ 0x00000010) MEMHOLDx                                                   */
      __IOM uint32_t MEMHIZx    : 8;            /*!< (@ 0x00000018) MEMHIZx                                                    */
    } bit;
  } PMEM3;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000008C) Attribute memory space timing register 3                   */

    struct {
      __IOM uint32_t ATTSETx    : 8;            /*!< (@ 0x00000000) ATTSETx                                                    */
      __IOM uint32_t ATTWAITx   : 8;            /*!< (@ 0x00000008) ATTWAITx                                                   */
      __IOM uint32_t ATTHOLDx   : 8;            /*!< (@ 0x00000010) ATTHOLDx                                                   */
      __IOM uint32_t ATTHIZx    : 8;            /*!< (@ 0x00000018) ATTHIZx                                                    */
    } bit;
  } PATT3;
  __IM  uint32_t  RESERVED3;

  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000094) ECC result register 3                                      */

    struct {
      __IM  uint32_t ECCx       : 32;           /*!< (@ 0x00000000) ECCx                                                       */
    } bit;
  } ECCR3;
  __IM  uint32_t  RESERVED4[2];

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000A0) PC Card/NAND Flash control register 4                      */

    struct {
      __IM  uint32_t            : 1;
      __IOM uint32_t PWAITEN    : 1;            /*!< (@ 0x00000001) PWAITEN                                                    */
      __IOM uint32_t PBKEN      : 1;            /*!< (@ 0x00000002) PBKEN                                                      */
      __IOM uint32_t PTYP       : 1;            /*!< (@ 0x00000003) PTYP                                                       */
      __IOM uint32_t PWID       : 2;            /*!< (@ 0x00000004) PWID                                                       */
      __IOM uint32_t ECCEN      : 1;            /*!< (@ 0x00000006) ECCEN                                                      */
      __IM  uint32_t            : 2;
      __IOM uint32_t TCLR       : 4;            /*!< (@ 0x00000009) TCLR                                                       */
      __IOM uint32_t TAR        : 4;            /*!< (@ 0x0000000D) TAR                                                        */
      __IOM uint32_t ECCPS      : 3;            /*!< (@ 0x00000011) ECCPS                                                      */
    } bit;
  } PCR4;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000A4) FIFO status and interrupt register 4                       */

    struct {
      __IOM uint32_t IRS        : 1;            /*!< (@ 0x00000000) IRS                                                        */
      __IOM uint32_t ILS        : 1;            /*!< (@ 0x00000001) ILS                                                        */
      __IOM uint32_t IFS        : 1;            /*!< (@ 0x00000002) IFS                                                        */
      __IOM uint32_t IREN       : 1;            /*!< (@ 0x00000003) IREN                                                       */
      __IOM uint32_t ILEN       : 1;            /*!< (@ 0x00000004) ILEN                                                       */
      __IOM uint32_t IFEN       : 1;            /*!< (@ 0x00000005) IFEN                                                       */
      __IM  uint32_t FEMPT      : 1;            /*!< (@ 0x00000006) FEMPT                                                      */
    } bit;
  } SR4;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000A8) Common memory space timing register 4                      */

    struct {
      __IOM uint32_t MEMSETx    : 8;            /*!< (@ 0x00000000) MEMSETx                                                    */
      __IOM uint32_t MEMWAITx   : 8;            /*!< (@ 0x00000008) MEMWAITx                                                   */
      __IOM uint32_t MEMHOLDx   : 8;            /*!< (@ 0x00000010) MEMHOLDx                                                   */
      __IOM uint32_t MEMHIZx    : 8;            /*!< (@ 0x00000018) MEMHIZx                                                    */
    } bit;
  } PMEM4;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000AC) Attribute memory space timing register 4                   */

    struct {
      __IOM uint32_t ATTSETx    : 8;            /*!< (@ 0x00000000) ATTSETx                                                    */
      __IOM uint32_t ATTWAITx   : 8;            /*!< (@ 0x00000008) ATTWAITx                                                   */
      __IOM uint32_t ATTHOLDx   : 8;            /*!< (@ 0x00000010) ATTHOLDx                                                   */
      __IOM uint32_t ATTHIZx    : 8;            /*!< (@ 0x00000018) ATTHIZx                                                    */
    } bit;
  } PATT4;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000B0) I/O space timing register 4                                */

