pointer-x/stm32f103c8_RCC_CMSIS_bitfields/CMSIS/stm32f103c8_bitfield.h
    struct {
      __IOM uint32_t IOSETx     : 8;            /*!< (@ 0x00000000) IOSETx                                                     */
      __IOM uint32_t IOWAITx    : 8;            /*!< (@ 0x00000008) IOWAITx                                                    */
      __IOM uint32_t IOHOLDx    : 8;            /*!< (@ 0x00000010) IOHOLDx                                                    */
      __IOM uint32_t IOHIZx     : 8;            /*!< (@ 0x00000018) IOHIZx                                                     */
    } bit;
  } PIO4;
  __IM  uint32_t  RESERVED5[20];

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000104) SRAM/NOR-Flash write timing registers 1                    */

    struct {
      __IOM uint32_t ADDSET     : 4;            /*!< (@ 0x00000000) ADDSET                                                     */
      __IOM uint32_t ADDHLD     : 4;            /*!< (@ 0x00000004) ADDHLD                                                     */
      __IOM uint32_t DATAST     : 8;            /*!< (@ 0x00000008) DATAST                                                     */
      __IM  uint32_t            : 4;
      __IOM uint32_t CLKDIV     : 4;            /*!< (@ 0x00000014) CLKDIV                                                     */
      __IOM uint32_t DATLAT     : 4;            /*!< (@ 0x00000018) DATLAT                                                     */
      __IOM uint32_t ACCMOD     : 2;            /*!< (@ 0x0000001C) ACCMOD                                                     */
    } bit;
  } BWTR1;
  __IM  uint32_t  RESERVED6;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000010C) SRAM/NOR-Flash write timing registers 2                    */

    struct {
      __IOM uint32_t ADDSET     : 4;            /*!< (@ 0x00000000) ADDSET                                                     */
      __IOM uint32_t ADDHLD     : 4;            /*!< (@ 0x00000004) ADDHLD                                                     */
      __IOM uint32_t DATAST     : 8;            /*!< (@ 0x00000008) DATAST                                                     */
      __IM  uint32_t            : 4;
      __IOM uint32_t CLKDIV     : 4;            /*!< (@ 0x00000014) CLKDIV                                                     */
      __IOM uint32_t DATLAT     : 4;            /*!< (@ 0x00000018) DATLAT                                                     */
      __IOM uint32_t ACCMOD     : 2;            /*!< (@ 0x0000001C) ACCMOD                                                     */
    } bit;
  } BWTR2;
  __IM  uint32_t  RESERVED7;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000114) SRAM/NOR-Flash write timing registers 3                    */

    struct {
      __IOM uint32_t ADDSET     : 4;            /*!< (@ 0x00000000) ADDSET                                                     */
      __IOM uint32_t ADDHLD     : 4;            /*!< (@ 0x00000004) ADDHLD                                                     */
      __IOM uint32_t DATAST     : 8;            /*!< (@ 0x00000008) DATAST                                                     */
      __IM  uint32_t            : 4;
      __IOM uint32_t CLKDIV     : 4;            /*!< (@ 0x00000014) CLKDIV                                                     */
      __IOM uint32_t DATLAT     : 4;            /*!< (@ 0x00000018) DATLAT                                                     */
      __IOM uint32_t ACCMOD     : 2;            /*!< (@ 0x0000001C) ACCMOD                                                     */
    } bit;
  } BWTR3;
  __IM  uint32_t  RESERVED8;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000011C) SRAM/NOR-Flash write timing registers 4                    */

    struct {
      __IOM uint32_t ADDSET     : 4;            /*!< (@ 0x00000000) ADDSET                                                     */
      __IOM uint32_t ADDHLD     : 4;            /*!< (@ 0x00000004) ADDHLD                                                     */
      __IOM uint32_t DATAST     : 8;            /*!< (@ 0x00000008) DATAST                                                     */
      __IM  uint32_t            : 4;
      __IOM uint32_t CLKDIV     : 4;            /*!< (@ 0x00000014) CLKDIV                                                     */
      __IOM uint32_t DATLAT     : 4;            /*!< (@ 0x00000018) DATLAT                                                     */
      __IOM uint32_t ACCMOD     : 2;            /*!< (@ 0x0000001C) ACCMOD                                                     */
    } bit;
  } BWTR4;
} FSMC_Type;                                    /*!< Size = 288 (0x120)                                                        */



/* =========================================================================================================================== */
/* ================                                            PWR                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Power control (PWR)
  */

typedef struct {                                /*!< (@ 0x40007000) PWR Structure                                              */

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000000) Power control register (PWR_CR)                            */

    struct {
      __IOM uint32_t LPDS       : 1;            /*!< (@ 0x00000000) Low Power Deep Sleep                                       */
      __IOM uint32_t PDDS       : 1;            /*!< (@ 0x00000001) Power Down Deep Sleep                                      */
      __IOM uint32_t CWUF       : 1;            /*!< (@ 0x00000002) Clear Wake-up Flag                                         */
      __IOM uint32_t CSBF       : 1;            /*!< (@ 0x00000003) Clear STANDBY Flag                                         */
      __IOM uint32_t PVDE       : 1;            /*!< (@ 0x00000004) Power Voltage Detector Enable                              */
      __IOM uint32_t PLS        : 3;            /*!< (@ 0x00000005) PVD Level Selection                                        */
      __IOM uint32_t DBP        : 1;            /*!< (@ 0x00000008) Disable Backup Domain write protection                     */
    } bit;
  } CR;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000004) Power control register (PWR_CR)                            */

