pointer-x/stm32f103c8_RCC_CMSIS_bitfields/CMSIS/stm32f103c8_bitfield.h
    struct {
      __IM  uint32_t WUF        : 1;            /*!< (@ 0x00000000) Wake-Up Flag                                               */
      __IM  uint32_t SBF        : 1;            /*!< (@ 0x00000001) STANDBY Flag                                               */
      __IM  uint32_t PVDO       : 1;            /*!< (@ 0x00000002) PVD Output                                                 */
      __IM  uint32_t            : 5;
      __IOM uint32_t EWUP       : 1;            /*!< (@ 0x00000008) Enable WKUP pin                                            */
    } bit;
  } CSR;
} PWR_Type;                                     /*!< Size = 8 (0x8)                                                            */



/* =========================================================================================================================== */
/* ================                                            RCC                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Reset and clock control (RCC)
  */

typedef struct {                                /*!< (@ 0x40021000) RCC Structure                                              */

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000000) Clock control register                                     */

    struct {
      __IOM uint32_t HSION      : 1;            /*!< (@ 0x00000000) Internal High Speed clock enable                           */
      __IM  uint32_t HSIRDY     : 1;            /*!< (@ 0x00000001) Internal High Speed clock ready flag                       */
      __IM  uint32_t            : 1;
      __IOM uint32_t HSITRIM    : 5;            /*!< (@ 0x00000003) Internal High Speed clock trimming                         */
      __IM  uint32_t HSICAL     : 8;            /*!< (@ 0x00000008) Internal High Speed clock Calibration                      */
      __IOM uint32_t HSEON      : 1;            /*!< (@ 0x00000010) External High Speed clock enable                           */
      __IM  uint32_t HSERDY     : 1;            /*!< (@ 0x00000011) External High Speed clock ready flag                       */
      __IOM uint32_t HSEBYP     : 1;            /*!< (@ 0x00000012) External High Speed clock Bypass                           */
      __IOM uint32_t CSSON      : 1;            /*!< (@ 0x00000013) Clock Security System enable                               */
      __IM  uint32_t            : 4;
      __IOM uint32_t PLLON      : 1;            /*!< (@ 0x00000018) PLL enable                                                 */
      __IM  uint32_t PLLRDY     : 1;            /*!< (@ 0x00000019) PLL clock ready flag                                       */
    } bit;
  } CR;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000004) Clock configuration register (RCC_CFGR)                    */

    struct {
      __IOM uint32_t SW         : 2;            /*!< (@ 0x00000000) System clock Switch                                        */
      __IM  uint32_t SWS        : 2;            /*!< (@ 0x00000002) System Clock Switch Status                                 */
      __IOM uint32_t HPRE       : 4;            /*!< (@ 0x00000004) AHB prescaler                                              */
      __IOM uint32_t PPRE1      : 3;            /*!< (@ 0x00000008) APB Low speed prescaler (APB1)                             */
      __IOM uint32_t PPRE2      : 3;            /*!< (@ 0x0000000B) APB High speed prescaler (APB2)                            */
      __IOM uint32_t ADCPRE     : 2;            /*!< (@ 0x0000000E) ADC prescaler                                              */
      __IOM uint32_t PLLSRC     : 1;            /*!< (@ 0x00000010) PLL entry clock source                                     */
      __IOM uint32_t PLLXTPRE   : 1;            /*!< (@ 0x00000011) HSE divider for PLL entry                                  */
      __IOM uint32_t PLLMUL     : 4;            /*!< (@ 0x00000012) PLL Multiplication Factor                                  */
      __IOM uint32_t USBPRE     : 1;            /*!< (@ 0x00000016) USB OTG FS prescaler                                       */
      __IM  uint32_t            : 1;
      __IOM uint32_t MCO        : 3;            /*!< (@ 0x00000018) Microcontroller clock output                               */
    } bit;
  } CFGR;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000008) Clock interrupt register (RCC_CIR)                         */

    struct {
      __IM  uint32_t LSIRDYF    : 1;            /*!< (@ 0x00000000) LSI Ready Interrupt flag                                   */
      __IM  uint32_t LSERDYF    : 1;            /*!< (@ 0x00000001) LSE Ready Interrupt flag                                   */
      __IM  uint32_t HSIRDYF    : 1;            /*!< (@ 0x00000002) HSI Ready Interrupt flag                                   */
      __IM  uint32_t HSERDYF    : 1;            /*!< (@ 0x00000003) HSE Ready Interrupt flag                                   */
      __IM  uint32_t PLLRDYF    : 1;            /*!< (@ 0x00000004) PLL Ready Interrupt flag                                   */
      __IM  uint32_t            : 2;
      __IM  uint32_t CSSF       : 1;            /*!< (@ 0x00000007) Clock Security System Interrupt flag                       */
      __IOM uint32_t LSIRDYIE   : 1;            /*!< (@ 0x00000008) LSI Ready Interrupt Enable                                 */
      __IOM uint32_t LSERDYIE   : 1;            /*!< (@ 0x00000009) LSE Ready Interrupt Enable                                 */
      __IOM uint32_t HSIRDYIE   : 1;            /*!< (@ 0x0000000A) HSI Ready Interrupt Enable                                 */
      __IOM uint32_t HSERDYIE   : 1;            /*!< (@ 0x0000000B) HSE Ready Interrupt Enable                                 */
      __IOM uint32_t PLLRDYIE   : 1;            /*!< (@ 0x0000000C) PLL Ready Interrupt Enable                                 */
      __IM  uint32_t            : 3;
      __OM  uint32_t LSIRDYC    : 1;            /*!< (@ 0x00000010) LSI Ready Interrupt Clear                                  */
      __OM  uint32_t LSERDYC    : 1;            /*!< (@ 0x00000011) LSE Ready Interrupt Clear                                  */
      __OM  uint32_t HSIRDYC    : 1;            /*!< (@ 0x00000012) HSI Ready Interrupt Clear                                  */
      __OM  uint32_t HSERDYC    : 1;            /*!< (@ 0x00000013) HSE Ready Interrupt Clear                                  */
      __OM  uint32_t PLLRDYC    : 1;            /*!< (@ 0x00000014) PLL Ready Interrupt Clear                                  */
      __IM  uint32_t            : 2;
      __OM  uint32_t CSSC       : 1;            /*!< (@ 0x00000017) Clock security system interrupt clear                      */
    } bit;
  } CIR;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000000C) APB2 peripheral reset register (RCC_APB2RSTR)              */

