pointer-x/stm32f103c8_RCC_CMSIS_bitfields/CMSIS/stm32f103c8_bitfield.h
    struct {
      __IOM uint32_t AFIORST    : 1;            /*!< (@ 0x00000000) Alternate function I/O reset                               */
      __IM  uint32_t            : 1;
      __IOM uint32_t IOPARST    : 1;            /*!< (@ 0x00000002) IO port A reset                                            */
      __IOM uint32_t IOPBRST    : 1;            /*!< (@ 0x00000003) IO port B reset                                            */
      __IOM uint32_t IOPCRST    : 1;            /*!< (@ 0x00000004) IO port C reset                                            */
      __IOM uint32_t IOPDRST    : 1;            /*!< (@ 0x00000005) IO port D reset                                            */
      __IOM uint32_t IOPERST    : 1;            /*!< (@ 0x00000006) IO port E reset                                            */
      __IOM uint32_t IOPFRST    : 1;            /*!< (@ 0x00000007) IO port F reset                                            */
      __IOM uint32_t IOPGRST    : 1;            /*!< (@ 0x00000008) IO port G reset                                            */
      __IOM uint32_t ADC1RST    : 1;            /*!< (@ 0x00000009) ADC 1 interface reset                                      */
      __IOM uint32_t ADC2RST    : 1;            /*!< (@ 0x0000000A) ADC 2 interface reset                                      */
      __IOM uint32_t TIM1RST    : 1;            /*!< (@ 0x0000000B) TIM1 timer reset                                           */
      __IOM uint32_t SPI1RST    : 1;            /*!< (@ 0x0000000C) SPI 1 reset                                                */
      __IOM uint32_t TIM8RST    : 1;            /*!< (@ 0x0000000D) TIM8 timer reset                                           */
      __IOM uint32_t USART1RST  : 1;            /*!< (@ 0x0000000E) USART1 reset                                               */
      __IOM uint32_t ADC3RST    : 1;            /*!< (@ 0x0000000F) ADC 3 interface reset                                      */
      __IM  uint32_t            : 3;
      __IOM uint32_t TIM9RST    : 1;            /*!< (@ 0x00000013) TIM9 timer reset                                           */
      __IOM uint32_t TIM10RST   : 1;            /*!< (@ 0x00000014) TIM10 timer reset                                          */
      __IOM uint32_t TIM11RST   : 1;            /*!< (@ 0x00000015) TIM11 timer reset                                          */
    } bit;
  } APB2RSTR;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000010) APB1 peripheral reset register (RCC_APB1RSTR)              */

    struct {
      __IOM uint32_t TIM2RST    : 1;            /*!< (@ 0x00000000) Timer 2 reset                                              */
      __IOM uint32_t TIM3RST    : 1;            /*!< (@ 0x00000001) Timer 3 reset                                              */
      __IOM uint32_t TIM4RST    : 1;            /*!< (@ 0x00000002) Timer 4 reset                                              */
      __IOM uint32_t TIM5RST    : 1;            /*!< (@ 0x00000003) Timer 5 reset                                              */
      __IOM uint32_t TIM6RST    : 1;            /*!< (@ 0x00000004) Timer 6 reset                                              */
      __IOM uint32_t TIM7RST    : 1;            /*!< (@ 0x00000005) Timer 7 reset                                              */
      __IOM uint32_t TIM12RST   : 1;            /*!< (@ 0x00000006) Timer 12 reset                                             */
      __IOM uint32_t TIM13RST   : 1;            /*!< (@ 0x00000007) Timer 13 reset                                             */
      __IOM uint32_t TIM14RST   : 1;            /*!< (@ 0x00000008) Timer 14 reset                                             */
      __IM  uint32_t            : 2;
      __IOM uint32_t WWDGRST    : 1;            /*!< (@ 0x0000000B) Window watchdog reset                                      */
      __IM  uint32_t            : 2;
      __IOM uint32_t SPI2RST    : 1;            /*!< (@ 0x0000000E) SPI2 reset                                                 */
      __IOM uint32_t SPI3RST    : 1;            /*!< (@ 0x0000000F) SPI3 reset                                                 */
      __IM  uint32_t            : 1;
      __IOM uint32_t USART2RST  : 1;            /*!< (@ 0x00000011) USART 2 reset                                              */
      __IOM uint32_t USART3RST  : 1;            /*!< (@ 0x00000012) USART 3 reset                                              */
      __IOM uint32_t UART4RST   : 1;            /*!< (@ 0x00000013) UART 4 reset                                               */
      __IOM uint32_t UART5RST   : 1;            /*!< (@ 0x00000014) UART 5 reset                                               */
      __IOM uint32_t I2C1RST    : 1;            /*!< (@ 0x00000015) I2C1 reset                                                 */
      __IOM uint32_t I2C2RST    : 1;            /*!< (@ 0x00000016) I2C2 reset                                                 */
      __IOM uint32_t USBRST     : 1;            /*!< (@ 0x00000017) USB reset                                                  */
      __IM  uint32_t            : 1;
      __IOM uint32_t CANRST     : 1;            /*!< (@ 0x00000019) CAN reset                                                  */
      __IM  uint32_t            : 1;
      __IOM uint32_t BKPRST     : 1;            /*!< (@ 0x0000001B) Backup interface reset                                     */
      __IOM uint32_t PWRRST     : 1;            /*!< (@ 0x0000001C) Power interface reset                                      */
      __IOM uint32_t DACRST     : 1;            /*!< (@ 0x0000001D) DAC interface reset                                        */
    } bit;
  } APB1RSTR;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000014) AHB Peripheral Clock enable register (RCC_AHBENR)          */

    struct {
      __IOM uint32_t DMA1EN     : 1;            /*!< (@ 0x00000000) DMA1 clock enable                                          */
      __IOM uint32_t DMA2EN     : 1;            /*!< (@ 0x00000001) DMA2 clock enable                                          */
      __IOM uint32_t SRAMEN     : 1;            /*!< (@ 0x00000002) SRAM interface clock enable                                */
      __IM  uint32_t            : 1;
      __IOM uint32_t FLITFEN    : 1;            /*!< (@ 0x00000004) FLITF clock enable                                         */
      __IM  uint32_t            : 1;
      __IOM uint32_t CRCEN      : 1;            /*!< (@ 0x00000006) CRC clock enable                                           */
      __IM  uint32_t            : 1;
      __IOM uint32_t FSMCEN     : 1;            /*!< (@ 0x00000008) FSMC clock enable                                          */
      __IM  uint32_t            : 1;
      __IOM uint32_t SDIOEN     : 1;            /*!< (@ 0x0000000A) SDIO clock enable                                          */
    } bit;
  } AHBENR;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000018) APB2 peripheral clock enable register (RCC_APB2ENR)        */

