pointer-x/stm32f103c8_RCC_CMSIS_bitfields/CMSIS/stm32f103c8_bitfield.h
    struct {
      __IOM uint32_t AFIOEN     : 1;            /*!< (@ 0x00000000) Alternate function I/O clock enable                        */
      __IM  uint32_t            : 1;
      __IOM uint32_t IOPAEN     : 1;            /*!< (@ 0x00000002) I/O port A clock enable                                    */
      __IOM uint32_t IOPBEN     : 1;            /*!< (@ 0x00000003) I/O port B clock enable                                    */
      __IOM uint32_t IOPCEN     : 1;            /*!< (@ 0x00000004) I/O port C clock enable                                    */
      __IOM uint32_t IOPDEN     : 1;            /*!< (@ 0x00000005) I/O port D clock enable                                    */
      __IOM uint32_t IOPEEN     : 1;            /*!< (@ 0x00000006) I/O port E clock enable                                    */
      __IOM uint32_t IOPFEN     : 1;            /*!< (@ 0x00000007) I/O port F clock enable                                    */
      __IOM uint32_t IOPGEN     : 1;            /*!< (@ 0x00000008) I/O port G clock enable                                    */
      __IOM uint32_t ADC1EN     : 1;            /*!< (@ 0x00000009) ADC 1 interface clock enable                               */
      __IOM uint32_t ADC2EN     : 1;            /*!< (@ 0x0000000A) ADC 2 interface clock enable                               */
      __IOM uint32_t TIM1EN     : 1;            /*!< (@ 0x0000000B) TIM1 Timer clock enable                                    */
      __IOM uint32_t SPI1EN     : 1;            /*!< (@ 0x0000000C) SPI 1 clock enable                                         */
      __IOM uint32_t TIM8EN     : 1;            /*!< (@ 0x0000000D) TIM8 Timer clock enable                                    */
      __IOM uint32_t USART1EN   : 1;            /*!< (@ 0x0000000E) USART1 clock enable                                        */
      __IOM uint32_t ADC3EN     : 1;            /*!< (@ 0x0000000F) ADC3 interface clock enable                                */
      __IM  uint32_t            : 3;
      __IOM uint32_t TIM9EN     : 1;            /*!< (@ 0x00000013) TIM9 Timer clock enable                                    */
      __IOM uint32_t TIM10EN    : 1;            /*!< (@ 0x00000014) TIM10 Timer clock enable                                   */
      __IOM uint32_t TIM11EN    : 1;            /*!< (@ 0x00000015) TIM11 Timer clock enable                                   */
    } bit;
  } APB2ENR;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000001C) APB1 peripheral clock enable register (RCC_APB1ENR)        */

    struct {
      __IOM uint32_t TIM2EN     : 1;            /*!< (@ 0x00000000) Timer 2 clock enable                                       */
      __IOM uint32_t TIM3EN     : 1;            /*!< (@ 0x00000001) Timer 3 clock enable                                       */
      __IOM uint32_t TIM4EN     : 1;            /*!< (@ 0x00000002) Timer 4 clock enable                                       */
      __IOM uint32_t TIM5EN     : 1;            /*!< (@ 0x00000003) Timer 5 clock enable                                       */
      __IOM uint32_t TIM6EN     : 1;            /*!< (@ 0x00000004) Timer 6 clock enable                                       */
      __IOM uint32_t TIM7EN     : 1;            /*!< (@ 0x00000005) Timer 7 clock enable                                       */
      __IOM uint32_t TIM12EN    : 1;            /*!< (@ 0x00000006) Timer 12 clock enable                                      */
      __IOM uint32_t TIM13EN    : 1;            /*!< (@ 0x00000007) Timer 13 clock enable                                      */
      __IOM uint32_t TIM14EN    : 1;            /*!< (@ 0x00000008) Timer 14 clock enable                                      */
      __IM  uint32_t            : 2;
      __IOM uint32_t WWDGEN     : 1;            /*!< (@ 0x0000000B) Window watchdog clock enable                               */
      __IM  uint32_t            : 2;
      __IOM uint32_t SPI2EN     : 1;            /*!< (@ 0x0000000E) SPI 2 clock enable                                         */
      __IOM uint32_t SPI3EN     : 1;            /*!< (@ 0x0000000F) SPI 3 clock enable                                         */
      __IM  uint32_t            : 1;
      __IOM uint32_t USART2EN   : 1;            /*!< (@ 0x00000011) USART 2 clock enable                                       */
      __IOM uint32_t USART3EN   : 1;            /*!< (@ 0x00000012) USART 3 clock enable                                       */
      __IOM uint32_t UART4EN    : 1;            /*!< (@ 0x00000013) UART 4 clock enable                                        */
      __IOM uint32_t UART5EN    : 1;            /*!< (@ 0x00000014) UART 5 clock enable                                        */
      __IOM uint32_t I2C1EN     : 1;            /*!< (@ 0x00000015) I2C 1 clock enable                                         */
      __IOM uint32_t I2C2EN     : 1;            /*!< (@ 0x00000016) I2C 2 clock enable                                         */
      __IOM uint32_t USBEN      : 1;            /*!< (@ 0x00000017) USB clock enable                                           */
      __IM  uint32_t            : 1;
      __IOM uint32_t CANEN      : 1;            /*!< (@ 0x00000019) CAN clock enable                                           */
      __IM  uint32_t            : 1;
      __IOM uint32_t BKPEN      : 1;            /*!< (@ 0x0000001B) Backup interface clock enable                              */
      __IOM uint32_t PWREN      : 1;            /*!< (@ 0x0000001C) Power interface clock enable                               */
      __IOM uint32_t DACEN      : 1;            /*!< (@ 0x0000001D) DAC interface clock enable                                 */
    } bit;
  } APB1ENR;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000020) Backup domain control register (RCC_BDCR)                  */

    struct {
      __IOM uint32_t LSEON      : 1;            /*!< (@ 0x00000000) External Low Speed oscillator enable                       */
      __IM  uint32_t LSERDY     : 1;            /*!< (@ 0x00000001) External Low Speed oscillator ready                        */
      __IOM uint32_t LSEBYP     : 1;            /*!< (@ 0x00000002) External Low Speed oscillator bypass                       */
      __IM  uint32_t            : 5;
      __IOM uint32_t RTCSEL     : 2;            /*!< (@ 0x00000008) RTC clock source selection                                 */
      __IM  uint32_t            : 5;
      __IOM uint32_t RTCEN      : 1;            /*!< (@ 0x0000000F) RTC clock enable                                           */
      __IOM uint32_t BDRST      : 1;            /*!< (@ 0x00000010) Backup domain software reset                               */
    } bit;
  } BDCR;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000024) Control/status register (RCC_CSR)                          */

