pointer-x/stm32f103c8_RCC_CMSIS_bitfields/CMSIS/stm32f103c8_bitfield.h
    struct {
      __IOM uint32_t LSION      : 1;            /*!< (@ 0x00000000) Internal low speed oscillator enable                       */
      __IM  uint32_t LSIRDY     : 1;            /*!< (@ 0x00000001) Internal low speed oscillator ready                        */
      __IM  uint32_t            : 22;
      __IOM uint32_t RMVF       : 1;            /*!< (@ 0x00000018) Remove reset flag                                          */
      __IM  uint32_t            : 1;
      __IOM uint32_t PINRSTF    : 1;            /*!< (@ 0x0000001A) PIN reset flag                                             */
      __IOM uint32_t PORRSTF    : 1;            /*!< (@ 0x0000001B) POR/PDR reset flag                                         */
      __IOM uint32_t SFTRSTF    : 1;            /*!< (@ 0x0000001C) Software reset flag                                        */
      __IOM uint32_t IWDGRSTF   : 1;            /*!< (@ 0x0000001D) Independent watchdog reset flag                            */
      __IOM uint32_t WWDGRSTF   : 1;            /*!< (@ 0x0000001E) Window watchdog reset flag                                 */
      __IOM uint32_t LPWRRSTF   : 1;            /*!< (@ 0x0000001F) Low-power reset flag                                       */
    } bit;
  } CSR;
} RCC_Type;                                     /*!< Size = 40 (0x28) */



/* =========================================================================================================================== */
/* ================                                            GPIOA                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief General purpose I/O (GPIOA)
  */

typedef struct {                                /*!< (@ 0x40010800) GPIOA Structure                                            */

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000000) Port configuration register low (GPIOn_CRL)                */

    struct {
      __IOM uint32_t MODE0      : 4;            /*!< (@ 0x00000000) Port n.0 mode bits                                         */
      __IOM uint32_t MODE1      : 4;            /*!< (@ 0x00000004) Port n.1 mode bits                                         */
      __IOM uint32_t MODE2      : 4;            /*!< (@ 0x00000008) Port n.2 mode bits                                         */
      __IOM uint32_t MODE3      : 4;            /*!< (@ 0x0000000C) Port n.3 mode bits                                         */
      __IOM uint32_t MODE4      : 4;            /*!< (@ 0x00000010) Port n.4 mode bits                                         */
      __IOM uint32_t MODE5      : 4;            /*!< (@ 0x00000014) Port n.5 mode bits                                         */
      __IOM uint32_t MODE6      : 4;            /*!< (@ 0x00000018) Port n.6 mode bits                                         */
      __IOM uint32_t MODE7      : 4;            /*!< (@ 0x0000001C) Port n.7 mode bits                                         */

    } bit;
  } CRL;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000004) Port configuration register high (GPIOn_CRL)               */

    struct {
      __IOM uint32_t MODE8       : 4;            /*!< (@ 0x00000000) Port n.0 mode bits                                         */
      __IOM uint32_t MODE9       : 4;            /*!< (@ 0x00000004) Port n.1 mode bits                                         */
      __IOM uint32_t MODE10      : 4;            /*!< (@ 0x00000008) Port n.2 mode bits                                         */
      __IOM uint32_t MODE11      : 4;            /*!< (@ 0x0000000C) Port n.3 mode bits                                         */
      __IOM uint32_t MODE12      : 4;            /*!< (@ 0x00000010) Port n.4 mode bits                                         */
      __IOM uint32_t MODE13      : 4;            /*!< (@ 0x00000014) Port n.5 mode bits                                         */
      __IOM uint32_t MODE14      : 4;            /*!< (@ 0x00000018) Port n.6 mode bits                                         */
      __IOM uint32_t MODE15      : 4;            /*!< (@ 0x0000001C) Port n.7 mode bits                                         */
    } bit;
  } CRH;

  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000008) Port input data register (GPIOn_IDR)                       */

    struct {
      __IM  uint32_t IDR0       : 1;            /*!< (@ 0x00000000) Port input data                                            */
      __IM  uint32_t IDR1       : 1;            /*!< (@ 0x00000001) Port input data                                            */
      __IM  uint32_t IDR2       : 1;            /*!< (@ 0x00000002) Port input data                                            */
      __IM  uint32_t IDR3       : 1;            /*!< (@ 0x00000003) Port input data                                            */
      __IM  uint32_t IDR4       : 1;            /*!< (@ 0x00000004) Port input data                                            */
      __IM  uint32_t IDR5       : 1;            /*!< (@ 0x00000005) Port input data                                            */
      __IM  uint32_t IDR6       : 1;            /*!< (@ 0x00000006) Port input data                                            */
      __IM  uint32_t IDR7       : 1;            /*!< (@ 0x00000007) Port input data                                            */
      __IM  uint32_t IDR8       : 1;            /*!< (@ 0x00000008) Port input data                                            */
      __IM  uint32_t IDR9       : 1;            /*!< (@ 0x00000009) Port input data                                            */
      __IM  uint32_t IDR10      : 1;            /*!< (@ 0x0000000A) Port input data                                            */
      __IM  uint32_t IDR11      : 1;            /*!< (@ 0x0000000B) Port input data                                            */
      __IM  uint32_t IDR12      : 1;            /*!< (@ 0x0000000C) Port input data                                            */
      __IM  uint32_t IDR13      : 1;            /*!< (@ 0x0000000D) Port input data                                            */
      __IM  uint32_t IDR14      : 1;            /*!< (@ 0x0000000E) Port input data                                            */
      __IM  uint32_t IDR15      : 1;            /*!< (@ 0x0000000F) Port input data                                            */
    } bit;
  } IDR;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000000C) Port output data register (GPIOn_ODR)                      */

