pointer-x/stm32f103c8_RCC_CMSIS_bitfields/CMSIS/stm32f103c8_bitfield.h
    struct {
      __IOM uint32_t ODR0       : 1;            /*!< (@ 0x00000000) Port output data                                           */
      __IOM uint32_t ODR1       : 1;            /*!< (@ 0x00000001) Port output data                                           */
      __IOM uint32_t ODR2       : 1;            /*!< (@ 0x00000002) Port output data                                           */
      __IOM uint32_t ODR3       : 1;            /*!< (@ 0x00000003) Port output data                                           */
      __IOM uint32_t ODR4       : 1;            /*!< (@ 0x00000004) Port output data                                           */
      __IOM uint32_t ODR5       : 1;            /*!< (@ 0x00000005) Port output data                                           */
      __IOM uint32_t ODR6       : 1;            /*!< (@ 0x00000006) Port output data                                           */
      __IOM uint32_t ODR7       : 1;            /*!< (@ 0x00000007) Port output data                                           */
      __IOM uint32_t ODR8       : 1;            /*!< (@ 0x00000008) Port output data                                           */
      __IOM uint32_t ODR9       : 1;            /*!< (@ 0x00000009) Port output data                                           */
      __IOM uint32_t ODR10      : 1;            /*!< (@ 0x0000000A) Port output data                                           */
      __IOM uint32_t ODR11      : 1;            /*!< (@ 0x0000000B) Port output data                                           */
      __IOM uint32_t ODR12      : 1;            /*!< (@ 0x0000000C) Port output data                                           */
      __IOM uint32_t ODR13      : 1;            /*!< (@ 0x0000000D) Port output data                                           */
      __IOM uint32_t ODR14      : 1;            /*!< (@ 0x0000000E) Port output data                                           */
      __IOM uint32_t ODR15      : 1;            /*!< (@ 0x0000000F) Port output data                                           */
    } bit;
  } ODR;

  union {
    __OM  uint32_t reg;                         /*!< (@ 0x00000010) Port bit set/reset register (GPIOn_BSRR)                   */

    struct {
      __OM  uint32_t BS0        : 1;            /*!< (@ 0x00000000) Set bit 0                                                  */
      __OM  uint32_t BS1        : 1;            /*!< (@ 0x00000001) Set bit 1                                                  */
      __OM  uint32_t BS2        : 1;            /*!< (@ 0x00000002) Set bit 1                                                  */
      __OM  uint32_t BS3        : 1;            /*!< (@ 0x00000003) Set bit 3                                                  */
      __OM  uint32_t BS4        : 1;            /*!< (@ 0x00000004) Set bit 4                                                  */
      __OM  uint32_t BS5        : 1;            /*!< (@ 0x00000005) Set bit 5                                                  */
      __OM  uint32_t BS6        : 1;            /*!< (@ 0x00000006) Set bit 6                                                  */
      __OM  uint32_t BS7        : 1;            /*!< (@ 0x00000007) Set bit 7                                                  */
      __OM  uint32_t BS8        : 1;            /*!< (@ 0x00000008) Set bit 8                                                  */
      __OM  uint32_t BS9        : 1;            /*!< (@ 0x00000009) Set bit 9                                                  */
      __OM  uint32_t BS10       : 1;            /*!< (@ 0x0000000A) Set bit 10                                                 */
      __OM  uint32_t BS11       : 1;            /*!< (@ 0x0000000B) Set bit 11                                                 */
      __OM  uint32_t BS12       : 1;            /*!< (@ 0x0000000C) Set bit 12                                                 */
      __OM  uint32_t BS13       : 1;            /*!< (@ 0x0000000D) Set bit 13                                                 */
      __OM  uint32_t BS14       : 1;            /*!< (@ 0x0000000E) Set bit 14                                                 */
      __OM  uint32_t BS15       : 1;            /*!< (@ 0x0000000F) Set bit 15                                                 */
      __OM  uint32_t BR0        : 1;            /*!< (@ 0x00000010) Reset bit 0                                                */
      __OM  uint32_t BR1        : 1;            /*!< (@ 0x00000011) Reset bit 1                                                */
      __OM  uint32_t BR2        : 1;            /*!< (@ 0x00000012) Reset bit 2                                                */
      __OM  uint32_t BR3        : 1;            /*!< (@ 0x00000013) Reset bit 3                                                */
      __OM  uint32_t BR4        : 1;            /*!< (@ 0x00000014) Reset bit 4                                                */
      __OM  uint32_t BR5        : 1;            /*!< (@ 0x00000015) Reset bit 5                                                */
      __OM  uint32_t BR6        : 1;            /*!< (@ 0x00000016) Reset bit 6                                                */
      __OM  uint32_t BR7        : 1;            /*!< (@ 0x00000017) Reset bit 7                                                */
      __OM  uint32_t BR8        : 1;            /*!< (@ 0x00000018) Reset bit 8                                                */
      __OM  uint32_t BR9        : 1;            /*!< (@ 0x00000019) Reset bit 9                                                */
      __OM  uint32_t BR10       : 1;            /*!< (@ 0x0000001A) Reset bit 10                                               */
      __OM  uint32_t BR11       : 1;            /*!< (@ 0x0000001B) Reset bit 11                                               */
      __OM  uint32_t BR12       : 1;            /*!< (@ 0x0000001C) Reset bit 12                                               */
      __OM  uint32_t BR13       : 1;            /*!< (@ 0x0000001D) Reset bit 13                                               */
      __OM  uint32_t BR14       : 1;            /*!< (@ 0x0000001E) Reset bit 14                                               */
      __OM  uint32_t BR15       : 1;            /*!< (@ 0x0000001F) Reset bit 15                                               */
    } bit;
  } BSRR;

  union {
    __OM  uint32_t reg;                         /*!< (@ 0x00000014) Port bit reset register (GPIOn_BRR)                        */

