pointer-x/stm32f103c8_RCC_CMSIS_bitfields/CMSIS/stm32f103c8_bitfield.h
    struct {
      __OM  uint32_t BR0        : 1;            /*!< (@ 0x00000000) Reset bit 0                                                */
      __OM  uint32_t BR1        : 1;            /*!< (@ 0x00000001) Reset bit 1                                                */
      __OM  uint32_t BR2        : 1;            /*!< (@ 0x00000002) Reset bit 1                                                */
      __OM  uint32_t BR3        : 1;            /*!< (@ 0x00000003) Reset bit 3                                                */
      __OM  uint32_t BR4        : 1;            /*!< (@ 0x00000004) Reset bit 4                                                */
      __OM  uint32_t BR5        : 1;            /*!< (@ 0x00000005) Reset bit 5                                                */
      __OM  uint32_t BR6        : 1;            /*!< (@ 0x00000006) Reset bit 6                                                */
      __OM  uint32_t BR7        : 1;            /*!< (@ 0x00000007) Reset bit 7                                                */
      __OM  uint32_t BR8        : 1;            /*!< (@ 0x00000008) Reset bit 8                                                */
      __OM  uint32_t BR9        : 1;            /*!< (@ 0x00000009) Reset bit 9                                                */
      __OM  uint32_t BR10       : 1;            /*!< (@ 0x0000000A) Reset bit 10                                               */
      __OM  uint32_t BR11       : 1;            /*!< (@ 0x0000000B) Reset bit 11                                               */
      __OM  uint32_t BR12       : 1;            /*!< (@ 0x0000000C) Reset bit 12                                               */
      __OM  uint32_t BR13       : 1;            /*!< (@ 0x0000000D) Reset bit 13                                               */
      __OM  uint32_t BR14       : 1;            /*!< (@ 0x0000000E) Reset bit 14                                               */
      __OM  uint32_t BR15       : 1;            /*!< (@ 0x0000000F) Reset bit 15                                               */
    } bit;
  } BRR;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000018) Port configuration lock register                           */

    struct {
      __IOM uint32_t LCK0       : 1;            /*!< (@ 0x00000000) Port A Lock bit 0                                          */
      __IOM uint32_t LCK1       : 1;            /*!< (@ 0x00000001) Port A Lock bit 1                                          */
      __IOM uint32_t LCK2       : 1;            /*!< (@ 0x00000002) Port A Lock bit 2                                          */
      __IOM uint32_t LCK3       : 1;            /*!< (@ 0x00000003) Port A Lock bit 3                                          */
      __IOM uint32_t LCK4       : 1;            /*!< (@ 0x00000004) Port A Lock bit 4                                          */
      __IOM uint32_t LCK5       : 1;            /*!< (@ 0x00000005) Port A Lock bit 5                                          */
      __IOM uint32_t LCK6       : 1;            /*!< (@ 0x00000006) Port A Lock bit 6                                          */
      __IOM uint32_t LCK7       : 1;            /*!< (@ 0x00000007) Port A Lock bit 7                                          */
      __IOM uint32_t LCK8       : 1;            /*!< (@ 0x00000008) Port A Lock bit 8                                          */
      __IOM uint32_t LCK9       : 1;            /*!< (@ 0x00000009) Port A Lock bit 9                                          */
      __IOM uint32_t LCK10      : 1;            /*!< (@ 0x0000000A) Port A Lock bit 10                                         */
      __IOM uint32_t LCK11      : 1;            /*!< (@ 0x0000000B) Port A Lock bit 11                                         */
      __IOM uint32_t LCK12      : 1;            /*!< (@ 0x0000000C) Port A Lock bit 12                                         */
      __IOM uint32_t LCK13      : 1;            /*!< (@ 0x0000000D) Port A Lock bit 13                                         */
      __IOM uint32_t LCK14      : 1;            /*!< (@ 0x0000000E) Port A Lock bit 14                                         */
      __IOM uint32_t LCK15      : 1;            /*!< (@ 0x0000000F) Port A Lock bit 15                                         */
      __IOM uint32_t LCKK       : 1;            /*!< (@ 0x00000010) Lock key                                                   */
    } bit;
  } LCKR;
} GPIOA_Type;                                   /*!< Size = 28 (0x1c)                                                          */



/* =========================================================================================================================== */
/* ================                                           AFIO                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Alternate function I/O (AFIO)
  */

typedef struct {                                /*!< (@ 0x40010000) AFIO Structure                                             */

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000000) Event Control Register (AFIO_EVCR)                         */

    struct {
      __IOM uint32_t PIN        : 4;            /*!< (@ 0x00000000) Pin selection                                              */
      __IOM uint32_t PORT       : 3;            /*!< (@ 0x00000004) Port selection                                             */
      __IOM uint32_t EVOE       : 1;            /*!< (@ 0x00000007) Event Output Enable                                        */
    } bit;
  } EVCR;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000004) AF remap and debug I/O configuration register
                                                                    (AFIO_MAPR)                                                */

