pointer-x/stm32f103c8_RCC_CMSIS_bitfields/CMSIS/stm32f103c8_bitfield.h
    struct {
      __IOM uint32_t SPI1_REMAP : 1;            /*!< (@ 0x00000000) SPI1 remapping                                             */
      __IOM uint32_t I2C1_REMAP : 1;            /*!< (@ 0x00000001) I2C1 remapping                                             */
      __IOM uint32_t USART1_REMAP : 1;          /*!< (@ 0x00000002) USART1 remapping                                           */
      __IOM uint32_t USART2_REMAP : 1;          /*!< (@ 0x00000003) USART2 remapping                                           */
      __IOM uint32_t USART3_REMAP : 2;          /*!< (@ 0x00000004) USART3 remapping                                           */
      __IOM uint32_t TIM1_REMAP : 2;            /*!< (@ 0x00000006) TIM1 remapping                                             */
      __IOM uint32_t TIM2_REMAP : 2;            /*!< (@ 0x00000008) TIM2 remapping                                             */
      __IOM uint32_t TIM3_REMAP : 2;            /*!< (@ 0x0000000A) TIM3 remapping                                             */
      __IOM uint32_t TIM4_REMAP : 1;            /*!< (@ 0x0000000C) TIM4 remapping                                             */
      __IOM uint32_t CAN_REMAP  : 2;            /*!< (@ 0x0000000D) CAN1 remapping                                             */
      __IOM uint32_t PD01_REMAP : 1;            /*!< (@ 0x0000000F) Port D0/Port D1 mapping on OSCIN/OSCOUT                    */
      __IOM uint32_t TIM5CH4_IREMAP : 1;        /*!< (@ 0x00000010) Set and cleared by software                                */
      __IOM uint32_t ADC1_ETRGINJ_REMAP : 1;    /*!< (@ 0x00000011) ADC 1 External trigger injected conversion remapping       */
      __IOM uint32_t ADC1_ETRGREG_REMAP : 1;    /*!< (@ 0x00000012) ADC 1 external trigger regular conversion remapping        */
      __IOM uint32_t ADC2_ETRGINJ_REMAP : 1;    /*!< (@ 0x00000013) ADC 2 external trigger injected conversion remapping       */
      __IOM uint32_t ADC2_ETRGREG_REMAP : 1;    /*!< (@ 0x00000014) ADC 2 external trigger regular conversion remapping        */
      __IM  uint32_t            : 3;
      __OM  uint32_t SWJ_CFG    : 3;            /*!< (@ 0x00000018) Serial wire JTAG configuration                             */
    } bit;
  } MAPR;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000008) External interrupt configuration register 1 (AFIO_EXTICR1) */

    struct {
      __IOM uint32_t EXTI0      : 4;            /*!< (@ 0x00000000) EXTI0 configuration                                        */
      __IOM uint32_t EXTI1      : 4;            /*!< (@ 0x00000004) EXTI1 configuration                                        */
      __IOM uint32_t EXTI2      : 4;            /*!< (@ 0x00000008) EXTI2 configuration                                        */
      __IOM uint32_t EXTI3      : 4;            /*!< (@ 0x0000000C) EXTI3 configuration                                        */
    } bit;
  } EXTICR1;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000000C) External interrupt configuration register 2 (AFIO_EXTICR2) */

    struct {
      __IOM uint32_t EXTI4      : 4;            /*!< (@ 0x00000000) EXTI4 configuration                                        */
      __IOM uint32_t EXTI5      : 4;            /*!< (@ 0x00000004) EXTI5 configuration                                        */
      __IOM uint32_t EXTI6      : 4;            /*!< (@ 0x00000008) EXTI6 configuration                                        */
      __IOM uint32_t EXTI7      : 4;            /*!< (@ 0x0000000C) EXTI7 configuration                                        */
    } bit;
  } EXTICR2;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000010) External interrupt configuration register 3 (AFIO_EXTICR3) */

    struct {
      __IOM uint32_t EXTI8      : 4;            /*!< (@ 0x00000000) EXTI8 configuration                                        */
      __IOM uint32_t EXTI9      : 4;            /*!< (@ 0x00000004) EXTI9 configuration                                        */
      __IOM uint32_t EXTI10     : 4;            /*!< (@ 0x00000008) EXTI10 configuration                                       */
      __IOM uint32_t EXTI11     : 4;            /*!< (@ 0x0000000C) EXTI11 configuration                                       */
    } bit;
  } EXTICR3;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000014) External interrupt configuration register 4 (AFIO_EXTICR4) */

    struct {
      __IOM uint32_t EXTI12     : 4;            /*!< (@ 0x00000000) EXTI12 configuration                                       */
      __IOM uint32_t EXTI13     : 4;            /*!< (@ 0x00000004) EXTI13 configuration                                       */
      __IOM uint32_t EXTI14     : 4;            /*!< (@ 0x00000008) EXTI14 configuration                                       */
      __IOM uint32_t EXTI15     : 4;            /*!< (@ 0x0000000C) EXTI15 configuration                                       */
    } bit;
  } EXTICR4;
  __IM  uint32_t  RESERVED;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000001C) AF remap and debug I/O configuration register              */

    struct {
      __IM  uint32_t            : 5;
      __IOM uint32_t TIM9_REMAP : 1;            /*!< (@ 0x00000005) TIM9 remapping                                             */
      __IOM uint32_t TIM10_REMAP : 1;           /*!< (@ 0x00000006) TIM10 remapping                                            */
      __IOM uint32_t TIM11_REMAP : 1;           /*!< (@ 0x00000007) TIM11 remapping                                            */
      __IOM uint32_t TIM13_REMAP : 1;           /*!< (@ 0x00000008) TIM13 remapping                                            */
      __IOM uint32_t TIM14_REMAP : 1;           /*!< (@ 0x00000009) TIM14 remapping                                            */
      __IOM uint32_t FSMC_NADV  : 1;            /*!< (@ 0x0000000A) NADV connect/disconnect                                    */
    } bit;
  } MAPR2;
} AFIO_Type;                                    /*!< Size = 32 (0x20)                                                          */



/* =========================================================================================================================== */
/* ================                                           EXTI                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief EXTI (EXTI)
  */

typedef struct {                                /*!< (@ 0x40010400) EXTI Structure                                             */

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000000) Interrupt mask register (EXTI_IMR)                         */

