pointer-x/stm32f103c8_RCC_CMSIS_bitfields/CMSIS/stm32f103c8_bitfield.h
    struct {
      __IOM uint32_t MR0        : 1;            /*!< (@ 0x00000000) Interrupt Mask on line 0                                   */
      __IOM uint32_t MR1        : 1;            /*!< (@ 0x00000001) Interrupt Mask on line 1                                   */
      __IOM uint32_t MR2        : 1;            /*!< (@ 0x00000002) Interrupt Mask on line 2                                   */
      __IOM uint32_t MR3        : 1;            /*!< (@ 0x00000003) Interrupt Mask on line 3                                   */
      __IOM uint32_t MR4        : 1;            /*!< (@ 0x00000004) Interrupt Mask on line 4                                   */
      __IOM uint32_t MR5        : 1;            /*!< (@ 0x00000005) Interrupt Mask on line 5                                   */
      __IOM uint32_t MR6        : 1;            /*!< (@ 0x00000006) Interrupt Mask on line 6                                   */
      __IOM uint32_t MR7        : 1;            /*!< (@ 0x00000007) Interrupt Mask on line 7                                   */
      __IOM uint32_t MR8        : 1;            /*!< (@ 0x00000008) Interrupt Mask on line 8                                   */
      __IOM uint32_t MR9        : 1;            /*!< (@ 0x00000009) Interrupt Mask on line 9                                   */
      __IOM uint32_t MR10       : 1;            /*!< (@ 0x0000000A) Interrupt Mask on line 10                                  */
      __IOM uint32_t MR11       : 1;            /*!< (@ 0x0000000B) Interrupt Mask on line 11                                  */
      __IOM uint32_t MR12       : 1;            /*!< (@ 0x0000000C) Interrupt Mask on line 12                                  */
      __IOM uint32_t MR13       : 1;            /*!< (@ 0x0000000D) Interrupt Mask on line 13                                  */
      __IOM uint32_t MR14       : 1;            /*!< (@ 0x0000000E) Interrupt Mask on line 14                                  */
      __IOM uint32_t MR15       : 1;            /*!< (@ 0x0000000F) Interrupt Mask on line 15                                  */
      __IOM uint32_t MR16       : 1;            /*!< (@ 0x00000010) Interrupt Mask on line 16                                  */
      __IOM uint32_t MR17       : 1;            /*!< (@ 0x00000011) Interrupt Mask on line 17                                  */
      __IOM uint32_t MR18       : 1;            /*!< (@ 0x00000012) Interrupt Mask on line 18                                  */
    } bit;
  } IMR;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000004) Event mask register (EXTI_EMR)                             */

    struct {
      __IOM uint32_t MR0        : 1;            /*!< (@ 0x00000000) Event Mask on line 0                                       */
      __IOM uint32_t MR1        : 1;            /*!< (@ 0x00000001) Event Mask on line 1                                       */
      __IOM uint32_t MR2        : 1;            /*!< (@ 0x00000002) Event Mask on line 2                                       */
      __IOM uint32_t MR3        : 1;            /*!< (@ 0x00000003) Event Mask on line 3                                       */
      __IOM uint32_t MR4        : 1;            /*!< (@ 0x00000004) Event Mask on line 4                                       */
      __IOM uint32_t MR5        : 1;            /*!< (@ 0x00000005) Event Mask on line 5                                       */
      __IOM uint32_t MR6        : 1;            /*!< (@ 0x00000006) Event Mask on line 6                                       */
      __IOM uint32_t MR7        : 1;            /*!< (@ 0x00000007) Event Mask on line 7                                       */
      __IOM uint32_t MR8        : 1;            /*!< (@ 0x00000008) Event Mask on line 8                                       */
      __IOM uint32_t MR9        : 1;            /*!< (@ 0x00000009) Event Mask on line 9                                       */
      __IOM uint32_t MR10       : 1;            /*!< (@ 0x0000000A) Event Mask on line 10                                      */
      __IOM uint32_t MR11       : 1;            /*!< (@ 0x0000000B) Event Mask on line 11                                      */
      __IOM uint32_t MR12       : 1;            /*!< (@ 0x0000000C) Event Mask on line 12                                      */
      __IOM uint32_t MR13       : 1;            /*!< (@ 0x0000000D) Event Mask on line 13                                      */
      __IOM uint32_t MR14       : 1;            /*!< (@ 0x0000000E) Event Mask on line 14                                      */
      __IOM uint32_t MR15       : 1;            /*!< (@ 0x0000000F) Event Mask on line 15                                      */
      __IOM uint32_t MR16       : 1;            /*!< (@ 0x00000010) Event Mask on line 16                                      */
      __IOM uint32_t MR17       : 1;            /*!< (@ 0x00000011) Event Mask on line 17                                      */
      __IOM uint32_t MR18       : 1;            /*!< (@ 0x00000012) Event Mask on line 18                                      */
    } bit;
  } EMR;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000008) Rising Trigger selection register (EXTI_RTSR)              */

    struct {
      __IOM uint32_t TR0        : 1;            /*!< (@ 0x00000000) Rising trigger event configuration of line 0               */
      __IOM uint32_t TR1        : 1;            /*!< (@ 0x00000001) Rising trigger event configuration of line 1               */
      __IOM uint32_t TR2        : 1;            /*!< (@ 0x00000002) Rising trigger event configuration of line 2               */
      __IOM uint32_t TR3        : 1;            /*!< (@ 0x00000003) Rising trigger event configuration of line 3               */
      __IOM uint32_t TR4        : 1;            /*!< (@ 0x00000004) Rising trigger event configuration of line 4               */
      __IOM uint32_t TR5        : 1;            /*!< (@ 0x00000005) Rising trigger event configuration of line 5               */
      __IOM uint32_t TR6        : 1;            /*!< (@ 0x00000006) Rising trigger event configuration of line 6               */
      __IOM uint32_t TR7        : 1;            /*!< (@ 0x00000007) Rising trigger event configuration of line 7               */
      __IOM uint32_t TR8        : 1;            /*!< (@ 0x00000008) Rising trigger event configuration of line 8               */
      __IOM uint32_t TR9        : 1;            /*!< (@ 0x00000009) Rising trigger event configuration of line 9               */
      __IOM uint32_t TR10       : 1;            /*!< (@ 0x0000000A) Rising trigger event configuration of line 10              */
      __IOM uint32_t TR11       : 1;            /*!< (@ 0x0000000B) Rising trigger event configuration of line 11              */
      __IOM uint32_t TR12       : 1;            /*!< (@ 0x0000000C) Rising trigger event configuration of line 12              */
      __IOM uint32_t TR13       : 1;            /*!< (@ 0x0000000D) Rising trigger event configuration of line 13              */
      __IOM uint32_t TR14       : 1;            /*!< (@ 0x0000000E) Rising trigger event configuration of line 14              */
      __IOM uint32_t TR15       : 1;            /*!< (@ 0x0000000F) Rising trigger event configuration of line 15              */
      __IOM uint32_t TR16       : 1;            /*!< (@ 0x00000010) Rising trigger event configuration of line 16              */
      __IOM uint32_t TR17       : 1;            /*!< (@ 0x00000011) Rising trigger event configuration of line 17              */
      __IOM uint32_t TR18       : 1;            /*!< (@ 0x00000012) Rising trigger event configuration of line 18              */
    } bit;
  } RTSR;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000000C) Falling Trigger selection register (EXTI_FTSR)             */

