pointer-x/stm32f103c8_RCC_CMSIS_bitfields/CMSIS/stm32f103c8_bitfield.h
    struct {
      __IOM uint32_t TR0        : 1;            /*!< (@ 0x00000000) Falling trigger event configuration of line 0              */
      __IOM uint32_t TR1        : 1;            /*!< (@ 0x00000001) Falling trigger event configuration of line 1              */
      __IOM uint32_t TR2        : 1;            /*!< (@ 0x00000002) Falling trigger event configuration of line 2              */
      __IOM uint32_t TR3        : 1;            /*!< (@ 0x00000003) Falling trigger event configuration of line 3              */
      __IOM uint32_t TR4        : 1;            /*!< (@ 0x00000004) Falling trigger event configuration of line 4              */
      __IOM uint32_t TR5        : 1;            /*!< (@ 0x00000005) Falling trigger event configuration of line 5              */
      __IOM uint32_t TR6        : 1;            /*!< (@ 0x00000006) Falling trigger event configuration of line 6              */
      __IOM uint32_t TR7        : 1;            /*!< (@ 0x00000007) Falling trigger event configuration of line 7              */
      __IOM uint32_t TR8        : 1;            /*!< (@ 0x00000008) Falling trigger event configuration of line 8              */
      __IOM uint32_t TR9        : 1;            /*!< (@ 0x00000009) Falling trigger event configuration of line 9              */
      __IOM uint32_t TR10       : 1;            /*!< (@ 0x0000000A) Falling trigger event configuration of line 10             */
      __IOM uint32_t TR11       : 1;            /*!< (@ 0x0000000B) Falling trigger event configuration of line 11             */
      __IOM uint32_t TR12       : 1;            /*!< (@ 0x0000000C) Falling trigger event configuration of line 12             */
      __IOM uint32_t TR13       : 1;            /*!< (@ 0x0000000D) Falling trigger event configuration of line 13             */
      __IOM uint32_t TR14       : 1;            /*!< (@ 0x0000000E) Falling trigger event configuration of line 14             */
      __IOM uint32_t TR15       : 1;            /*!< (@ 0x0000000F) Falling trigger event configuration of line 15             */
      __IOM uint32_t TR16       : 1;            /*!< (@ 0x00000010) Falling trigger event configuration of line 16             */
      __IOM uint32_t TR17       : 1;            /*!< (@ 0x00000011) Falling trigger event configuration of line 17             */
      __IOM uint32_t TR18       : 1;            /*!< (@ 0x00000012) Falling trigger event configuration of line 18             */
    } bit;
  } FTSR;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000010) Software interrupt event register (EXTI_SWIER)             */

    struct {
      __IOM uint32_t SWIER0     : 1;            /*!< (@ 0x00000000) Software Interrupt on line 0                               */
      __IOM uint32_t SWIER1     : 1;            /*!< (@ 0x00000001) Software Interrupt on line 1                               */
      __IOM uint32_t SWIER2     : 1;            /*!< (@ 0x00000002) Software Interrupt on line 2                               */
      __IOM uint32_t SWIER3     : 1;            /*!< (@ 0x00000003) Software Interrupt on line 3                               */
      __IOM uint32_t SWIER4     : 1;            /*!< (@ 0x00000004) Software Interrupt on line 4                               */
      __IOM uint32_t SWIER5     : 1;            /*!< (@ 0x00000005) Software Interrupt on line 5                               */
      __IOM uint32_t SWIER6     : 1;            /*!< (@ 0x00000006) Software Interrupt on line 6                               */
      __IOM uint32_t SWIER7     : 1;            /*!< (@ 0x00000007) Software Interrupt on line 7                               */
      __IOM uint32_t SWIER8     : 1;            /*!< (@ 0x00000008) Software Interrupt on line 8                               */
      __IOM uint32_t SWIER9     : 1;            /*!< (@ 0x00000009) Software Interrupt on line 9                               */
      __IOM uint32_t SWIER10    : 1;            /*!< (@ 0x0000000A) Software Interrupt on line 10                              */
      __IOM uint32_t SWIER11    : 1;            /*!< (@ 0x0000000B) Software Interrupt on line 11                              */
      __IOM uint32_t SWIER12    : 1;            /*!< (@ 0x0000000C) Software Interrupt on line 12                              */
      __IOM uint32_t SWIER13    : 1;            /*!< (@ 0x0000000D) Software Interrupt on line 13                              */
      __IOM uint32_t SWIER14    : 1;            /*!< (@ 0x0000000E) Software Interrupt on line 14                              */
      __IOM uint32_t SWIER15    : 1;            /*!< (@ 0x0000000F) Software Interrupt on line 15                              */
      __IOM uint32_t SWIER16    : 1;            /*!< (@ 0x00000010) Software Interrupt on line 16                              */
      __IOM uint32_t SWIER17    : 1;            /*!< (@ 0x00000011) Software Interrupt on line 17                              */
      __IOM uint32_t SWIER18    : 1;            /*!< (@ 0x00000012) Software Interrupt on line 18                              */
    } bit;
  } SWIER;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000014) Pending register (EXTI_PR)                                 */

    struct {
      __IOM uint32_t PR0        : 1;            /*!< (@ 0x00000000) Pending bit 0                                              */
      __IOM uint32_t PR1        : 1;            /*!< (@ 0x00000001) Pending bit 1                                              */
      __IOM uint32_t PR2        : 1;            /*!< (@ 0x00000002) Pending bit 2                                              */
      __IOM uint32_t PR3        : 1;            /*!< (@ 0x00000003) Pending bit 3                                              */
      __IOM uint32_t PR4        : 1;            /*!< (@ 0x00000004) Pending bit 4                                              */
      __IOM uint32_t PR5        : 1;            /*!< (@ 0x00000005) Pending bit 5                                              */
      __IOM uint32_t PR6        : 1;            /*!< (@ 0x00000006) Pending bit 6                                              */
      __IOM uint32_t PR7        : 1;            /*!< (@ 0x00000007) Pending bit 7                                              */
      __IOM uint32_t PR8        : 1;            /*!< (@ 0x00000008) Pending bit 8                                              */
      __IOM uint32_t PR9        : 1;            /*!< (@ 0x00000009) Pending bit 9                                              */
      __IOM uint32_t PR10       : 1;            /*!< (@ 0x0000000A) Pending bit 10                                             */
      __IOM uint32_t PR11       : 1;            /*!< (@ 0x0000000B) Pending bit 11                                             */
      __IOM uint32_t PR12       : 1;            /*!< (@ 0x0000000C) Pending bit 12                                             */
      __IOM uint32_t PR13       : 1;            /*!< (@ 0x0000000D) Pending bit 13                                             */
      __IOM uint32_t PR14       : 1;            /*!< (@ 0x0000000E) Pending bit 14                                             */
      __IOM uint32_t PR15       : 1;            /*!< (@ 0x0000000F) Pending bit 15                                             */
      __IOM uint32_t PR16       : 1;            /*!< (@ 0x00000010) Pending bit 16                                             */
      __IOM uint32_t PR17       : 1;            /*!< (@ 0x00000011) Pending bit 17                                             */
      __IOM uint32_t PR18       : 1;            /*!< (@ 0x00000012) Pending bit 18                                             */
    } bit;
  } PR;
} EXTI_Type;                                    /*!< Size = 24 (0x18)                                                          */




/* =========================================================================================================================== */
/* ================                                           DMA1                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief DMA controller (DMA1)
  */

typedef struct {                                /*!< (@ 0x40020000) DMA1 Structure                                             */

  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000000) DMA interrupt status register (DMA_ISR)                    */

