pointer-x/stm32f103c8_RCC_CMSIS_bitfields/CMSIS/stm32f103c8_bitfield.h
    struct {
      __IM  uint32_t GIF1       : 1;            /*!< (@ 0x00000000) Channel 1 Global interrupt flag                            */
      __IM  uint32_t TCIF1      : 1;            /*!< (@ 0x00000001) Channel 1 Transfer Complete flag                           */
      __IM  uint32_t HTIF1      : 1;            /*!< (@ 0x00000002) Channel 1 Half Transfer Complete flag                      */
      __IM  uint32_t TEIF1      : 1;            /*!< (@ 0x00000003) Channel 1 Transfer Error flag                              */
      __IM  uint32_t GIF2       : 1;            /*!< (@ 0x00000004) Channel 2 Global interrupt flag                            */
      __IM  uint32_t TCIF2      : 1;            /*!< (@ 0x00000005) Channel 2 Transfer Complete flag                           */
      __IM  uint32_t HTIF2      : 1;            /*!< (@ 0x00000006) Channel 2 Half Transfer Complete flag                      */
      __IM  uint32_t TEIF2      : 1;            /*!< (@ 0x00000007) Channel 2 Transfer Error flag                              */
      __IM  uint32_t GIF3       : 1;            /*!< (@ 0x00000008) Channel 3 Global interrupt flag                            */
      __IM  uint32_t TCIF3      : 1;            /*!< (@ 0x00000009) Channel 3 Transfer Complete flag                           */
      __IM  uint32_t HTIF3      : 1;            /*!< (@ 0x0000000A) Channel 3 Half Transfer Complete flag                      */
      __IM  uint32_t TEIF3      : 1;            /*!< (@ 0x0000000B) Channel 3 Transfer Error flag                              */
      __IM  uint32_t GIF4       : 1;            /*!< (@ 0x0000000C) Channel 4 Global interrupt flag                            */
      __IM  uint32_t TCIF4      : 1;            /*!< (@ 0x0000000D) Channel 4 Transfer Complete flag                           */
      __IM  uint32_t HTIF4      : 1;            /*!< (@ 0x0000000E) Channel 4 Half Transfer Complete flag                      */
      __IM  uint32_t TEIF4      : 1;            /*!< (@ 0x0000000F) Channel 4 Transfer Error flag                              */
      __IM  uint32_t GIF5       : 1;            /*!< (@ 0x00000010) Channel 5 Global interrupt flag                            */
      __IM  uint32_t TCIF5      : 1;            /*!< (@ 0x00000011) Channel 5 Transfer Complete flag                           */
      __IM  uint32_t HTIF5      : 1;            /*!< (@ 0x00000012) Channel 5 Half Transfer Complete flag                      */
      __IM  uint32_t TEIF5      : 1;            /*!< (@ 0x00000013) Channel 5 Transfer Error flag                              */
      __IM  uint32_t GIF6       : 1;            /*!< (@ 0x00000014) Channel 6 Global interrupt flag                            */
      __IM  uint32_t TCIF6      : 1;            /*!< (@ 0x00000015) Channel 6 Transfer Complete flag                           */
      __IM  uint32_t HTIF6      : 1;            /*!< (@ 0x00000016) Channel 6 Half Transfer Complete flag                      */
      __IM  uint32_t TEIF6      : 1;            /*!< (@ 0x00000017) Channel 6 Transfer Error flag                              */
      __IM  uint32_t GIF7       : 1;            /*!< (@ 0x00000018) Channel 7 Global interrupt flag                            */
      __IM  uint32_t TCIF7      : 1;            /*!< (@ 0x00000019) Channel 7 Transfer Complete flag                           */
      __IM  uint32_t HTIF7      : 1;            /*!< (@ 0x0000001A) Channel 7 Half Transfer Complete flag                      */
      __IM  uint32_t TEIF7      : 1;            /*!< (@ 0x0000001B) Channel 7 Transfer Error flag                              */
    } bit;
  } ISR;

  union {
    __OM  uint32_t reg;                         /*!< (@ 0x00000004) DMA interrupt flag clear register (DMA_IFCR)               */

    struct {
      __OM  uint32_t CGIF1      : 1;            /*!< (@ 0x00000000) Channel 1 Global interrupt clear                           */
      __OM  uint32_t CTCIF1     : 1;            /*!< (@ 0x00000001) Channel 1 Transfer Complete clear                          */
      __OM  uint32_t CHTIF1     : 1;            /*!< (@ 0x00000002) Channel 1 Half Transfer clear                              */
      __OM  uint32_t CTEIF1     : 1;            /*!< (@ 0x00000003) Channel 1 Transfer Error clear                             */
      __OM  uint32_t CGIF2      : 1;            /*!< (@ 0x00000004) Channel 2 Global interrupt clear                           */
      __OM  uint32_t CTCIF2     : 1;            /*!< (@ 0x00000005) Channel 2 Transfer Complete clear                          */
      __OM  uint32_t CHTIF2     : 1;            /*!< (@ 0x00000006) Channel 2 Half Transfer clear                              */
      __OM  uint32_t CTEIF2     : 1;            /*!< (@ 0x00000007) Channel 2 Transfer Error clear                             */
      __OM  uint32_t CGIF3      : 1;            /*!< (@ 0x00000008) Channel 3 Global interrupt clear                           */
      __OM  uint32_t CTCIF3     : 1;            /*!< (@ 0x00000009) Channel 3 Transfer Complete clear                          */
      __OM  uint32_t CHTIF3     : 1;            /*!< (@ 0x0000000A) Channel 3 Half Transfer clear                              */
      __OM  uint32_t CTEIF3     : 1;            /*!< (@ 0x0000000B) Channel 3 Transfer Error clear                             */
      __OM  uint32_t CGIF4      : 1;            /*!< (@ 0x0000000C) Channel 4 Global interrupt clear                           */
      __OM  uint32_t CTCIF4     : 1;            /*!< (@ 0x0000000D) Channel 4 Transfer Complete clear                          */
      __OM  uint32_t CHTIF4     : 1;            /*!< (@ 0x0000000E) Channel 4 Half Transfer clear                              */
      __OM  uint32_t CTEIF4     : 1;            /*!< (@ 0x0000000F) Channel 4 Transfer Error clear                             */
      __OM  uint32_t CGIF5      : 1;            /*!< (@ 0x00000010) Channel 5 Global interrupt clear                           */
      __OM  uint32_t CTCIF5     : 1;            /*!< (@ 0x00000011) Channel 5 Transfer Complete clear                          */
      __OM  uint32_t CHTIF5     : 1;            /*!< (@ 0x00000012) Channel 5 Half Transfer clear                              */
      __OM  uint32_t CTEIF5     : 1;            /*!< (@ 0x00000013) Channel 5 Transfer Error clear                             */
      __OM  uint32_t CGIF6      : 1;            /*!< (@ 0x00000014) Channel 6 Global interrupt clear                           */
      __OM  uint32_t CTCIF6     : 1;            /*!< (@ 0x00000015) Channel 6 Transfer Complete clear                          */
      __OM  uint32_t CHTIF6     : 1;            /*!< (@ 0x00000016) Channel 6 Half Transfer clear                              */
      __OM  uint32_t CTEIF6     : 1;            /*!< (@ 0x00000017) Channel 6 Transfer Error clear                             */
      __OM  uint32_t CGIF7      : 1;            /*!< (@ 0x00000018) Channel 7 Global interrupt clear                           */
      __OM  uint32_t CTCIF7     : 1;            /*!< (@ 0x00000019) Channel 7 Transfer Complete clear                          */
      __OM  uint32_t CHTIF7     : 1;            /*!< (@ 0x0000001A) Channel 7 Half Transfer clear                              */
      __OM  uint32_t CTEIF7     : 1;            /*!< (@ 0x0000001B) Channel 7 Transfer Error clear                             */
    } bit;
  } IFCR;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000008) DMA channel configuration register (DMA_CCR)               */

