pointer-x/stm32f103c8_RCC_CMSIS_bitfields/CMSIS/stm32f103c8_bitfield.h
    struct {
      __IOM uint32_t EN         : 1;            /*!< (@ 0x00000000) Channel enable                                             */
      __IOM uint32_t TCIE       : 1;            /*!< (@ 0x00000001) Transfer complete interrupt enable                         */
      __IOM uint32_t HTIE       : 1;            /*!< (@ 0x00000002) Half Transfer interrupt enable                             */
      __IOM uint32_t TEIE       : 1;            /*!< (@ 0x00000003) Transfer error interrupt enable                            */
      __IOM uint32_t DIR        : 1;            /*!< (@ 0x00000004) Data transfer direction                                    */
      __IOM uint32_t CIRC       : 1;            /*!< (@ 0x00000005) Circular mode                                              */
      __IOM uint32_t PINC       : 1;            /*!< (@ 0x00000006) Peripheral increment mode                                  */
      __IOM uint32_t MINC       : 1;            /*!< (@ 0x00000007) Memory increment mode                                      */
      __IOM uint32_t PSIZE      : 2;            /*!< (@ 0x00000008) Peripheral size                                            */
      __IOM uint32_t MSIZE      : 2;            /*!< (@ 0x0000000A) Memory size                                                */
      __IOM uint32_t PL         : 2;            /*!< (@ 0x0000000C) Channel Priority level                                     */
      __IOM uint32_t MEM2MEM    : 1;            /*!< (@ 0x0000000E) Memory to memory mode                                      */
      uint32_t                  : 17;
    } bit;
  } CCR1;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000000C) DMA channel 1 number of data register                      */

    struct {
      __IOM uint32_t NDT        : 16;           /*!< (@ 0x00000000) Number of data to transfer                                 */
    } bit;
  } CNDTR1;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000010) DMA channel 1 peripheral address register                  */

    struct {
      __IOM uint32_t PA         : 32;           /*!< (@ 0x00000000) Peripheral address                                         */
    } bit;
  } CPAR1;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000014) DMA channel 1 memory address register                      */

    struct {
      __IOM uint32_t MA         : 32;           /*!< (@ 0x00000000) Memory address                                             */
    } bit;
  } CMAR1;
  __IM  uint32_t  RESERVED;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000001C) DMA channel configuration register (DMA_CCR)               */

    struct {
      __IOM uint32_t EN         : 1;            /*!< (@ 0x00000000) Channel enable                                             */
      __IOM uint32_t TCIE       : 1;            /*!< (@ 0x00000001) Transfer complete interrupt enable                         */
      __IOM uint32_t HTIE       : 1;            /*!< (@ 0x00000002) Half Transfer interrupt enable                             */
      __IOM uint32_t TEIE       : 1;            /*!< (@ 0x00000003) Transfer error interrupt enable                            */
      __IOM uint32_t DIR        : 1;            /*!< (@ 0x00000004) Data transfer direction                                    */
      __IOM uint32_t CIRC       : 1;            /*!< (@ 0x00000005) Circular mode                                              */
      __IOM uint32_t PINC       : 1;            /*!< (@ 0x00000006) Peripheral increment mode                                  */
      __IOM uint32_t MINC       : 1;            /*!< (@ 0x00000007) Memory increment mode                                      */
      __IOM uint32_t PSIZE      : 2;            /*!< (@ 0x00000008) Peripheral size                                            */
      __IOM uint32_t MSIZE      : 2;            /*!< (@ 0x0000000A) Memory size                                                */
      __IOM uint32_t PL         : 2;            /*!< (@ 0x0000000C) Channel Priority level                                     */
      __IOM uint32_t MEM2MEM    : 1;            /*!< (@ 0x0000000E) Memory to memory mode                                      */
      uint32_t                  : 17;
    } bit;
  } CCR2;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000020) DMA channel 2 number of data register                      */

    struct {
      __IOM uint32_t NDT        : 16;           /*!< (@ 0x00000000) Number of data to transfer                                 */
    } bit;
  } CNDTR2;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000024) DMA channel 2 peripheral address register                  */

    struct {
      __IOM uint32_t PA         : 32;           /*!< (@ 0x00000000) Peripheral address                                         */
    } bit;
  } CPAR2;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000028) DMA channel 2 memory address register                      */

    struct {
      __IOM uint32_t MA         : 32;           /*!< (@ 0x00000000) Memory address                                             */
    } bit;
  } CMAR2;
  __IM  uint32_t  RESERVED1;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000030) DMA channel configuration register (DMA_CCR)               */

    struct {
      __IOM uint32_t EN         : 1;            /*!< (@ 0x00000000) Channel enable                                             */
      __IOM uint32_t TCIE       : 1;            /*!< (@ 0x00000001) Transfer complete interrupt enable                         */
      __IOM uint32_t HTIE       : 1;            /*!< (@ 0x00000002) Half Transfer interrupt enable                             */
      __IOM uint32_t TEIE       : 1;            /*!< (@ 0x00000003) Transfer error interrupt enable                            */
      __IOM uint32_t DIR        : 1;            /*!< (@ 0x00000004) Data transfer direction                                    */
      __IOM uint32_t CIRC       : 1;            /*!< (@ 0x00000005) Circular mode                                              */
      __IOM uint32_t PINC       : 1;            /*!< (@ 0x00000006) Peripheral increment mode                                  */
      __IOM uint32_t MINC       : 1;            /*!< (@ 0x00000007) Memory increment mode                                      */
      __IOM uint32_t PSIZE      : 2;            /*!< (@ 0x00000008) Peripheral size                                            */
      __IOM uint32_t MSIZE      : 2;            /*!< (@ 0x0000000A) Memory size                                                */
      __IOM uint32_t PL         : 2;            /*!< (@ 0x0000000C) Channel Priority level                                     */
      __IOM uint32_t MEM2MEM    : 1;            /*!< (@ 0x0000000E) Memory to memory mode                                      */
      uint32_t                  : 17;
    } bit;
  } CCR3;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000034) DMA channel 3 number of data register                      */

