pointer-x/stm32f103c8_RCC_CMSIS_bitfields/CMSIS/stm32f103c8_bitfield.h
    struct {
      __IOM uint32_t MA         : 32;           /*!< (@ 0x00000000) Memory address                                             */
    } bit;
  } CMAR5;
  __IM  uint32_t  RESERVED4;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000006C) DMA channel configuration register (DMA_CCR)               */

    struct {
      __IOM uint32_t EN         : 1;            /*!< (@ 0x00000000) Channel enable                                             */
      __IOM uint32_t TCIE       : 1;            /*!< (@ 0x00000001) Transfer complete interrupt enable                         */
      __IOM uint32_t HTIE       : 1;            /*!< (@ 0x00000002) Half Transfer interrupt enable                             */
      __IOM uint32_t TEIE       : 1;            /*!< (@ 0x00000003) Transfer error interrupt enable                            */
      __IOM uint32_t DIR        : 1;            /*!< (@ 0x00000004) Data transfer direction                                    */
      __IOM uint32_t CIRC       : 1;            /*!< (@ 0x00000005) Circular mode                                              */
      __IOM uint32_t PINC       : 1;            /*!< (@ 0x00000006) Peripheral increment mode                                  */
      __IOM uint32_t MINC       : 1;            /*!< (@ 0x00000007) Memory increment mode                                      */
      __IOM uint32_t PSIZE      : 2;            /*!< (@ 0x00000008) Peripheral size                                            */
      __IOM uint32_t MSIZE      : 2;            /*!< (@ 0x0000000A) Memory size                                                */
      __IOM uint32_t PL         : 2;            /*!< (@ 0x0000000C) Channel Priority level                                     */
      __IOM uint32_t MEM2MEM    : 1;            /*!< (@ 0x0000000E) Memory to memory mode                                      */
      uint32_t                  : 17;
    } bit;
  } CCR6;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000070) DMA channel 6 number of data register                      */

    struct {
      __IOM uint32_t NDT        : 16;           /*!< (@ 0x00000000) Number of data to transfer                                 */
    } bit;
  } CNDTR6;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000074) DMA channel 6 peripheral address register                  */

    struct {
      __IOM uint32_t PA         : 32;           /*!< (@ 0x00000000) Peripheral address                                         */
    } bit;
  } CPAR6;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000078) DMA channel 6 memory address register                      */

    struct {
      __IOM uint32_t MA         : 32;           /*!< (@ 0x00000000) Memory address                                             */
    } bit;
  } CMAR6;
  __IM  uint32_t  RESERVED5;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000080) DMA channel configuration register (DMA_CCR)               */

    struct {
      __IOM uint32_t EN         : 1;            /*!< (@ 0x00000000) Channel enable                                             */
      __IOM uint32_t TCIE       : 1;            /*!< (@ 0x00000001) Transfer complete interrupt enable                         */
      __IOM uint32_t HTIE       : 1;            /*!< (@ 0x00000002) Half Transfer interrupt enable                             */
      __IOM uint32_t TEIE       : 1;            /*!< (@ 0x00000003) Transfer error interrupt enable                            */
      __IOM uint32_t DIR        : 1;            /*!< (@ 0x00000004) Data transfer direction                                    */
      __IOM uint32_t CIRC       : 1;            /*!< (@ 0x00000005) Circular mode                                              */
      __IOM uint32_t PINC       : 1;            /*!< (@ 0x00000006) Peripheral increment mode                                  */
      __IOM uint32_t MINC       : 1;            /*!< (@ 0x00000007) Memory increment mode                                      */
      __IOM uint32_t PSIZE      : 2;            /*!< (@ 0x00000008) Peripheral size                                            */
      __IOM uint32_t MSIZE      : 2;            /*!< (@ 0x0000000A) Memory size                                                */
      __IOM uint32_t PL         : 2;            /*!< (@ 0x0000000C) Channel Priority level                                     */
      __IOM uint32_t MEM2MEM    : 1;            /*!< (@ 0x0000000E) Memory to memory mode                                      */
      uint32_t                  : 17;
    } bit;
  } CCR7;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000084) DMA channel 7 number of data register                      */

    struct {
      __IOM uint32_t NDT        : 16;           /*!< (@ 0x00000000) Number of data to transfer                                 */
    } bit;
  } CNDTR7;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000088) DMA channel 7 peripheral address register                  */

    struct {
      __IOM uint32_t PA         : 32;           /*!< (@ 0x00000000) Peripheral address                                         */
    } bit;
  } CPAR7;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000008C) DMA channel 7 memory address register                      */

    struct {
      __IOM uint32_t MA         : 32;           /*!< (@ 0x00000000) Memory address                                             */
    } bit;
  } CMAR7;
} DMA1_Type;                                    /*!< Size = 144 (0x90)                                                         */



/* =========================================================================================================================== */
/* ================                                           SDIO                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Secure digital input/output  interface (SDIO)
  */

typedef struct {                                /*!< (@ 0x40018000) SDIO Structure                                             */

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000000) Bits 1:0 = PWRCTRL: Power supply control bits              */

