pointer-x/stm32f103c8_RCC_CMSIS_bitfields/CMSIS/stm32f103c8_bitfield.h
    struct {
      __IOM uint32_t PWRCTRL    : 2;            /*!< (@ 0x00000000) PWRCTRL                                                    */
    } bit;
  } POWER;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000004) SDI clock control register (SDIO_CLKCR)                    */

    struct {
      __IOM uint32_t CLKDIV     : 8;            /*!< (@ 0x00000000) Clock divide factor                                        */
      __IOM uint32_t CLKEN      : 1;            /*!< (@ 0x00000008) Clock enable bit                                           */
      __IOM uint32_t PWRSAV     : 1;            /*!< (@ 0x00000009) Power saving configuration bit                             */
      __IOM uint32_t BYPASS     : 1;            /*!< (@ 0x0000000A) Clock divider bypass enable bit                            */
      __IOM uint32_t WIDBUS     : 2;            /*!< (@ 0x0000000B) Wide bus mode enable bit                                   */
      __IOM uint32_t NEGEDGE    : 1;            /*!< (@ 0x0000000D) SDIO_CK dephasing selection bit                            */
      __IOM uint32_t HWFC_EN    : 1;            /*!< (@ 0x0000000E) HW Flow Control enable                                     */
    } bit;
  } CLKCR;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000008) Bits 31:0 = : Command argument                             */

    struct {
      __IOM uint32_t CMDARG     : 32;           /*!< (@ 0x00000000) Command argument                                           */
    } bit;
  } ARG;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000000C) SDIO command register (SDIO_CMD)                           */

    struct {
      __IOM uint32_t CMDINDEX   : 6;            /*!< (@ 0x00000000) CMDINDEX                                                   */
      __IOM uint32_t WAITRESP   : 2;            /*!< (@ 0x00000006) WAITRESP                                                   */
      __IOM uint32_t WAITINT    : 1;            /*!< (@ 0x00000008) WAITINT                                                    */
      __IOM uint32_t WAITPEND   : 1;            /*!< (@ 0x00000009) WAITPEND                                                   */
      __IOM uint32_t CPSMEN     : 1;            /*!< (@ 0x0000000A) CPSMEN                                                     */
      __IOM uint32_t SDIOSuspend : 1;           /*!< (@ 0x0000000B) SDIOSuspend                                                */
      __IOM uint32_t ENCMDcompl : 1;            /*!< (@ 0x0000000C) ENCMDcompl                                                 */
      __IOM uint32_t nIEN       : 1;            /*!< (@ 0x0000000D) nIEN                                                       */
      __IOM uint32_t CE_ATACMD  : 1;            /*!< (@ 0x0000000E) CE_ATACMD                                                  */
    } bit;
  } CMD;

  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000010) SDIO command register                                      */

    struct {
      __IM  uint32_t RESPCMD    : 6;            /*!< (@ 0x00000000) RESPCMD                                                    */
    } bit;
  } RESPCMD;

  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000014) Bits 31:0 = CARDSTATUS1                                    */

    struct {
      __IM  uint32_t CARDSTATUS1 : 32;          /*!< (@ 0x00000000) CARDSTATUS1                                                */
    } bit;
  } RESPI1;

  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000018) Bits 31:0 = CARDSTATUS2                                    */

    struct {
      __IM  uint32_t CARDSTATUS2 : 32;          /*!< (@ 0x00000000) CARDSTATUS2                                                */
    } bit;
  } RESP2;

  union {
    __IM  uint32_t reg;                         /*!< (@ 0x0000001C) Bits 31:0 = CARDSTATUS3                                    */

    struct {
      __IM  uint32_t CARDSTATUS3 : 32;          /*!< (@ 0x00000000) CARDSTATUS3                                                */
    } bit;
  } RESP3;

  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000020) Bits 31:0 = CARDSTATUS4                                    */

    struct {
      __IM  uint32_t CARDSTATUS4 : 32;          /*!< (@ 0x00000000) CARDSTATUS4                                                */
    } bit;
  } RESP4;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000024) Bits 31:0 = DATATIME: Data timeout period                  */

    struct {
      __IOM uint32_t DATATIME   : 32;           /*!< (@ 0x00000000) Data timeout period                                        */
    } bit;
  } DTIMER;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000028) Bits 24:0 = DATALENGTH: Data length value                  */

    struct {
      __IOM uint32_t DATALENGTH : 25;           /*!< (@ 0x00000000) Data length value                                          */
    } bit;
  } DLEN;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000002C) SDIO data control register (SDIO_DCTRL)                    */

    struct {
      __IOM uint32_t DTEN       : 1;            /*!< (@ 0x00000000) DTEN                                                       */
      __IOM uint32_t DTDIR      : 1;            /*!< (@ 0x00000001) DTDIR                                                      */
      __IOM uint32_t DTMODE     : 1;            /*!< (@ 0x00000002) DTMODE                                                     */
      __IOM uint32_t DMAEN      : 1;            /*!< (@ 0x00000003) DMAEN                                                      */
      __IOM uint32_t DBLOCKSIZE : 4;            /*!< (@ 0x00000004) DBLOCKSIZE                                                 */
      __IOM uint32_t PWSTART    : 1;            /*!< (@ 0x00000008) PWSTART                                                    */
      __IOM uint32_t PWSTOP     : 1;            /*!< (@ 0x00000009) PWSTOP                                                     */
      __IOM uint32_t RWMOD      : 1;            /*!< (@ 0x0000000A) RWMOD                                                      */
      __IOM uint32_t SDIOEN     : 1;            /*!< (@ 0x0000000B) SDIOEN                                                     */
    } bit;
  } DCTRL;

  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000030) Bits 24:0 = DATACOUNT: Data count value                    */

