pointer-x/stm32f103c8_RCC_CMSIS_bitfields/CMSIS/stm32f103c8_bitfield.h
    struct {
      __IM  uint32_t DATACOUNT  : 25;           /*!< (@ 0x00000000) Data count value                                           */
    } bit;
  } DCOUNT;

  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000034) SDIO status register (SDIO_STA)                            */

    struct {
      __IM  uint32_t CCRCFAIL   : 1;            /*!< (@ 0x00000000) CCRCFAIL                                                   */
      __IM  uint32_t DCRCFAIL   : 1;            /*!< (@ 0x00000001) DCRCFAIL                                                   */
      __IM  uint32_t CTIMEOUT   : 1;            /*!< (@ 0x00000002) CTIMEOUT                                                   */
      __IM  uint32_t DTIMEOUT   : 1;            /*!< (@ 0x00000003) DTIMEOUT                                                   */
      __IM  uint32_t TXUNDERR   : 1;            /*!< (@ 0x00000004) TXUNDERR                                                   */
      __IM  uint32_t RXOVERR    : 1;            /*!< (@ 0x00000005) RXOVERR                                                    */
      __IM  uint32_t CMDREND    : 1;            /*!< (@ 0x00000006) CMDREND                                                    */
      __IM  uint32_t CMDSENT    : 1;            /*!< (@ 0x00000007) CMDSENT                                                    */
      __IM  uint32_t DATAEND    : 1;            /*!< (@ 0x00000008) DATAEND                                                    */
      __IM  uint32_t STBITERR   : 1;            /*!< (@ 0x00000009) STBITERR                                                   */
      __IM  uint32_t DBCKEND    : 1;            /*!< (@ 0x0000000A) DBCKEND                                                    */
      __IM  uint32_t CMDACT     : 1;            /*!< (@ 0x0000000B) CMDACT                                                     */
      __IM  uint32_t TXACT      : 1;            /*!< (@ 0x0000000C) TXACT                                                      */
      __IM  uint32_t RXACT      : 1;            /*!< (@ 0x0000000D) RXACT                                                      */
      __IM  uint32_t TXFIFOHE   : 1;            /*!< (@ 0x0000000E) TXFIFOHE                                                   */
      __IM  uint32_t RXFIFOHF   : 1;            /*!< (@ 0x0000000F) RXFIFOHF                                                   */
      __IM  uint32_t TXFIFOF    : 1;            /*!< (@ 0x00000010) TXFIFOF                                                    */
      __IM  uint32_t RXFIFOF    : 1;            /*!< (@ 0x00000011) RXFIFOF                                                    */
      __IM  uint32_t TXFIFOE    : 1;            /*!< (@ 0x00000012) TXFIFOE                                                    */
      __IM  uint32_t RXFIFOE    : 1;            /*!< (@ 0x00000013) RXFIFOE                                                    */
      __IM  uint32_t TXDAVL     : 1;            /*!< (@ 0x00000014) TXDAVL                                                     */
      __IM  uint32_t RXDAVL     : 1;            /*!< (@ 0x00000015) RXDAVL                                                     */
      __IM  uint32_t SDIOIT     : 1;            /*!< (@ 0x00000016) SDIOIT                                                     */
      __IM  uint32_t CEATAEND   : 1;            /*!< (@ 0x00000017) CEATAEND                                                   */
    } bit;
  } STA;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000038) SDIO interrupt clear register (SDIO_ICR)                   */

    struct {
      __IOM uint32_t CCRCFAILC  : 1;            /*!< (@ 0x00000000) CCRCFAILC                                                  */
      __IOM uint32_t DCRCFAILC  : 1;            /*!< (@ 0x00000001) DCRCFAILC                                                  */
      __IOM uint32_t CTIMEOUTC  : 1;            /*!< (@ 0x00000002) CTIMEOUTC                                                  */
      __IOM uint32_t DTIMEOUTC  : 1;            /*!< (@ 0x00000003) DTIMEOUTC                                                  */
      __IOM uint32_t TXUNDERRC  : 1;            /*!< (@ 0x00000004) TXUNDERRC                                                  */
      __IOM uint32_t RXOVERRC   : 1;            /*!< (@ 0x00000005) RXOVERRC                                                   */
      __IOM uint32_t CMDRENDC   : 1;            /*!< (@ 0x00000006) CMDRENDC                                                   */
      __IOM uint32_t CMDSENTC   : 1;            /*!< (@ 0x00000007) CMDSENTC                                                   */
      __IOM uint32_t DATAENDC   : 1;            /*!< (@ 0x00000008) DATAENDC                                                   */
      __IOM uint32_t STBITERRC  : 1;            /*!< (@ 0x00000009) STBITERRC                                                  */
      __IOM uint32_t DBCKENDC   : 1;            /*!< (@ 0x0000000A) DBCKENDC                                                   */
      __IM  uint32_t            : 11;
      __IOM uint32_t SDIOITC    : 1;            /*!< (@ 0x00000016) SDIOITC                                                    */
      __IOM uint32_t CEATAENDC  : 1;            /*!< (@ 0x00000017) CEATAENDC                                                  */
    } bit;
  } ICR;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000003C) SDIO mask register (SDIO_MASK)                             */

    struct {
      __IOM uint32_t CCRCFAILIE : 1;            /*!< (@ 0x00000000) CCRCFAILIE                                                 */
      __IOM uint32_t DCRCFAILIE : 1;            /*!< (@ 0x00000001) DCRCFAILIE                                                 */
      __IOM uint32_t CTIMEOUTIE : 1;            /*!< (@ 0x00000002) CTIMEOUTIE                                                 */
      __IOM uint32_t DTIMEOUTIE : 1;            /*!< (@ 0x00000003) DTIMEOUTIE                                                 */
      __IOM uint32_t TXUNDERRIE : 1;            /*!< (@ 0x00000004) TXUNDERRIE                                                 */
      __IOM uint32_t RXOVERRIE  : 1;            /*!< (@ 0x00000005) RXOVERRIE                                                  */
      __IOM uint32_t CMDRENDIE  : 1;            /*!< (@ 0x00000006) CMDRENDIE                                                  */
      __IOM uint32_t CMDSENTIE  : 1;            /*!< (@ 0x00000007) CMDSENTIE                                                  */
      __IOM uint32_t DATAENDIE  : 1;            /*!< (@ 0x00000008) DATAENDIE                                                  */
      __IOM uint32_t STBITERRIE : 1;            /*!< (@ 0x00000009) STBITERRIE                                                 */
      __IOM uint32_t DBACKENDIE : 1;            /*!< (@ 0x0000000A) DBACKENDIE                                                 */
      __IOM uint32_t CMDACTIE   : 1;            /*!< (@ 0x0000000B) CMDACTIE                                                   */
      __IOM uint32_t TXACTIE    : 1;            /*!< (@ 0x0000000C) TXACTIE                                                    */
      __IOM uint32_t RXACTIE    : 1;            /*!< (@ 0x0000000D) RXACTIE                                                    */
      __IOM uint32_t TXFIFOHEIE : 1;            /*!< (@ 0x0000000E) TXFIFOHEIE                                                 */
      __IOM uint32_t RXFIFOHFIE : 1;            /*!< (@ 0x0000000F) RXFIFOHFIE                                                 */
      __IOM uint32_t TXFIFOFIE  : 1;            /*!< (@ 0x00000010) TXFIFOFIE                                                  */
      __IOM uint32_t RXFIFOFIE  : 1;            /*!< (@ 0x00000011) RXFIFOFIE                                                  */
      __IOM uint32_t TXFIFOEIE  : 1;            /*!< (@ 0x00000012) TXFIFOEIE                                                  */
      __IOM uint32_t RXFIFOEIE  : 1;            /*!< (@ 0x00000013) RXFIFOEIE                                                  */
      __IOM uint32_t TXDAVLIE   : 1;            /*!< (@ 0x00000014) TXDAVLIE                                                   */
      __IOM uint32_t RXDAVLIE   : 1;            /*!< (@ 0x00000015) RXDAVLIE                                                   */
      __IOM uint32_t SDIOITIE   : 1;            /*!< (@ 0x00000016) SDIOITIE                                                   */
      __IOM uint32_t CEATENDIE  : 1;            /*!< (@ 0x00000017) CEATENDIE                                                  */
    } bit;
  } MASK;
  __IM  uint32_t  RESERVED[2];

  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000048) Bits 23:0 = FIFOCOUNT: Remaining number of words
                                                                    to be written to or read from the FIFO                     */

