pointer-x/stm32f103c8_RCC_CMSIS_bitfields/CMSIS/stm32f103c8_bitfield.h
    struct {
      __IM  uint32_t FIF0COUNT  : 24;           /*!< (@ 0x00000000) FIF0COUNT                                                  */
    } bit;
  } FIFOCNT;
  __IM  uint32_t  RESERVED1[13];

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000080) bits 31:0 = FIFOData: Receive and transmit FIFO
                                                                    data                                                       */

    struct {
      __IOM uint32_t FIFOData   : 32;           /*!< (@ 0x00000000) FIFOData                                                   */
    } bit;
  } FIFO;
} SDIO_Type;                                    /*!< Size = 132 (0x84)                                                         */



/* =========================================================================================================================== */
/* ================                                            RTC                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Real time clock (RTC)
  */

typedef struct {                                /*!< (@ 0x40002800) RTC Structure                                              */

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000000) RTC Control Register High                                  */

    struct {
      __IOM uint32_t SECIE      : 1;            /*!< (@ 0x00000000) Second interrupt Enable                                    */
      __IOM uint32_t ALRIE      : 1;            /*!< (@ 0x00000001) Alarm interrupt Enable                                     */
      __IOM uint32_t OWIE       : 1;            /*!< (@ 0x00000002) Overflow interrupt Enable                                  */
    } bit;
  } CRH;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000004) RTC Control Register Low                                   */

    struct {
      __IOM uint32_t SECF       : 1;            /*!< (@ 0x00000000) Second Flag                                                */
      __IOM uint32_t ALRF       : 1;            /*!< (@ 0x00000001) Alarm Flag                                                 */
      __IOM uint32_t OWF        : 1;            /*!< (@ 0x00000002) Overflow Flag                                              */
      __IOM uint32_t RSF        : 1;            /*!< (@ 0x00000003) Registers Synchronized Flag                                */
      __IOM uint32_t CNF        : 1;            /*!< (@ 0x00000004) Configuration Flag                                         */
      __IM  uint32_t RTOFF      : 1;            /*!< (@ 0x00000005) RTC operation OFF                                          */
    } bit;
  } CRL;

  union {
    __OM  uint32_t reg;                         /*!< (@ 0x00000008) RTC Prescaler Load Register High                           */

    struct {
      __OM  uint32_t PRLH       : 4;            /*!< (@ 0x00000000) RTC Prescaler Load Register High                           */
    } bit;
  } PRLH;

  union {
    __OM  uint32_t reg;                         /*!< (@ 0x0000000C) RTC Prescaler Load Register Low                            */

    struct {
      __OM  uint32_t PRLL       : 16;           /*!< (@ 0x00000000) RTC Prescaler Divider Register Low                         */
    } bit;
  } PRLL;

  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000010) RTC Prescaler Divider Register High                        */

    struct {
      __IM  uint32_t DIVH       : 4;            /*!< (@ 0x00000000) RTC prescaler divider register high                        */
    } bit;
  } DIVH;

  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000014) RTC Prescaler Divider Register Low                         */

    struct {
      __IM  uint32_t DIVL       : 16;           /*!< (@ 0x00000000) RTC prescaler divider register Low                         */
    } bit;
  } DIVL;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000018) RTC Counter Register High                                  */

    struct {
      __IOM uint32_t CNTH       : 16;           /*!< (@ 0x00000000) RTC counter register high                                  */
    } bit;
  } CNTH;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000001C) RTC Counter Register Low                                   */

    struct {
      __IOM uint32_t CNTL       : 16;           /*!< (@ 0x00000000) RTC counter register Low                                   */
    } bit;
  } CNTL;

  union {
    __OM  uint32_t reg;                         /*!< (@ 0x00000020) RTC Alarm Register High                                    */

    struct {
      __OM  uint32_t ALRH       : 16;           /*!< (@ 0x00000000) RTC alarm register high                                    */
    } bit;
  } ALRH;

  union {
    __OM  uint32_t reg;                         /*!< (@ 0x00000024) RTC Alarm Register Low                                     */

    struct {
      __OM  uint32_t ALRL       : 16;           /*!< (@ 0x00000000) RTC alarm register low                                     */
    } bit;
  } ALRL;
} RTC_Type;                                     /*!< Size = 40 (0x28)                                                          */



/* =========================================================================================================================== */
/* ================                                            BKP                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Backup registers (BKP)
  */

typedef struct {                                /*!< (@ 0x40006C04) BKP Structure                                              */

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000000) Backup data register (BKP_DR)                              */

