pointer-x/stm32f103c8_RCC_CMSIS_bitfields/CMSIS/stm32f103c8_bitfield.h
    struct {
      __IOM uint32_t D1         : 16;           /*!< (@ 0x00000000) Backup data                                                */
    } bit;
  } DR1;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000004) Backup data register (BKP_DR)                              */

    struct {
      __IOM uint32_t D2         : 16;           /*!< (@ 0x00000000) Backup data                                                */
    } bit;
  } DR2;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000008) Backup data register (BKP_DR)                              */

    struct {
      __IOM uint32_t D3         : 16;           /*!< (@ 0x00000000) Backup data                                                */
    } bit;
  } DR3;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000000C) Backup data register (BKP_DR)                              */

    struct {
      __IOM uint32_t D4         : 16;           /*!< (@ 0x00000000) Backup data                                                */
    } bit;
  } DR4;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000010) Backup data register (BKP_DR)                              */

    struct {
      __IOM uint32_t D5         : 16;           /*!< (@ 0x00000000) Backup data                                                */
    } bit;
  } DR5;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000014) Backup data register (BKP_DR)                              */

    struct {
      __IOM uint32_t D6         : 16;           /*!< (@ 0x00000000) Backup data                                                */
    } bit;
  } DR6;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000018) Backup data register (BKP_DR)                              */

    struct {
      __IOM uint32_t D7         : 16;           /*!< (@ 0x00000000) Backup data                                                */
    } bit;
  } DR7;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000001C) Backup data register (BKP_DR)                              */

    struct {
      __IOM uint32_t D8         : 16;           /*!< (@ 0x00000000) Backup data                                                */
    } bit;
  } DR8;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000020) Backup data register (BKP_DR)                              */

    struct {
      __IOM uint32_t D9         : 16;           /*!< (@ 0x00000000) Backup data                                                */
    } bit;
  } DR9;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000024) Backup data register (BKP_DR)                              */

    struct {
      __IOM uint32_t D10        : 16;           /*!< (@ 0x00000000) Backup data                                                */
    } bit;
  } DR10;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000028) RTC clock calibration register (BKP_RTCCR)                 */

    struct {
      __IOM uint32_t CAL        : 7;            /*!< (@ 0x00000000) Calibration value                                          */
      __IOM uint32_t CCO        : 1;            /*!< (@ 0x00000007) Calibration Clock Output                                   */
      __IOM uint32_t ASOE       : 1;            /*!< (@ 0x00000008) Alarm or second output enable                              */
      __IOM uint32_t ASOS       : 1;            /*!< (@ 0x00000009) Alarm or second output selection                           */
    } bit;
  } RTCCR;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000002C) Backup control register (BKP_CR)                           */

    struct {
      __IOM uint32_t TPE        : 1;            /*!< (@ 0x00000000) Tamper pin enable                                          */
      __IOM uint32_t TPAL       : 1;            /*!< (@ 0x00000001) Tamper pin active level                                    */
    } bit;
  } CR;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000030) BKP_CSR control/status register (BKP_CSR)                  */

    struct {
      __OM  uint32_t CTE        : 1;            /*!< (@ 0x00000000) Clear Tamper event                                         */
      __OM  uint32_t CTI        : 1;            /*!< (@ 0x00000001) Clear Tamper Interrupt                                     */
      __IOM uint32_t TPIE       : 1;            /*!< (@ 0x00000002) Tamper Pin interrupt enable                                */
      __IM  uint32_t            : 5;
      __IM  uint32_t TEF        : 1;            /*!< (@ 0x00000008) Tamper Event Flag                                          */
      __IM  uint32_t TIF        : 1;            /*!< (@ 0x00000009) Tamper Interrupt Flag                                      */
    } bit;
  } CSR;
  __IM  uint32_t  RESERVED[2];

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000003C) Backup data register (BKP_DR)                              */

    struct {
      __IOM uint32_t DR11       : 16;           /*!< (@ 0x00000000) Backup data                                                */
    } bit;
  } DR11;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000040) Backup data register (BKP_DR)                              */

    struct {
      __IOM uint32_t DR12       : 16;           /*!< (@ 0x00000000) Backup data                                                */
    } bit;
  } DR12;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000044) Backup data register (BKP_DR)                              */

    struct {
      __IOM uint32_t DR13       : 16;           /*!< (@ 0x00000000) Backup data                                                */
    } bit;
  } DR13;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000048) Backup data register (BKP_DR)                              */

    struct {
      __IOM uint32_t D14        : 16;           /*!< (@ 0x00000000) Backup data                                                */
    } bit;
  } DR14;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000004C) Backup data register (BKP_DR)                              */

