pointer-x/stm32f103c8_RCC_CMSIS_bitfields/CMSIS/stm32f103c8_bitfield.h
    struct {
      __IOM uint32_t D15        : 16;           /*!< (@ 0x00000000) Backup data                                                */
    } bit;
  } DR15;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000050) Backup data register (BKP_DR)                              */

    struct {
      __IOM uint32_t D16        : 16;           /*!< (@ 0x00000000) Backup data                                                */
    } bit;
  } DR16;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000054) Backup data register (BKP_DR)                              */

    struct {
      __IOM uint32_t D17        : 16;           /*!< (@ 0x00000000) Backup data                                                */
    } bit;
  } DR17;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000058) Backup data register (BKP_DR)                              */

    struct {
      __IOM uint32_t D18        : 16;           /*!< (@ 0x00000000) Backup data                                                */
    } bit;
  } DR18;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000005C) Backup data register (BKP_DR)                              */

    struct {
      __IOM uint32_t D19        : 16;           /*!< (@ 0x00000000) Backup data                                                */
    } bit;
  } DR19;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000060) Backup data register (BKP_DR)                              */

    struct {
      __IOM uint32_t D20        : 16;           /*!< (@ 0x00000000) Backup data                                                */
    } bit;
  } DR20;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000064) Backup data register (BKP_DR)                              */

    struct {
      __IOM uint32_t D21        : 16;           /*!< (@ 0x00000000) Backup data                                                */
    } bit;
  } DR21;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000068) Backup data register (BKP_DR)                              */

    struct {
      __IOM uint32_t D22        : 16;           /*!< (@ 0x00000000) Backup data                                                */
    } bit;
  } DR22;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000006C) Backup data register (BKP_DR)                              */

    struct {
      __IOM uint32_t D23        : 16;           /*!< (@ 0x00000000) Backup data                                                */
    } bit;
  } DR23;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000070) Backup data register (BKP_DR)                              */

    struct {
      __IOM uint32_t D24        : 16;           /*!< (@ 0x00000000) Backup data                                                */
    } bit;
  } DR24;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000074) Backup data register (BKP_DR)                              */

    struct {
      __IOM uint32_t D25        : 16;           /*!< (@ 0x00000000) Backup data                                                */
    } bit;
  } DR25;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000078) Backup data register (BKP_DR)                              */

    struct {
      __IOM uint32_t D26        : 16;           /*!< (@ 0x00000000) Backup data                                                */
    } bit;
  } DR26;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000007C) Backup data register (BKP_DR)                              */

    struct {
      __IOM uint32_t D27        : 16;           /*!< (@ 0x00000000) Backup data                                                */
    } bit;
  } DR27;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000080) Backup data register (BKP_DR)                              */

    struct {
      __IOM uint32_t D28        : 16;           /*!< (@ 0x00000000) Backup data                                                */
    } bit;
  } DR28;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000084) Backup data register (BKP_DR)                              */

    struct {
      __IOM uint32_t D29        : 16;           /*!< (@ 0x00000000) Backup data                                                */
    } bit;
  } DR29;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000088) Backup data register (BKP_DR)                              */

    struct {
      __IOM uint32_t D30        : 16;           /*!< (@ 0x00000000) Backup data                                                */
    } bit;
  } DR30;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000008C) Backup data register (BKP_DR)                              */

    struct {
      __IOM uint32_t D31        : 16;           /*!< (@ 0x00000000) Backup data                                                */
    } bit;
  } DR31;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000090) Backup data register (BKP_DR)                              */

    struct {
      __IOM uint32_t D32        : 16;           /*!< (@ 0x00000000) Backup data                                                */
    } bit;
  } DR32;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000094) Backup data register (BKP_DR)                              */

    struct {
      __IOM uint32_t D33        : 16;           /*!< (@ 0x00000000) Backup data                                                */
    } bit;
  } DR33;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000098) Backup data register (BKP_DR)                              */

    struct {
      __IOM uint32_t D34        : 16;           /*!< (@ 0x00000000) Backup data                                                */
    } bit;
  } DR34;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000009C) Backup data register (BKP_DR)                              */

