pointer-x/stm32f103c8_RCC_CMSIS_bitfields/CMSIS/stm32f103c8_bitfield.h
    struct {
      __IOM uint32_t D35        : 16;           /*!< (@ 0x00000000) Backup data                                                */
    } bit;
  } DR35;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000A0) Backup data register (BKP_DR)                              */

    struct {
      __IOM uint32_t D36        : 16;           /*!< (@ 0x00000000) Backup data                                                */
    } bit;
  } DR36;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000A4) Backup data register (BKP_DR)                              */

    struct {
      __IOM uint32_t D37        : 16;           /*!< (@ 0x00000000) Backup data                                                */
    } bit;
  } DR37;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000A8) Backup data register (BKP_DR)                              */

    struct {
      __IOM uint32_t D38        : 16;           /*!< (@ 0x00000000) Backup data                                                */
    } bit;
  } DR38;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000AC) Backup data register (BKP_DR)                              */

    struct {
      __IOM uint32_t D39        : 16;           /*!< (@ 0x00000000) Backup data                                                */
    } bit;
  } DR39;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000B0) Backup data register (BKP_DR)                              */

    struct {
      __IOM uint32_t D40        : 16;           /*!< (@ 0x00000000) Backup data                                                */
    } bit;
  } DR40;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000B4) Backup data register (BKP_DR)                              */

    struct {
      __IOM uint32_t D41        : 16;           /*!< (@ 0x00000000) Backup data                                                */
    } bit;
  } DR41;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000B8) Backup data register (BKP_DR)                              */

    struct {
      __IOM uint32_t D42        : 16;           /*!< (@ 0x00000000) Backup data                                                */
    } bit;
  } DR42;
} BKP_Type;                                     /*!< Size = 188 (0xbc)                                                         */



/* =========================================================================================================================== */
/* ================                                           IWDG                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Independent watchdog (IWDG)
  */

typedef struct {                                /*!< (@ 0x40003000) IWDG Structure                                             */

  union {
    __OM  uint32_t reg;                         /*!< (@ 0x00000000) Key register (IWDG_KR)                                     */

    struct {
      __OM  uint32_t KEY        : 16;           /*!< (@ 0x00000000) Key value                                                  */
    } bit;
  } KR;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000004) Prescaler register (IWDG_PR)                               */

    struct {
      __IOM uint32_t PR         : 3;            /*!< (@ 0x00000000) Prescaler divider                                          */
    } bit;
  } PR;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000008) Reload register (IWDG_RLR)                                 */

    struct {
      __IOM uint32_t RL         : 12;           /*!< (@ 0x00000000) Watchdog counter reload value                              */
    } bit;
  } RLR;

  union {
    __IM  uint32_t reg;                         /*!< (@ 0x0000000C) Status register (IWDG_SR)                                  */

    struct {
      __IM  uint32_t PVU        : 1;            /*!< (@ 0x00000000) Watchdog prescaler value update                            */
      __IM  uint32_t RVU        : 1;            /*!< (@ 0x00000001) Watchdog counter reload value update                       */
    } bit;
  } SR;
} IWDG_Type;                                    /*!< Size = 16 (0x10)                                                          */



/* =========================================================================================================================== */
/* ================                                           WWDG                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Window watchdog (WWDG)
  */

typedef struct {                                /*!< (@ 0x40002C00) WWDG Structure                                             */

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000000) Control register (WWDG_CR)                                 */

    struct {
      __IOM uint32_t T          : 7;            /*!< (@ 0x00000000) 7-bit counter (MSB to LSB)                                 */
      __IOM uint32_t WDGA       : 1;            /*!< (@ 0x00000007) Activation bit                                             */
    } bit;
  } CR;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000004) Configuration register (WWDG_CFR)                          */

    struct {
      __IOM uint32_t W          : 7;            /*!< (@ 0x00000000) 7-bit window value                                         */
      __IOM uint32_t WDGTB      : 2;            /*!< (@ 0x00000007) Timer Base                                                 */
      __IOM uint32_t EWI        : 1;            /*!< (@ 0x00000009) Early Wakeup Interrupt                                     */
    } bit;
  } CFR;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000008) Status register (WWDG_SR)                                  */

