pointer-x/stm32f103c8_RCC_CMSIS_bitfields/CMSIS/stm32f103c8_bitfield.h
    struct {
      __IOM uint32_t EWI        : 1;            /*!< (@ 0x00000000) Early Wakeup Interrupt                                     */
    } bit;
  } SR;
} WWDG_Type;                                    /*!< Size = 12 (0xc)                                                           */



/* =========================================================================================================================== */
/* ================                                           TIM1                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Advanced timer (TIM1)
  */

typedef struct {                                /*!< (@ 0x40012C00) TIM1 Structure                                             */

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000000) control register 1                                         */

    struct {
      __IOM uint32_t CEN        : 1;            /*!< (@ 0x00000000) Counter enable                                             */
      __IOM uint32_t UDIS       : 1;            /*!< (@ 0x00000001) Update disable                                             */
      __IOM uint32_t URS        : 1;            /*!< (@ 0x00000002) Update request source                                      */
      __IOM uint32_t OPM        : 1;            /*!< (@ 0x00000003) One-pulse mode                                             */
      __IOM uint32_t DIR        : 1;            /*!< (@ 0x00000004) Direction                                                  */
      __IOM uint32_t CMS        : 2;            /*!< (@ 0x00000005) Center-aligned mode selection                              */
      __IOM uint32_t ARPE       : 1;            /*!< (@ 0x00000007) Auto-reload preload enable                                 */
      __IOM uint32_t CKD        : 2;            /*!< (@ 0x00000008) Clock division                                             */
    } bit;
  } CR1;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000004) control register 2                                         */

    struct {
      __IOM uint32_t CCPC       : 1;            /*!< (@ 0x00000000) Capture/compare preloaded control                          */
      __IM  uint32_t            : 1;
      __IOM uint32_t CCUS       : 1;            /*!< (@ 0x00000002) Capture/compare control update selection                   */
      __IOM uint32_t CCDS       : 1;            /*!< (@ 0x00000003) Capture/compare DMA selection                              */
      __IOM uint32_t MMS        : 3;            /*!< (@ 0x00000004) Master mode selection                                      */
      __IOM uint32_t TI1S       : 1;            /*!< (@ 0x00000007) TI1 selection                                              */
      __IOM uint32_t OIS1       : 1;            /*!< (@ 0x00000008) Output Idle state 1                                        */
      __IOM uint32_t OIS1N      : 1;            /*!< (@ 0x00000009) Output Idle state 1                                        */
      __IOM uint32_t OIS2       : 1;            /*!< (@ 0x0000000A) Output Idle state 2                                        */
      __IOM uint32_t OIS2N      : 1;            /*!< (@ 0x0000000B) Output Idle state 2                                        */
      __IOM uint32_t OIS3       : 1;            /*!< (@ 0x0000000C) Output Idle state 3                                        */
      __IOM uint32_t OIS3N      : 1;            /*!< (@ 0x0000000D) Output Idle state 3                                        */
      __IOM uint32_t OIS4       : 1;            /*!< (@ 0x0000000E) Output Idle state 4                                        */
    } bit;
  } CR2;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000008) slave mode control register                                */

    struct {
      __IOM uint32_t SMS        : 3;            /*!< (@ 0x00000000) Slave mode selection                                       */
      __IM  uint32_t            : 1;
      __IOM uint32_t TS         : 3;            /*!< (@ 0x00000004) Trigger selection                                          */
      __IOM uint32_t MSM        : 1;            /*!< (@ 0x00000007) Master/Slave mode                                          */
      __IOM uint32_t ETF        : 4;            /*!< (@ 0x00000008) External trigger filter                                    */
      __IOM uint32_t ETPS       : 2;            /*!< (@ 0x0000000C) External trigger prescaler                                 */
      __IOM uint32_t ECE        : 1;            /*!< (@ 0x0000000E) External clock enable                                      */
      __IOM uint32_t ETP        : 1;            /*!< (@ 0x0000000F) External trigger polarity                                  */
    } bit;
  } SMCR;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000000C) DMA/Interrupt enable register                              */

    struct {
      __IOM uint32_t UIE        : 1;            /*!< (@ 0x00000000) Update interrupt enable                                    */
      __IOM uint32_t CC1IE      : 1;            /*!< (@ 0x00000001) Capture/Compare 1 interrupt enable                         */
      __IOM uint32_t CC2IE      : 1;            /*!< (@ 0x00000002) Capture/Compare 2 interrupt enable                         */
      __IOM uint32_t CC3IE      : 1;            /*!< (@ 0x00000003) Capture/Compare 3 interrupt enable                         */
      __IOM uint32_t CC4IE      : 1;            /*!< (@ 0x00000004) Capture/Compare 4 interrupt enable                         */
      __IOM uint32_t COMIE      : 1;            /*!< (@ 0x00000005) COM interrupt enable                                       */
      __IOM uint32_t TIE        : 1;            /*!< (@ 0x00000006) Trigger interrupt enable                                   */
      __IOM uint32_t BIE        : 1;            /*!< (@ 0x00000007) Break interrupt enable                                     */
      __IOM uint32_t UDE        : 1;            /*!< (@ 0x00000008) Update DMA request enable                                  */
      __IOM uint32_t CC1DE      : 1;            /*!< (@ 0x00000009) Capture/Compare 1 DMA request enable                       */
      __IOM uint32_t CC2DE      : 1;            /*!< (@ 0x0000000A) Capture/Compare 2 DMA request enable                       */
      __IOM uint32_t CC3DE      : 1;            /*!< (@ 0x0000000B) Capture/Compare 3 DMA request enable                       */
      __IOM uint32_t CC4DE      : 1;            /*!< (@ 0x0000000C) Capture/Compare 4 DMA request enable                       */
      __IOM uint32_t COMDE      : 1;            /*!< (@ 0x0000000D) COM DMA request enable                                     */
      __IOM uint32_t TDE        : 1;            /*!< (@ 0x0000000E) Trigger DMA request enable                                 */
    } bit;
  } DIER;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000010) status register                                            */

