pointer-x/stm32f103c8_RCC_CMSIS_bitfields/CMSIS/stm32f103c8_bitfield.h
    struct {
      __IOM uint32_t UIF        : 1;            /*!< (@ 0x00000000) Update interrupt flag                                      */
      __IOM uint32_t CC1IF      : 1;            /*!< (@ 0x00000001) Capture/compare 1 interrupt flag                           */
      __IOM uint32_t CC2IF      : 1;            /*!< (@ 0x00000002) Capture/Compare 2 interrupt flag                           */
      __IOM uint32_t CC3IF      : 1;            /*!< (@ 0x00000003) Capture/Compare 3 interrupt flag                           */
      __IOM uint32_t CC4IF      : 1;            /*!< (@ 0x00000004) Capture/Compare 4 interrupt flag                           */
      __IOM uint32_t COMIF      : 1;            /*!< (@ 0x00000005) COM interrupt flag                                         */
      __IOM uint32_t TIF        : 1;            /*!< (@ 0x00000006) Trigger interrupt flag                                     */
      __IOM uint32_t BIF        : 1;            /*!< (@ 0x00000007) Break interrupt flag                                       */
      __IM  uint32_t            : 1;
      __IOM uint32_t CC1OF      : 1;            /*!< (@ 0x00000009) Capture/Compare 1 overcapture flag                         */
      __IOM uint32_t CC2OF      : 1;            /*!< (@ 0x0000000A) Capture/compare 2 overcapture flag                         */
      __IOM uint32_t CC3OF      : 1;            /*!< (@ 0x0000000B) Capture/Compare 3 overcapture flag                         */
      __IOM uint32_t CC4OF      : 1;            /*!< (@ 0x0000000C) Capture/Compare 4 overcapture flag                         */
      uint32_t       : 10;
    } bit;
  } SR;

  union {
    __OM  uint32_t reg;                         /*!< (@ 0x00000014) event generation register                                  */

    struct {
      __OM  uint32_t UG         : 1;            /*!< (@ 0x00000000) Update generation                                          */
      __OM  uint32_t CC1G       : 1;            /*!< (@ 0x00000001) Capture/compare 1 generation                               */
      __OM  uint32_t CC2G       : 1;            /*!< (@ 0x00000002) Capture/compare 2 generation                               */
      __OM  uint32_t CC3G       : 1;            /*!< (@ 0x00000003) Capture/compare 3 generation                               */
      __OM  uint32_t CC4G       : 1;            /*!< (@ 0x00000004) Capture/compare 4 generation                               */
      __OM  uint32_t COMG       : 1;            /*!< (@ 0x00000005) Capture/Compare control update generation                  */
      __OM  uint32_t TG         : 1;            /*!< (@ 0x00000006) Trigger generation                                         */
      __OM  uint32_t BG         : 1;            /*!< (@ 0x00000007) Break generation                                           */
    } bit;
  } EGR;

  union {
    union {
      __IOM uint32_t reg;                       /*!< (@ 0x00000018) capture/compare mode register (output mode)                */

      struct {
        __IOM uint32_t CC1S     : 2;            /*!< (@ 0x00000000) Capture/Compare 1 selection                                */
        __IOM uint32_t OC1FE    : 1;            /*!< (@ 0x00000002) Output Compare 1 fast enable                               */
        __IOM uint32_t OC1PE    : 1;            /*!< (@ 0x00000003) Output Compare 1 preload enable                            */
        __IOM uint32_t OC1M     : 3;            /*!< (@ 0x00000004) Output Compare 1 mode                                      */
        __IOM uint32_t OC1CE    : 1;            /*!< (@ 0x00000007) Output Compare 1 clear enable                              */
        __IOM uint32_t CC2S     : 2;            /*!< (@ 0x00000008) Capture/Compare 2 selection                                */
        __IOM uint32_t OC2FE    : 1;            /*!< (@ 0x0000000A) Output Compare 2 fast enable                               */
        __IOM uint32_t OC2PE    : 1;            /*!< (@ 0x0000000B) Output Compare 2 preload enable                            */
        __IOM uint32_t OC2M     : 3;            /*!< (@ 0x0000000C) Output Compare 2 mode                                      */
        __IOM uint32_t OC2CE    : 1;            /*!< (@ 0x0000000F) Output Compare 2 clear enable                              */
      } bit;
    } CCMR1_Output;

    union {
      __IOM uint32_t reg;                       /*!< (@ 0x00000018) capture/compare mode register 1 (input mode)               */

      struct {
        __IOM uint32_t CC1S     : 2;            /*!< (@ 0x00000000) Capture/Compare 1 selection                                */
        __IOM uint32_t ICPCS    : 2;            /*!< (@ 0x00000002) Input capture 1 prescaler                                  */
        __IOM uint32_t IC1F     : 4;            /*!< (@ 0x00000004) Input capture 1 filter                                     */
        __IOM uint32_t CC2S     : 2;            /*!< (@ 0x00000008) Capture/Compare 2 selection                                */
        __IOM uint32_t IC2PCS   : 2;            /*!< (@ 0x0000000A) Input capture 2 prescaler                                  */
        __IOM uint32_t IC2F     : 4;            /*!< (@ 0x0000000C) Input capture 2 filter                                     */
      } bit;
    } CCMR1_Input;
  };

  union {
    union {
      __IOM uint32_t reg;                       /*!< (@ 0x0000001C) capture/compare mode register (output mode)                */

      struct {
        __IOM uint32_t CC3S     : 2;            /*!< (@ 0x00000000) Capture/Compare 3 selection                                */
        __IOM uint32_t OC3FE    : 1;            /*!< (@ 0x00000002) Output compare 3 fast enable                               */
        __IOM uint32_t OC3PE    : 1;            /*!< (@ 0x00000003) Output compare 3 preload enable                            */
        __IOM uint32_t OC3M     : 3;            /*!< (@ 0x00000004) Output compare 3 mode                                      */
        __IOM uint32_t OC3CE    : 1;            /*!< (@ 0x00000007) Output compare 3 clear enable                              */
        __IOM uint32_t CC4S     : 2;            /*!< (@ 0x00000008) Capture/Compare 4 selection                                */
        __IOM uint32_t OC4FE    : 1;            /*!< (@ 0x0000000A) Output compare 4 fast enable                               */
        __IOM uint32_t OC4PE    : 1;            /*!< (@ 0x0000000B) Output compare 4 preload enable                            */
        __IOM uint32_t OC4M     : 3;            /*!< (@ 0x0000000C) Output compare 4 mode                                      */
        __IOM uint32_t OC4CE    : 1;            /*!< (@ 0x0000000F) Output compare 4 clear enable                              */
      } bit;
    } CCMR2_Output;

    union {
      __IOM uint32_t reg;                       /*!< (@ 0x0000001C) capture/compare mode register 2 (input mode)               */

