pointer-x/stm32f103c8_RCC_CMSIS_bitfields/CMSIS/stm32f103c8_bitfield.h
      struct {
        __IOM uint32_t CC3S     : 2;            /*!< (@ 0x00000000) Capture/compare 3 selection                                */
        __IOM uint32_t IC3PSC   : 2;            /*!< (@ 0x00000002) Input capture 3 prescaler                                  */
        __IOM uint32_t IC3F     : 4;            /*!< (@ 0x00000004) Input capture 3 filter                                     */
        __IOM uint32_t CC4S     : 2;            /*!< (@ 0x00000008) Capture/Compare 4 selection                                */
        __IOM uint32_t IC4PSC   : 2;            /*!< (@ 0x0000000A) Input capture 4 prescaler                                  */
        __IOM uint32_t IC4F     : 4;            /*!< (@ 0x0000000C) Input capture 4 filter                                     */
      } bit;
    } CCMR2_Input;
  };

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000020) capture/compare enable register                            */

    struct {
      __IOM uint32_t CC1E       : 1;            /*!< (@ 0x00000000) Capture/Compare 1 output enable                            */
      __IOM uint32_t CC1P       : 1;            /*!< (@ 0x00000001) Capture/Compare 1 output Polarity                          */
      __IOM uint32_t CC1NE      : 1;            /*!< (@ 0x00000002) Capture/Compare 1 complementary output enable              */
      __IOM uint32_t CC1NP      : 1;            /*!< (@ 0x00000003) Capture/Compare 1 output Polarity                          */
      __IOM uint32_t CC2E       : 1;            /*!< (@ 0x00000004) Capture/Compare 2 output enable                            */
      __IOM uint32_t CC2P       : 1;            /*!< (@ 0x00000005) Capture/Compare 2 output Polarity                          */
      __IOM uint32_t CC2NE      : 1;            /*!< (@ 0x00000006) Capture/Compare 2 complementary output enable              */
      __IOM uint32_t CC2NP      : 1;            /*!< (@ 0x00000007) Capture/Compare 2 output Polarity                          */
      __IOM uint32_t CC3E       : 1;            /*!< (@ 0x00000008) Capture/Compare 3 output enable                            */
      __IOM uint32_t CC3P       : 1;            /*!< (@ 0x00000009) Capture/Compare 3 output Polarity                          */
      __IOM uint32_t CC3NE      : 1;            /*!< (@ 0x0000000A) Capture/Compare 3 complementary output enable              */
      __IOM uint32_t CC3NP      : 1;            /*!< (@ 0x0000000B) Capture/Compare 3 output Polarity                          */
      __IOM uint32_t CC4E       : 1;            /*!< (@ 0x0000000C) Capture/Compare 4 output enable                            */
      __IOM uint32_t CC4P       : 1;            /*!< (@ 0x0000000D) Capture/Compare 3 output Polarity                          */
    } bit;
  } CCER;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000024) counter                                                    */

    struct {
      __IOM uint32_t CNT        : 16;           /*!< (@ 0x00000000) counter value                                              */
    } bit;
  } CNT;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000028) prescaler                                                  */

    struct {
      __IOM uint32_t PSC        : 16;           /*!< (@ 0x00000000) Prescaler value                                            */
    } bit;
  } PSC;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000002C) auto-reload register                                       */

    struct {
      __IOM uint32_t ARR        : 16;           /*!< (@ 0x00000000) Auto-reload value                                          */
    } bit;
  } ARR;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000030) repetition counter register                                */

    struct {
      __IOM uint32_t REP        : 8;            /*!< (@ 0x00000000) Repetition counter value                                   */
    } bit;
  } RCR;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000034) capture/compare register 1                                 */

    struct {
      __IOM uint32_t CCR1       : 16;           /*!< (@ 0x00000000) Capture/Compare 1 value                                    */
    } bit;
  } CCR1;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000038) capture/compare register 2                                 */

    struct {
      __IOM uint32_t CCR2       : 16;           /*!< (@ 0x00000000) Capture/Compare 2 value                                    */
    } bit;
  } CCR2;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000003C) capture/compare register 3                                 */

    struct {
      __IOM uint32_t CCR3       : 16;           /*!< (@ 0x00000000) Capture/Compare value                                      */
    } bit;
  } CCR3;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000040) capture/compare register 4                                 */

    struct {
      __IOM uint32_t CCR4       : 16;           /*!< (@ 0x00000000) Capture/Compare value                                      */
    } bit;
  } CCR4;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000044) break and dead-time register                               */

    struct {
      __IOM uint32_t DTG        : 8;            /*!< (@ 0x00000000) Dead-time generator setup                                  */
      __IOM uint32_t LOCK       : 2;            /*!< (@ 0x00000008) Lock configuration                                         */
      __IOM uint32_t OSSI       : 1;            /*!< (@ 0x0000000A) Off-state selection for Idle mode                          */
      __IOM uint32_t OSSR       : 1;            /*!< (@ 0x0000000B) Off-state selection for Run mode                           */
      __IOM uint32_t BKE        : 1;            /*!< (@ 0x0000000C) Break enable                                               */
      __IOM uint32_t BKP        : 1;            /*!< (@ 0x0000000D) Break polarity                                             */
      __IOM uint32_t AOE        : 1;            /*!< (@ 0x0000000E) Automatic output enable                                    */
      __IOM uint32_t MOE        : 1;            /*!< (@ 0x0000000F) Main output enable                                         */
    } bit;
  } BDTR;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000048) DMA control register                                       */

