pointer-x/stm32f103c8_RCC_CMSIS_bitfields/CMSIS/stm32f103c8_bitfield.h
      struct {
        __IOM uint32_t CC3S     : 2;            /*!< (@ 0x00000000) Capture/Compare 3 selection                                */
        __IOM uint32_t IC3PSC   : 2;            /*!< (@ 0x00000002) Input capture 3 prescaler                                  */
        __IOM uint32_t IC3F     : 4;            /*!< (@ 0x00000004) Input capture 3 filter                                     */
        __IOM uint32_t CC4S     : 2;            /*!< (@ 0x00000008) Capture/Compare 4 selection                                */
        __IOM uint32_t IC4PSC   : 2;            /*!< (@ 0x0000000A) Input capture 4 prescaler                                  */
        __IOM uint32_t IC4F     : 4;            /*!< (@ 0x0000000C) Input capture 4 filter                                     */
      } bit;
    } CCMR2_Input;
  };

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000020) capture/compare enable register                            */

    struct {
      __IOM uint32_t CC1E       : 1;            /*!< (@ 0x00000000) Capture/Compare 1 output enable                            */
      __IOM uint32_t CC1P       : 1;            /*!< (@ 0x00000001) Capture/Compare 1 output Polarity                          */
      __IM  uint32_t            : 2;
      __IOM uint32_t CC2E       : 1;            /*!< (@ 0x00000004) Capture/Compare 2 output enable                            */
      __IOM uint32_t CC2P       : 1;            /*!< (@ 0x00000005) Capture/Compare 2 output Polarity                          */
      __IM  uint32_t            : 2;
      __IOM uint32_t CC3E       : 1;            /*!< (@ 0x00000008) Capture/Compare 3 output enable                            */
      __IOM uint32_t CC3P       : 1;            /*!< (@ 0x00000009) Capture/Compare 3 output Polarity                          */
      __IM  uint32_t            : 2;
      __IOM uint32_t CC4E       : 1;            /*!< (@ 0x0000000C) Capture/Compare 4 output enable                            */
      __IOM uint32_t CC4P       : 1;            /*!< (@ 0x0000000D) Capture/Compare 3 output Polarity                          */
    } bit;
  } CCER;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000024) counter                                                    */

    struct {
      __IOM uint32_t CNT        : 16;           /*!< (@ 0x00000000) counter value                                              */
    } bit;
  } CNT;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000028) prescaler                                                  */

    struct {
      __IOM uint32_t PSC        : 16;           /*!< (@ 0x00000000) Prescaler value                                            */
    } bit;
  } PSC;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000002C) auto-reload register                                       */

    struct {
      __IOM uint32_t ARR        : 16;           /*!< (@ 0x00000000) Auto-reload value                                          */
    } bit;
  } ARR;
  __IM  uint32_t  RESERVED;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000034) capture/compare register 1                                 */

    struct {
      __IOM uint32_t CCR1       : 16;           /*!< (@ 0x00000000) Capture/Compare 1 value                                    */
    } bit;
  } CCR1;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000038) capture/compare register 2                                 */

    struct {
      __IOM uint32_t CCR2       : 16;           /*!< (@ 0x00000000) Capture/Compare 2 value                                    */
    } bit;
  } CCR2;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000003C) capture/compare register 3                                 */

    struct {
      __IOM uint32_t CCR3       : 16;           /*!< (@ 0x00000000) Capture/Compare value                                      */
    } bit;
  } CCR3;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000040) capture/compare register 4                                 */

    struct {
      __IOM uint32_t CCR4       : 16;           /*!< (@ 0x00000000) Capture/Compare value                                      */
    } bit;
  } CCR4;

  __IM  uint32_t  RESERVED1;

   union {
     __IOM uint32_t reg;                         /*!< (@ 0x00000048) DMA control register                                       */

     struct {
       __IOM uint32_t DBA        : 5;            /*!< (@ 0x00000000) DMA base address                                           */
       __IM  uint32_t            : 3;
       __IOM uint32_t DBL        : 5;            /*!< (@ 0x00000008) DMA burst length                                           */
     } bit;
   } DCR;

   union {
     __IOM uint32_t reg;                         /*!< (@ 0x0000004C) DMA address for full transfer                              */

     struct {
       __IOM uint32_t DMAB       : 16;           /*!< (@ 0x00000000) DMA register for burst accesses                            */
     } bit;
   } DMAR;

} TIM2_Type;                                    /*!< Size = 80 (0x50)                                                          */



/* =========================================================================================================================== */
/* ================                                           TIM9                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief General purpose timer (TIM9)
  */

typedef struct {                                /*!< (@ 0x40014C00) TIM9 Structure                                             */

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000000) control register 1                                         */

    struct {
      __IOM uint32_t CEN        : 1;            /*!< (@ 0x00000000) Counter enable                                             */
      __IOM uint32_t UDIS       : 1;            /*!< (@ 0x00000001) Update disable                                             */
      __IOM uint32_t URS        : 1;            /*!< (@ 0x00000002) Update request source                                      */
      __IOM uint32_t OPM        : 1;            /*!< (@ 0x00000003) One-pulse mode                                             */
      __IM  uint32_t            : 3;
      __IOM uint32_t ARPE       : 1;            /*!< (@ 0x00000007) Auto-reload preload enable                                 */
      __IOM uint32_t CKD        : 2;            /*!< (@ 0x00000008) Clock division                                             */
    } bit;
  } CR1;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000004) control register 2                                         */

