pointer-x/stm32f103c8_RCC_CMSIS_bitfields/CMSIS/stm32f103c8_bitfield.h
    struct {
      __IM  uint32_t            : 4;
      __IOM uint32_t MMS        : 3;            /*!< (@ 0x00000004) Master mode selection                                      */
    } bit;
  } CR2;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000008) slave mode control register                                */

    struct {
      __IOM uint32_t SMS        : 3;            /*!< (@ 0x00000000) Slave mode selection                                       */
      __IM  uint32_t            : 1;
      __IOM uint32_t TS         : 3;            /*!< (@ 0x00000004) Trigger selection                                          */
      __IOM uint32_t MSM        : 1;            /*!< (@ 0x00000007) Master/Slave mode                                          */
    } bit;
  } SMCR;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000000C) DMA/Interrupt enable register                              */

    struct {
      __IOM uint32_t UIE        : 1;            /*!< (@ 0x00000000) Update interrupt enable                                    */
      __IOM uint32_t CC1IE      : 1;            /*!< (@ 0x00000001) Capture/Compare 1 interrupt enable                         */
      __IOM uint32_t CC2IE      : 1;            /*!< (@ 0x00000002) Capture/Compare 2 interrupt enable                         */
      __IM  uint32_t            : 3;
      __IOM uint32_t TIE        : 1;            /*!< (@ 0x00000006) Trigger interrupt enable                                   */
    } bit;
  } DIER;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000010) status register                                            */

    struct {
      __IOM uint32_t UIF        : 1;            /*!< (@ 0x00000000) Update interrupt flag                                      */
      __IOM uint32_t CC1IF      : 1;            /*!< (@ 0x00000001) Capture/compare 1 interrupt flag                           */
      __IOM uint32_t CC2IF      : 1;            /*!< (@ 0x00000002) Capture/Compare 2 interrupt flag                           */
      __IM  uint32_t            : 3;
      __IOM uint32_t TIF        : 1;            /*!< (@ 0x00000006) Trigger interrupt flag                                     */
      __IM  uint32_t            : 2;
      __IOM uint32_t CC1OF      : 1;            /*!< (@ 0x00000009) Capture/Compare 1 overcapture flag                         */
      __IOM uint32_t CC2OF      : 1;            /*!< (@ 0x0000000A) Capture/compare 2 overcapture flag                         */
    } bit;
  } SR;

  union {
    __OM  uint32_t reg;                         /*!< (@ 0x00000014) event generation register                                  */

    struct {
      __OM  uint32_t UG         : 1;            /*!< (@ 0x00000000) Update generation                                          */
      __OM  uint32_t CC1G       : 1;            /*!< (@ 0x00000001) Capture/compare 1 generation                               */
      __OM  uint32_t CC2G       : 1;            /*!< (@ 0x00000002) Capture/compare 2 generation                               */
      __IM  uint32_t            : 3;
      __OM  uint32_t TG         : 1;            /*!< (@ 0x00000006) Trigger generation                                         */
    } bit;
  } EGR;

  union {
    union {
      __IOM uint32_t reg;                       /*!< (@ 0x00000018) capture/compare mode register 1 (output mode)              */

      struct {
        __IOM uint32_t CC1S     : 2;            /*!< (@ 0x00000000) Capture/Compare 1 selection                                */
        __IOM uint32_t OC1FE    : 1;            /*!< (@ 0x00000002) Output Compare 1 fast enable                               */
        __IOM uint32_t OC1PE    : 1;            /*!< (@ 0x00000003) Output Compare 1 preload enable                            */
        __IOM uint32_t OC1M     : 3;            /*!< (@ 0x00000004) Output Compare 1 mode                                      */
        __IM  uint32_t          : 1;
        __IOM uint32_t CC2S     : 2;            /*!< (@ 0x00000008) Capture/Compare 2 selection                                */
        __IOM uint32_t OC2FE    : 1;            /*!< (@ 0x0000000A) Output Compare 2 fast enable                               */
        __IOM uint32_t OC2PE    : 1;            /*!< (@ 0x0000000B) Output Compare 2 preload enable                            */
        __IOM uint32_t OC2M     : 3;            /*!< (@ 0x0000000C) Output Compare 2 mode                                      */
      } bit;
    } CCMR1_Output;

    union {
      __IOM uint32_t reg;                       /*!< (@ 0x00000018) capture/compare mode register 1 (input mode)               */

      struct {
        __IOM uint32_t CC1S     : 2;            /*!< (@ 0x00000000) Capture/Compare 1 selection                                */
        __IOM uint32_t IC1PSC   : 2;            /*!< (@ 0x00000002) Input capture 1 prescaler                                  */
        __IOM uint32_t IC1F     : 4;            /*!< (@ 0x00000004) Input capture 1 filter                                     */
        __IOM uint32_t CC2S     : 2;            /*!< (@ 0x00000008) Capture/Compare 2 selection                                */
        __IOM uint32_t IC2PSC   : 2;            /*!< (@ 0x0000000A) Input capture 2 prescaler                                  */
        __IOM uint32_t IC2F     : 4;            /*!< (@ 0x0000000C) Input capture 2 filter                                     */
      } bit;
    } CCMR1_Input;
  };
  __IM  uint32_t  RESERVED;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000020) capture/compare enable register                            */

    struct {
      __IOM uint32_t CC1E       : 1;            /*!< (@ 0x00000000) Capture/Compare 1 output enable                            */
      __IOM uint32_t CC1P       : 1;            /*!< (@ 0x00000001) Capture/Compare 1 output Polarity                          */
      __IM  uint32_t            : 1;
      __IOM uint32_t CC1NP      : 1;            /*!< (@ 0x00000003) Capture/Compare 1 output Polarity                          */
      __IOM uint32_t CC2E       : 1;            /*!< (@ 0x00000004) Capture/Compare 2 output enable                            */
      __IOM uint32_t CC2P       : 1;            /*!< (@ 0x00000005) Capture/Compare 2 output Polarity                          */
      __IM  uint32_t            : 1;
      __IOM uint32_t CC2NP      : 1;            /*!< (@ 0x00000007) Capture/Compare 2 output Polarity                          */
    } bit;
  } CCER;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000024) counter                                                    */

