pointer-x/stm32f103c8_RCC_CMSIS_bitfields/CMSIS/stm32f103c8_bitfield.h
    struct {
      __IOM uint32_t CNT        : 16;           /*!< (@ 0x00000000) counter value                                              */
    } bit;
  } CNT;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000028) prescaler                                                  */

    struct {
      __IOM uint32_t PSC        : 16;           /*!< (@ 0x00000000) Prescaler value                                            */
    } bit;
  } PSC;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000002C) auto-reload register                                       */

    struct {
      __IOM uint32_t ARR        : 16;           /*!< (@ 0x00000000) Auto-reload value                                          */
    } bit;
  } ARR;
  __IM  uint32_t  RESERVED1;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000034) capture/compare register 1                                 */

    struct {
      __IOM uint32_t CCR1       : 16;           /*!< (@ 0x00000000) Capture/Compare 1 value                                    */
    } bit;
  } CCR1;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000038) capture/compare register 2                                 */

    struct {
      __IOM uint32_t CCR2       : 16;           /*!< (@ 0x00000000) Capture/Compare 2 value                                    */
    } bit;
  } CCR2;
} TIM9_Type;                                    /*!< Size = 60 (0x3c)                                                          */



/* =========================================================================================================================== */
/* ================                                           TIM10                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief General purpose timer (TIM10)
  */

typedef struct {                                /*!< (@ 0x40015000) TIM10 Structure                                            */

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000000) control register 1                                         */

    struct {
      __IOM uint32_t CEN        : 1;            /*!< (@ 0x00000000) Counter enable                                             */
      __IOM uint32_t UDIS       : 1;            /*!< (@ 0x00000001) Update disable                                             */
      __IOM uint32_t URS        : 1;            /*!< (@ 0x00000002) Update request source                                      */
      __IM  uint32_t            : 4;
      __IOM uint32_t ARPE       : 1;            /*!< (@ 0x00000007) Auto-reload preload enable                                 */
      __IOM uint32_t CKD        : 2;            /*!< (@ 0x00000008) Clock division                                             */
    } bit;
  } CR1;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000004) control register 2                                         */

    struct {
      __IM  uint32_t            : 4;
      __IOM uint32_t MMS        : 3;            /*!< (@ 0x00000004) Master mode selection                                      */
    } bit;
  } CR2;
  __IM  uint32_t  RESERVED;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000000C) DMA/Interrupt enable register                              */

    struct {
      __IOM uint32_t UIE        : 1;            /*!< (@ 0x00000000) Update interrupt enable                                    */
      __IOM uint32_t CC1IE      : 1;            /*!< (@ 0x00000001) Capture/Compare 1 interrupt enable                         */
    } bit;
  } DIER;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000010) status register                                            */

    struct {
      __IOM uint32_t UIF        : 1;            /*!< (@ 0x00000000) Update interrupt flag                                      */
      __IOM uint32_t CC1IF      : 1;            /*!< (@ 0x00000001) Capture/compare 1 interrupt flag                           */
      __IM  uint32_t            : 7;
      __IOM uint32_t CC1OF      : 1;            /*!< (@ 0x00000009) Capture/Compare 1 overcapture flag                         */
    } bit;
  } SR;

  union {
    __OM  uint32_t reg;                         /*!< (@ 0x00000014) event generation register                                  */

    struct {
      __OM  uint32_t UG         : 1;            /*!< (@ 0x00000000) Update generation                                          */
      __OM  uint32_t CC1G       : 1;            /*!< (@ 0x00000001) Capture/compare 1 generation                               */
    } bit;
  } EGR;

  union {
    union {
      __IOM uint32_t reg;                       /*!< (@ 0x00000018) capture/compare mode register (output mode)                */

      struct {
        __IOM uint32_t CC1S     : 2;            /*!< (@ 0x00000000) Capture/Compare 1 selection                                */
        __IM  uint32_t          : 1;
        __IOM uint32_t OC1PE    : 1;            /*!< (@ 0x00000003) Output Compare 1 preload enable                            */
        __IOM uint32_t OC1M     : 3;            /*!< (@ 0x00000004) Output Compare 1 mode                                      */
      } bit;
    } CCMR1_Output;

    union {
      __IOM uint32_t reg;                       /*!< (@ 0x00000018) capture/compare mode register (input mode)                 */

      struct {
        __IOM uint32_t CC1S     : 2;            /*!< (@ 0x00000000) Capture/Compare 1 selection                                */
        __IOM uint32_t IC1PSC   : 2;            /*!< (@ 0x00000002) Input capture 1 prescaler                                  */
        __IOM uint32_t IC1F     : 4;            /*!< (@ 0x00000004) Input capture 1 filter                                     */
      } bit;
    } CCMR1_Input;
  };
  __IM  uint32_t  RESERVED1;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000020) capture/compare enable register                            */

