pointer-x/stm32f103c8_RCC_CMSIS_bitfields/CMSIS/stm32f103c8_bitfield.h
    struct {
      __IOM uint32_t CC1E       : 1;            /*!< (@ 0x00000000) Capture/Compare 1 output enable                            */
      __IOM uint32_t CC1P       : 1;            /*!< (@ 0x00000001) Capture/Compare 1 output Polarity                          */
      __IM  uint32_t            : 1;
      __IOM uint32_t CC1NP      : 1;            /*!< (@ 0x00000003) Capture/Compare 1 output Polarity                          */
    } bit;
  } CCER;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000024) counter                                                    */

    struct {
      __IOM uint32_t CNT        : 16;           /*!< (@ 0x00000000) counter value                                              */
    } bit;
  } CNT;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000028) prescaler                                                  */

    struct {
      __IOM uint32_t PSC        : 16;           /*!< (@ 0x00000000) Prescaler value                                            */
    } bit;
  } PSC;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000002C) auto-reload register                                       */

    struct {
      __IOM uint32_t ARR        : 16;           /*!< (@ 0x00000000) Auto-reload value                                          */
    } bit;
  } ARR;
  __IM  uint32_t  RESERVED2;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000034) capture/compare register 1                                 */

    struct {
      __IOM uint32_t CCR1       : 16;           /*!< (@ 0x00000000) Capture/Compare 1 value                                    */
    } bit;
  } CCR1;
} TIM10_Type;                                   /*!< Size = 56 (0x38)                                                          */



/* =========================================================================================================================== */
/* ================                                           TIM6                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Basic timer (TIM6)
  */

typedef struct {                                /*!< (@ 0x40001000) TIM6 Structure                                             */

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000000) control register 1                                         */

    struct {
      __IOM uint32_t CEN        : 1;            /*!< (@ 0x00000000) Counter enable                                             */
      __IOM uint32_t UDIS       : 1;            /*!< (@ 0x00000001) Update disable                                             */
      __IOM uint32_t URS        : 1;            /*!< (@ 0x00000002) Update request source                                      */
      __IOM uint32_t OPM        : 1;            /*!< (@ 0x00000003) One-pulse mode                                             */
      __IM  uint32_t            : 3;
      __IOM uint32_t ARPE       : 1;            /*!< (@ 0x00000007) Auto-reload preload enable                                 */
    } bit;
  } CR1;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000004) control register 2                                         */

    struct {
      __IM  uint32_t            : 4;
      __IOM uint32_t MMS        : 3;            /*!< (@ 0x00000004) Master mode selection                                      */
    } bit;
  } CR2;
  __IM  uint32_t  RESERVED;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000000C) DMA/Interrupt enable register                              */

    struct {
      __IOM uint32_t UIE        : 1;            /*!< (@ 0x00000000) Update interrupt enable                                    */
      __IM  uint32_t            : 7;
      __IOM uint32_t UDE        : 1;            /*!< (@ 0x00000008) Update DMA request enable                                  */
    } bit;
  } DIER;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000010) status register                                            */

    struct {
      __IOM uint32_t UIF        : 1;            /*!< (@ 0x00000000) Update interrupt flag                                      */
    } bit;
  } SR;

  union {
    __OM  uint32_t reg;                         /*!< (@ 0x00000014) event generation register                                  */

    struct {
      __OM  uint32_t UG         : 1;            /*!< (@ 0x00000000) Update generation                                          */
    } bit;
  } EGR;
  __IM  uint32_t  RESERVED1[3];

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000024) counter                                                    */

    struct {
      __IOM uint32_t CNT        : 16;           /*!< (@ 0x00000000) Low counter value                                          */
    } bit;
  } CNT;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000028) prescaler                                                  */

    struct {
      __IOM uint32_t PSC        : 16;           /*!< (@ 0x00000000) Prescaler value                                            */
    } bit;
  } PSC;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000002C) auto-reload register                                       */

    struct {
      __IOM uint32_t ARR        : 16;           /*!< (@ 0x00000000) Low Auto-reload value                                      */
    } bit;
  } ARR;
} TIM6_Type;                                    /*!< Size = 48 (0x30)                                                          */



/* =========================================================================================================================== */
/* ================                                           I2C1                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Inter integrated circuit (I2C1)
  */

