pointer-x/stm32f103c8_RCC_CMSIS_bitfields/CMSIS/stm32f103c8_bitfield.h
typedef struct {                                /*!< (@ 0x40005400) I2C1 Structure                                             */

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000000) Control register 1                                         */

    struct {
      __IOM uint32_t PE         : 1;            /*!< (@ 0x00000000) Peripheral enable                                          */
      __IOM uint32_t SMBUS      : 1;            /*!< (@ 0x00000001) SMBus mode                                                 */
      __IM  uint32_t            : 1;
      __IOM uint32_t SMBTYPE    : 1;            /*!< (@ 0x00000003) SMBus type                                                 */
      __IOM uint32_t ENARP      : 1;            /*!< (@ 0x00000004) ARP enable                                                 */
      __IOM uint32_t ENPEC      : 1;            /*!< (@ 0x00000005) PEC enable                                                 */
      __IOM uint32_t ENGC       : 1;            /*!< (@ 0x00000006) General call enable                                        */
      __IOM uint32_t NOSTRETCH  : 1;            /*!< (@ 0x00000007) Clock stretching disable (Slave mode)                      */
      __IOM uint32_t START      : 1;            /*!< (@ 0x00000008) Start generation                                           */
      __IOM uint32_t STOP       : 1;            /*!< (@ 0x00000009) Stop generation                                            */
      __IOM uint32_t ACK        : 1;            /*!< (@ 0x0000000A) Acknowledge enable                                         */
      __IOM uint32_t POS        : 1;            /*!< (@ 0x0000000B) Acknowledge/PEC Position (for data reception)              */
      __IOM uint32_t PEC        : 1;            /*!< (@ 0x0000000C) Packet error checking                                      */
      __IOM uint32_t ALERT      : 1;            /*!< (@ 0x0000000D) SMBus alert                                                */
      __IM  uint32_t            : 1;
      __IOM uint32_t SWRST      : 1;            /*!< (@ 0x0000000F) Software reset                                             */
    } bit;
  } CR1;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000004) Control register 2                                         */

    struct {
      __IOM uint32_t FREQ       : 6;            /*!< (@ 0x00000000) Peripheral clock frequency                                 */
      __IM  uint32_t            : 2;
      __IOM uint32_t ITERREN    : 1;            /*!< (@ 0x00000008) Error interrupt enable                                     */
      __IOM uint32_t ITEVTEN    : 1;            /*!< (@ 0x00000009) Event interrupt enable                                     */
      __IOM uint32_t ITBUFEN    : 1;            /*!< (@ 0x0000000A) Buffer interrupt enable                                    */
      __IOM uint32_t DMAEN      : 1;            /*!< (@ 0x0000000B) DMA requests enable                                        */
      __IOM uint32_t LAST       : 1;            /*!< (@ 0x0000000C) DMA last transfer                                          */
    } bit;
  } CR2;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000008) Own address register 1                                     */

    struct {
      __IOM uint32_t ADD0       : 1;            /*!< (@ 0x00000000) Interface address                                          */
      __IOM uint32_t ADD7       : 7;            /*!< (@ 0x00000001) Interface address                                          */
      __IOM uint32_t ADD10      : 2;            /*!< (@ 0x00000008) Interface address                                          */
      __IM  uint32_t            : 5;
      __IOM uint32_t ADDMODE    : 1;            /*!< (@ 0x0000000F) Addressing mode (slave mode)                               */
    } bit;
  } OAR1;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000000C) Own address register 2                                     */

    struct {
      __IOM uint32_t ENDUAL     : 1;            /*!< (@ 0x00000000) Dual addressing mode enable                                */
      __IOM uint32_t ADD2       : 7;            /*!< (@ 0x00000001) Interface address                                          */
    } bit;
  } OAR2;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000010) Data register                                              */

    struct {
      __IOM uint32_t DR         : 8;            /*!< (@ 0x00000000) 8-bit data register                                        */
    } bit;
  } DR;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000014) Status register 1                                          */

    struct {
      __IM  uint32_t SB         : 1;            /*!< (@ 0x00000000) Start bit (Master mode)                                    */
      __IM  uint32_t ADDR       : 1;            /*!< (@ 0x00000001) Address sent (master mode)/matched (slave mode)            */
      __IM  uint32_t BTF        : 1;            /*!< (@ 0x00000002) Byte transfer finished                                     */
      __IM  uint32_t ADD10      : 1;            /*!< (@ 0x00000003) 10-bit header sent (Master mode)                           */
      __IM  uint32_t STOPF      : 1;            /*!< (@ 0x00000004) Stop detection (slave mode)                                */
      __IM  uint32_t            : 1;
      __IM  uint32_t RxNE       : 1;            /*!< (@ 0x00000006) Data register not empty (receivers)                        */
      __IM  uint32_t TxE        : 1;            /*!< (@ 0x00000007) Data register empty (transmitters)                         */
      __IOM uint32_t BERR       : 1;            /*!< (@ 0x00000008) Bus error                                                  */
      __IOM uint32_t ARLO       : 1;            /*!< (@ 0x00000009) Arbitration lost (master mode)                             */
      __IOM uint32_t AF         : 1;            /*!< (@ 0x0000000A) Acknowledge failure                                        */
      __IOM uint32_t OVR        : 1;            /*!< (@ 0x0000000B) Overrun/Underrun                                           */
      __IOM uint32_t PECERR     : 1;            /*!< (@ 0x0000000C) PEC Error in reception                                     */
      __IM  uint32_t            : 1;
      __IOM uint32_t TIMEOUT    : 1;            /*!< (@ 0x0000000E) Timeout or Tlow error                                      */
      __IOM uint32_t SMBALERT   : 1;            /*!< (@ 0x0000000F) SMBus alert                                                */
    } bit;
  } SR1;

  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000018) Status register 2                                          */

