pointer-x/stm32f103c8_RCC_CMSIS_bitfields/CMSIS/stm32f103c8_bitfield.h
    struct {
      __IM  uint32_t MSL        : 1;            /*!< (@ 0x00000000) Master/slave                                               */
      __IM  uint32_t BUSY       : 1;            /*!< (@ 0x00000001) Bus busy                                                   */
      __IM  uint32_t TRA        : 1;            /*!< (@ 0x00000002) Transmitter/receiver                                       */
      __IM  uint32_t            : 1;
      __IM  uint32_t GENCALL    : 1;            /*!< (@ 0x00000004) General call address (Slave mode)                          */
      __IM  uint32_t SMBDEFAULT : 1;            /*!< (@ 0x00000005) SMBus device default address (Slave mode)                  */
      __IM  uint32_t SMBHOST    : 1;            /*!< (@ 0x00000006) SMBus host header (Slave mode)                             */
      __IM  uint32_t DUALF      : 1;            /*!< (@ 0x00000007) Dual flag (Slave mode)                                     */
      __IM  uint32_t PEC        : 8;            /*!< (@ 0x00000008) acket error checking register                              */
    } bit;
  } SR2;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000001C) Clock control register                                     */

    struct {
      __IOM uint32_t CCR        : 12;           /*!< (@ 0x00000000) Clock control register in Fast/Standard mode
                                                                    (Master mode)                                              */
      __IM  uint32_t            : 2;
      __IOM uint32_t DUTY       : 1;            /*!< (@ 0x0000000E) Fast mode duty cycle                                       */
      __IOM uint32_t F_S        : 1;            /*!< (@ 0x0000000F) I2C master mode selection                                  */
    } bit;
  } CCR;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000020) TRISE register                                             */

    struct {
      __IOM uint32_t TRISE      : 6;            /*!< (@ 0x00000000) Maximum rise time in Fast/Standard mode (Master
                                                                    mode)                                                      */
    } bit;
  } TRISE;
} I2C1_Type;                                    /*!< Size = 36 (0x24)                                                          */



/* =========================================================================================================================== */
/* ================                                           SPI1                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Serial peripheral interface (SPI1)
  */

typedef struct {                                /*!< (@ 0x40013000) SPI1 Structure                                             */

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000000) control register 1                                         */

    struct {
      __IOM uint32_t CPHA       : 1;            /*!< (@ 0x00000000) Clock phase                                                */
      __IOM uint32_t CPOL       : 1;            /*!< (@ 0x00000001) Clock polarity                                             */
      __IOM uint32_t MSTR       : 1;            /*!< (@ 0x00000002) Master selection                                           */
      __IOM uint32_t BR         : 3;            /*!< (@ 0x00000003) Baud rate control                                          */
      __IOM uint32_t SPE        : 1;            /*!< (@ 0x00000006) SPI enable                                                 */
      __IOM uint32_t LSBFIRST   : 1;            /*!< (@ 0x00000007) Frame format                                               */
      __IOM uint32_t SSI        : 1;            /*!< (@ 0x00000008) Internal slave select                                      */
      __IOM uint32_t SSM        : 1;            /*!< (@ 0x00000009) Software slave management                                  */
      __IOM uint32_t RXONLY     : 1;            /*!< (@ 0x0000000A) Receive only                                               */
      __IOM uint32_t DFF        : 1;            /*!< (@ 0x0000000B) Data frame format                                          */
      __IOM uint32_t CRCNEXT    : 1;            /*!< (@ 0x0000000C) CRC transfer next                                          */
      __IOM uint32_t CRCEN      : 1;            /*!< (@ 0x0000000D) Hardware CRC calculation enable                            */
      __IOM uint32_t BIDIOE     : 1;            /*!< (@ 0x0000000E) Output enable in bidirectional mode                        */
      __IOM uint32_t BIDIMODE   : 1;            /*!< (@ 0x0000000F) Bidirectional data mode enable                             */
    } bit;
  } CR1;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000004) control register 2                                         */

    struct {
      __IOM uint32_t RXDMAEN    : 1;            /*!< (@ 0x00000000) Rx buffer DMA enable                                       */
      __IOM uint32_t TXDMAEN    : 1;            /*!< (@ 0x00000001) Tx buffer DMA enable                                       */
      __IOM uint32_t SSOE       : 1;            /*!< (@ 0x00000002) SS output enable                                           */
      __IM  uint32_t            : 2;
      __IOM uint32_t ERRIE      : 1;            /*!< (@ 0x00000005) Error interrupt enable                                     */
      __IOM uint32_t RXNEIE     : 1;            /*!< (@ 0x00000006) RX buffer not empty interrupt enable                       */
      __IOM uint32_t TXEIE      : 1;            /*!< (@ 0x00000007) Tx buffer empty interrupt enable                           */
    } bit;
  } CR2;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000008) status register                                            */

