pointer-x/stm32f103c8_RCC_CMSIS_bitfields/CMSIS/stm32f103c8_bitfield.h
    struct {
      __IM  uint32_t RXNE       : 1;            /*!< (@ 0x00000000) Receive buffer not empty                                   */
      __IM  uint32_t TXE        : 1;            /*!< (@ 0x00000001) Transmit buffer empty                                      */
      __IM  uint32_t CHSIDE     : 1;            /*!< (@ 0x00000002) Channel side                                               */
      __IM  uint32_t UDR        : 1;            /*!< (@ 0x00000003) Underrun flag                                              */
      __IOM uint32_t CRCERR     : 1;            /*!< (@ 0x00000004) CRC error flag                                             */
      __IM  uint32_t MODF       : 1;            /*!< (@ 0x00000005) Mode fault                                                 */
      __IM  uint32_t OVR        : 1;            /*!< (@ 0x00000006) Overrun flag                                               */
      __IM  uint32_t BSY        : 1;            /*!< (@ 0x00000007) Busy flag                                                  */
    } bit;
  } SR;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000000C) data register                                              */

    struct {
      __IOM uint32_t DR         : 16;           /*!< (@ 0x00000000) Data register                                              */
    } bit;
  } DR;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000010) CRC polynomial register                                    */

    struct {
      __IOM uint32_t CRCPOLY    : 16;           /*!< (@ 0x00000000) CRC polynomial register                                    */
    } bit;
  } CRCPR;

  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000014) RX CRC register                                            */

    struct {
      __IM  uint32_t RxCRC      : 16;           /*!< (@ 0x00000000) Rx CRC register                                            */
    } bit;
  } RXCRCR;

  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000018) TX CRC register                                            */

    struct {
      __IM  uint32_t TxCRC      : 16;           /*!< (@ 0x00000000) Tx CRC register                                            */
    } bit;
  } TXCRCR;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000001C) I2S configuration register                                 */

    struct {
      __IOM uint32_t CHLEN      : 1;            /*!< (@ 0x00000000) Channel length (number of bits per audio channel)          */
      __IOM uint32_t DATLEN     : 2;            /*!< (@ 0x00000001) Data length to be transferred                              */
      __IOM uint32_t CKPOL      : 1;            /*!< (@ 0x00000003) Steady state clock polarity                                */
      __IOM uint32_t I2SSTD     : 2;            /*!< (@ 0x00000004) I2S standard selection                                     */
      __IM  uint32_t            : 1;
      __IOM uint32_t PCMSYNC    : 1;            /*!< (@ 0x00000007) PCM frame synchronization                                  */
      __IOM uint32_t I2SCFG     : 2;            /*!< (@ 0x00000008) I2S configuration mode                                     */
      __IOM uint32_t I2SE       : 1;            /*!< (@ 0x0000000A) I2S Enable                                                 */
      __IOM uint32_t I2SMOD     : 1;            /*!< (@ 0x0000000B) I2S mode selection                                         */
    } bit;
  } I2SCFGR;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000020) I2S prescaler register                                     */

    struct {
      __IOM uint32_t I2SDIV     : 8;            /*!< (@ 0x00000000) I2S Linear prescaler                                       */
      __IOM uint32_t ODD        : 1;            /*!< (@ 0x00000008) Odd factor for the prescaler                               */
      __IOM uint32_t MCKOE      : 1;            /*!< (@ 0x00000009) Master clock output enable                                 */
    } bit;
  } I2SPR;
} SPI1_Type;                                    /*!< Size = 36 (0x24)                                                          */



/* =========================================================================================================================== */
/* ================                                          USART1                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief Universal synchronous asynchronous receiver  transmitter (USART1)
  */

typedef struct {                                /*!< (@ 0x40013800) USART1 Structure                                           */

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000000) Status register                                            */

    struct {
      __IM  uint32_t PE         : 1;            /*!< (@ 0x00000000) Parity error                                               */
      __IM  uint32_t FE         : 1;            /*!< (@ 0x00000001) Framing error                                              */
      __IM  uint32_t NE         : 1;            /*!< (@ 0x00000002) Noise error flag                                           */
      __IM  uint32_t ORE        : 1;            /*!< (@ 0x00000003) Overrun error                                              */
      __IM  uint32_t IDLE       : 1;            /*!< (@ 0x00000004) IDLE line detected                                         */
      __IOM uint32_t RXNE       : 1;            /*!< (@ 0x00000005) Read data register not empty                               */
      __IOM uint32_t TC         : 1;            /*!< (@ 0x00000006) Transmission complete                                      */
      __IM  uint32_t TXE        : 1;            /*!< (@ 0x00000007) Transmit data register empty                               */
      __IOM uint32_t LBD        : 1;            /*!< (@ 0x00000008) LIN break detection flag                                   */
      __IOM uint32_t CTS        : 1;            /*!< (@ 0x00000009) CTS flag                                                   */
    } bit;
  } SR;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000004) Data register                                              */

