pointer-x/stm32f103c8_RCC_CMSIS_bitfields/CMSIS/stm32f103c8_bitfield.h
    struct {
      __IOM uint32_t DR         : 9;            /*!< (@ 0x00000000) Data value                                                 */
    } bit;
  } DR;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000008) Baud rate register                                         */

    struct {
      __IOM uint32_t DIV_Fraction : 4;          /*!< (@ 0x00000000) fraction of USARTDIV                                       */
      __IOM uint32_t DIV_Mantissa : 12;         /*!< (@ 0x00000004) mantissa of USARTDIV                                       */
    } bit;
  } BRR;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000000C) Control register 1                                         */

    struct {
      __IOM uint32_t SBK        : 1;            /*!< (@ 0x00000000) Send break                                                 */
      __IOM uint32_t RWU        : 1;            /*!< (@ 0x00000001) Receiver wakeup                                            */
      __IOM uint32_t RE         : 1;            /*!< (@ 0x00000002) Receiver enable                                            */
      __IOM uint32_t TE         : 1;            /*!< (@ 0x00000003) Transmitter enable                                         */
      __IOM uint32_t IDLEIE     : 1;            /*!< (@ 0x00000004) IDLE interrupt enable                                      */
      __IOM uint32_t RXNEIE     : 1;            /*!< (@ 0x00000005) RXNE interrupt enable                                      */
      __IOM uint32_t TCIE       : 1;            /*!< (@ 0x00000006) Transmission complete interrupt enable                     */
      __IOM uint32_t TXEIE      : 1;            /*!< (@ 0x00000007) TXE interrupt enable                                       */
      __IOM uint32_t PEIE       : 1;            /*!< (@ 0x00000008) PE interrupt enable                                        */
      __IOM uint32_t PS         : 1;            /*!< (@ 0x00000009) Parity selection                                           */
      __IOM uint32_t PCE        : 1;            /*!< (@ 0x0000000A) Parity control enable                                      */
      __IOM uint32_t WAKE       : 1;            /*!< (@ 0x0000000B) Wakeup method                                              */
      __IOM uint32_t M          : 1;            /*!< (@ 0x0000000C) Word length                                                */
      __IOM uint32_t UE         : 1;            /*!< (@ 0x0000000D) USART enable                                               */
    } bit;
  } CR1;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000010) Control register 2                                         */

    struct {
      __IOM uint32_t ADD        : 4;            /*!< (@ 0x00000000) Address of the USART node                                  */
      __IM  uint32_t            : 1;
      __IOM uint32_t LBDL       : 1;            /*!< (@ 0x00000005) lin break detection length                                 */
      __IOM uint32_t LBDIE      : 1;            /*!< (@ 0x00000006) LIN break detection interrupt enable                       */
      __IM  uint32_t            : 1;
      __IOM uint32_t LBCL       : 1;            /*!< (@ 0x00000008) Last bit clock pulse                                       */
      __IOM uint32_t CPHA       : 1;            /*!< (@ 0x00000009) Clock phase                                                */
      __IOM uint32_t CPOL       : 1;            /*!< (@ 0x0000000A) Clock polarity                                             */
      __IOM uint32_t CLKEN      : 1;            /*!< (@ 0x0000000B) Clock enable                                               */
      __IOM uint32_t STOP       : 2;            /*!< (@ 0x0000000C) STOP bits                                                  */
      __IOM uint32_t LINEN      : 1;            /*!< (@ 0x0000000E) LIN mode enable                                            */
    } bit;
  } CR2;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000014) Control register 3                                         */

    struct {
      __IOM uint32_t EIE        : 1;            /*!< (@ 0x00000000) Error interrupt enable                                     */
      __IOM uint32_t IREN       : 1;            /*!< (@ 0x00000001) IrDA mode enable                                           */
      __IOM uint32_t IRLP       : 1;            /*!< (@ 0x00000002) IrDA low-power                                             */
      __IOM uint32_t HDSEL      : 1;            /*!< (@ 0x00000003) Half-duplex selection                                      */
      __IOM uint32_t NACK       : 1;            /*!< (@ 0x00000004) Smartcard NACK enable                                      */
      __IOM uint32_t SCEN       : 1;            /*!< (@ 0x00000005) Smartcard mode enable                                      */
      __IOM uint32_t DMAR       : 1;            /*!< (@ 0x00000006) DMA enable receiver                                        */
      __IOM uint32_t DMAT       : 1;            /*!< (@ 0x00000007) DMA enable transmitter                                     */
      __IOM uint32_t RTSE       : 1;            /*!< (@ 0x00000008) RTS enable                                                 */
      __IOM uint32_t CTSE       : 1;            /*!< (@ 0x00000009) CTS enable                                                 */
      __IOM uint32_t CTSIE      : 1;            /*!< (@ 0x0000000A) CTS interrupt enable                                       */
    } bit;
  } CR3;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000018) Guard time and prescaler register                          */

    struct {
      __IOM uint32_t PSC        : 8;            /*!< (@ 0x00000000) Prescaler value                                            */
      __IOM uint32_t GT         : 8;            /*!< (@ 0x00000008) Guard time value                                           */
    } bit;
  } GTPR;
} USART1_Type;                                  /*!< Size = 28 (0x1c)                                                          */



/* =========================================================================================================================== */
/* ================                                           ADC1                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Analog to digital converter (ADC1)
  */

typedef struct {                                /*!< (@ 0x40012400) ADC1 Structure                                             */

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000000) status register                                            */

