pointer-x/stm32f103c8_RCC_CMSIS_bitfields/CMSIS/stm32f103c8_bitfield.h
    struct {
      __IOM uint32_t JSQ1       : 5;            /*!< (@ 0x00000000) 1st conversion in injected sequence                        */
      __IOM uint32_t JSQ2       : 5;            /*!< (@ 0x00000005) 2nd conversion in injected sequence                        */
      __IOM uint32_t JSQ3       : 5;            /*!< (@ 0x0000000A) 3rd conversion in injected sequence                        */
      __IOM uint32_t JSQ4       : 5;            /*!< (@ 0x0000000F) 4th conversion in injected sequence                        */
      __IOM uint32_t JL         : 2;            /*!< (@ 0x00000014) Injected sequence length                                   */
    } bit;
  } JSQR;

  union {
    __IM  uint32_t reg;                         /*!< (@ 0x0000003C) injected data register x                                   */

    struct {
      __IM  uint32_t JDATA      : 16;           /*!< (@ 0x00000000) Injected data                                              */
    } bit;
  } JDR1;

  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000040) injected data register x                                   */

    struct {
      __IM  uint32_t JDATA      : 16;           /*!< (@ 0x00000000) Injected data                                              */
    } bit;
  } JDR2;

  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000044) injected data register x                                   */

    struct {
      __IM  uint32_t JDATA      : 16;           /*!< (@ 0x00000000) Injected data                                              */
    } bit;
  } JDR3;

  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000048) injected data register x                                   */

    struct {
      __IM  uint32_t JDATA      : 16;           /*!< (@ 0x00000000) Injected data                                              */
    } bit;
  } JDR4;

  union {
    __IM  uint32_t reg;                         /*!< (@ 0x0000004C) regular data register                                      */

    struct {
      __IM  uint32_t DATA       : 16;           /*!< (@ 0x00000000) Regular data                                               */
      __IM  uint32_t ADC2DATA   : 16;           /*!< (@ 0x00000010) ADC2 data                                                  */
    } bit;
  } DR;
} ADC1_Type;                                    /*!< Size = 80 (0x50)                                                          */



/* =========================================================================================================================== */
/* ================                                           ADC2                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Analog to digital converter (ADC2)
  */

typedef struct {                                /*!< (@ 0x40012800) ADC2 Structure                                             */

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000000) status register                                            */

    struct {
      __IOM uint32_t AWD        : 1;            /*!< (@ 0x00000000) Analog watchdog flag                                       */
      __IOM uint32_t EOC        : 1;            /*!< (@ 0x00000001) Regular channel end of conversion                          */
      __IOM uint32_t JEOC       : 1;            /*!< (@ 0x00000002) Injected channel end of conversion                         */
      __IOM uint32_t JSTRT      : 1;            /*!< (@ 0x00000003) Injected channel start flag                                */
      __IOM uint32_t STRT       : 1;            /*!< (@ 0x00000004) Regular channel start flag                                 */
    } bit;
  } SR;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000004) control register 1                                         */

    struct {
      __IOM uint32_t AWDCH      : 5;            /*!< (@ 0x00000000) Analog watchdog channel select bits                        */
      __IOM uint32_t EOCIE      : 1;            /*!< (@ 0x00000005) Interrupt enable for EOC                                   */
      __IOM uint32_t AWDIE      : 1;            /*!< (@ 0x00000006) Analog watchdog interrupt enable                           */
      __IOM uint32_t JEOCIE     : 1;            /*!< (@ 0x00000007) Interrupt enable for injected channels                     */
      __IOM uint32_t SCAN       : 1;            /*!< (@ 0x00000008) Scan mode                                                  */
      __IOM uint32_t AWDSGL     : 1;            /*!< (@ 0x00000009) Enable the watchdog on a single channel in scan
                                                                    mode                                                       */
      __IOM uint32_t JAUTO      : 1;            /*!< (@ 0x0000000A) Automatic injected group conversion                        */
      __IOM uint32_t DISCEN     : 1;            /*!< (@ 0x0000000B) Discontinuous mode on regular channels                     */
      __IOM uint32_t JDISCEN    : 1;            /*!< (@ 0x0000000C) Discontinuous mode on injected channels                    */
      __IOM uint32_t DISCNUM    : 3;            /*!< (@ 0x0000000D) Discontinuous mode channel count                           */
      __IM  uint32_t            : 6;
      __IOM uint32_t JAWDEN     : 1;            /*!< (@ 0x00000016) Analog watchdog enable on injected channels                */
      __IOM uint32_t AWDEN      : 1;            /*!< (@ 0x00000017) Analog watchdog enable on regular channels                 */
    } bit;
  } CR1;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000008) control register 2                                         */

    struct {
      __IOM uint32_t ADON       : 1;            /*!< (@ 0x00000000) A/D converter ON / OFF                                     */
      __IOM uint32_t CONT       : 1;            /*!< (@ 0x00000001) Continuous conversion                                      */
      __IOM uint32_t CAL        : 1;            /*!< (@ 0x00000002) A/D calibration                                            */
      __IOM uint32_t RSTCAL     : 1;            /*!< (@ 0x00000003) Reset calibration                                          */
      __IM  uint32_t            : 4;
      __IOM uint32_t DMA        : 1;            /*!< (@ 0x00000008) Direct memory access mode                                  */
      __IM  uint32_t            : 2;
      __IOM uint32_t ALIGN      : 1;            /*!< (@ 0x0000000B) Data alignment                                             */
      __IOM uint32_t JEXTSEL    : 3;            /*!< (@ 0x0000000C) External event select for injected group                   */
      __IOM uint32_t JEXTTRIG   : 1;            /*!< (@ 0x0000000F) External trigger conversion mode for injected
                                                                    channels                                                   */
      __IM  uint32_t            : 1;
      __IOM uint32_t EXTSEL     : 3;            /*!< (@ 0x00000011) External event select for regular group                    */
      __IOM uint32_t EXTTRIG    : 1;            /*!< (@ 0x00000014) External trigger conversion mode for regular
                                                                    channels                                                   */
      __IOM uint32_t JSWSTART   : 1;            /*!< (@ 0x00000015) Start conversion of injected channels                      */
      __IOM uint32_t SWSTART    : 1;            /*!< (@ 0x00000016) Start conversion of regular channels                       */
      __IOM uint32_t TSVREFE    : 1;            /*!< (@ 0x00000017) Temperature sensor and VREFINT enable                      */
    } bit;
  } CR2;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000000C) sample time register 1                                     */

