pointer-x/stm32f103c8_RCC_CMSIS_bitfields/CMSIS/stm32f103c8_bitfield.h
    struct {
      __IOM uint32_t SMP10      : 3;            /*!< (@ 0x00000000) Channel 10 sample time selection                           */
      __IOM uint32_t SMP11      : 3;            /*!< (@ 0x00000003) Channel 11 sample time selection                           */
      __IOM uint32_t SMP12      : 3;            /*!< (@ 0x00000006) Channel 12 sample time selection                           */
      __IOM uint32_t SMP13      : 3;            /*!< (@ 0x00000009) Channel 13 sample time selection                           */
      __IOM uint32_t SMP14      : 3;            /*!< (@ 0x0000000C) Channel 14 sample time selection                           */
      __IOM uint32_t SMP15      : 3;            /*!< (@ 0x0000000F) Channel 15 sample time selection                           */
      __IOM uint32_t SMP16      : 3;            /*!< (@ 0x00000012) Channel 16 sample time selection                           */
      __IOM uint32_t SMP17      : 3;            /*!< (@ 0x00000015) Channel 17 sample time selection                           */
    } bit;
  } SMPR1;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000010) sample time register 2                                     */

    struct {
      __IOM uint32_t SMP0       : 3;            /*!< (@ 0x00000000) Channel 0 sample time selection                            */
      __IOM uint32_t SMP1       : 3;            /*!< (@ 0x00000003) Channel 1 sample time selection                            */
      __IOM uint32_t SMP2       : 3;            /*!< (@ 0x00000006) Channel 2 sample time selection                            */
      __IOM uint32_t SMP3       : 3;            /*!< (@ 0x00000009) Channel 3 sample time selection                            */
      __IOM uint32_t SMP4       : 3;            /*!< (@ 0x0000000C) Channel 4 sample time selection                            */
      __IOM uint32_t SMP5       : 3;            /*!< (@ 0x0000000F) Channel 5 sample time selection                            */
      __IOM uint32_t SMP6       : 3;            /*!< (@ 0x00000012) Channel 6 sample time selection                            */
      __IOM uint32_t SMP7       : 3;            /*!< (@ 0x00000015) Channel 7 sample time selection                            */
      __IOM uint32_t SMP8       : 3;            /*!< (@ 0x00000018) Channel 8 sample time selection                            */
      __IOM uint32_t SMP9       : 3;            /*!< (@ 0x0000001B) Channel 9 sample time selection                            */
    } bit;
  } SMPR2;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000014) injected channel data offset register x                    */

    struct {
      __IOM uint32_t JOFFSET1   : 12;           /*!< (@ 0x00000000) Data offset for injected channel x                         */
    } bit;
  } JOFR1;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000018) injected channel data offset register x                    */

    struct {
      __IOM uint32_t JOFFSET2   : 12;           /*!< (@ 0x00000000) Data offset for injected channel x                         */
    } bit;
  } JOFR2;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000001C) injected channel data offset register x                    */

    struct {
      __IOM uint32_t JOFFSET3   : 12;           /*!< (@ 0x00000000) Data offset for injected channel x                         */
    } bit;
  } JOFR3;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000020) injected channel data offset register x                    */

    struct {
      __IOM uint32_t JOFFSET4   : 12;           /*!< (@ 0x00000000) Data offset for injected channel x                         */
    } bit;
  } JOFR4;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000024) watchdog higher threshold register                         */

    struct {
      __IOM uint32_t HT         : 12;           /*!< (@ 0x00000000) Analog watchdog higher threshold                           */
    } bit;
  } HTR;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000028) watchdog lower threshold register                          */

    struct {
      __IOM uint32_t LT         : 12;           /*!< (@ 0x00000000) Analog watchdog lower threshold                            */
    } bit;
  } LTR;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000002C) regular sequence register 1                                */

    struct {
      __IOM uint32_t SQ13       : 5;            /*!< (@ 0x00000000) 13th conversion in regular sequence                        */
      __IOM uint32_t SQ14       : 5;            /*!< (@ 0x00000005) 14th conversion in regular sequence                        */
      __IOM uint32_t SQ15       : 5;            /*!< (@ 0x0000000A) 15th conversion in regular sequence                        */
      __IOM uint32_t SQ16       : 5;            /*!< (@ 0x0000000F) 16th conversion in regular sequence                        */
      __IOM uint32_t L          : 4;            /*!< (@ 0x00000014) Regular channel sequence length                            */
    } bit;
  } SQR1;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000030) regular sequence register 2                                */

    struct {
      __IOM uint32_t SQ7        : 5;            /*!< (@ 0x00000000) 7th conversion in regular sequence                         */
      __IOM uint32_t SQ8        : 5;            /*!< (@ 0x00000005) 8th conversion in regular sequence                         */
      __IOM uint32_t SQ9        : 5;            /*!< (@ 0x0000000A) 9th conversion in regular sequence                         */
      __IOM uint32_t SQ10       : 5;            /*!< (@ 0x0000000F) 10th conversion in regular sequence                        */
      __IOM uint32_t SQ11       : 5;            /*!< (@ 0x00000014) 11th conversion in regular sequence                        */
      __IOM uint32_t SQ12       : 5;            /*!< (@ 0x00000019) 12th conversion in regular sequence                        */
    } bit;
  } SQR2;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000034) regular sequence register 3                                */

