pointer-x/stm32f103c8_RCC_CMSIS_bitfields/CMSIS/stm32f103c8_bitfield.h
    struct {
      __IOM uint32_t SQ1        : 5;            /*!< (@ 0x00000000) 1st conversion in regular sequence                         */
      __IOM uint32_t SQ2        : 5;            /*!< (@ 0x00000005) 2nd conversion in regular sequence                         */
      __IOM uint32_t SQ3        : 5;            /*!< (@ 0x0000000A) 3rd conversion in regular sequence                         */
      __IOM uint32_t SQ4        : 5;            /*!< (@ 0x0000000F) 4th conversion in regular sequence                         */
      __IOM uint32_t SQ5        : 5;            /*!< (@ 0x00000014) 5th conversion in regular sequence                         */
      __IOM uint32_t SQ6        : 5;            /*!< (@ 0x00000019) 6th conversion in regular sequence                         */
    } bit;
  } SQR3;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000038) injected sequence register                                 */

    struct {
      __IOM uint32_t JSQ1       : 5;            /*!< (@ 0x00000000) 1st conversion in injected sequence                        */
      __IOM uint32_t JSQ2       : 5;            /*!< (@ 0x00000005) 2nd conversion in injected sequence                        */
      __IOM uint32_t JSQ3       : 5;            /*!< (@ 0x0000000A) 3rd conversion in injected sequence                        */
      __IOM uint32_t JSQ4       : 5;            /*!< (@ 0x0000000F) 4th conversion in injected sequence                        */
      __IOM uint32_t JL         : 2;            /*!< (@ 0x00000014) Injected sequence length                                   */
    } bit;
  } JSQR;

  union {
    __IM  uint32_t reg;                         /*!< (@ 0x0000003C) injected data register x                                   */

    struct {
      __IM  uint32_t JDATA      : 16;           /*!< (@ 0x00000000) Injected data                                              */
    } bit;
  } JDR1;

  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000040) injected data register x                                   */

    struct {
      __IM  uint32_t JDATA      : 16;           /*!< (@ 0x00000000) Injected data                                              */
    } bit;
  } JDR2;

  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000044) injected data register x                                   */

    struct {
      __IM  uint32_t JDATA      : 16;           /*!< (@ 0x00000000) Injected data                                              */
    } bit;
  } JDR3;

  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000048) injected data register x                                   */

    struct {
      __IM  uint32_t JDATA      : 16;           /*!< (@ 0x00000000) Injected data                                              */
    } bit;
  } JDR4;

  union {
    __IM  uint32_t reg;                         /*!< (@ 0x0000004C) regular data register                                      */

    struct {
      __IM  uint32_t DATA       : 16;           /*!< (@ 0x00000000) Regular data                                               */
    } bit;
  } DR;
} ADC2_Type;                                    /*!< Size = 80 (0x50)                                                          */



/* =========================================================================================================================== */
/* ================                                            CAN                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Controller area network (CAN)
  */

typedef struct {                                /*!< (@ 0x40006400) CAN Structure                                              */

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000000) CAN_MCR                                                    */

    struct {
      __IOM uint32_t INRQ       : 1;            /*!< (@ 0x00000000) INRQ                                                       */
      __IOM uint32_t SLEEP      : 1;            /*!< (@ 0x00000001) SLEEP                                                      */
      __IOM uint32_t TXFP       : 1;            /*!< (@ 0x00000002) TXFP                                                       */
      __IOM uint32_t RFLM       : 1;            /*!< (@ 0x00000003) RFLM                                                       */
      __IOM uint32_t NART       : 1;            /*!< (@ 0x00000004) NART                                                       */
      __IOM uint32_t AWUM       : 1;            /*!< (@ 0x00000005) AWUM                                                       */
      __IOM uint32_t ABOM       : 1;            /*!< (@ 0x00000006) ABOM                                                       */
      __IOM uint32_t TTCM       : 1;            /*!< (@ 0x00000007) TTCM                                                       */
      __IM  uint32_t            : 7;
      __IOM uint32_t RESET      : 1;            /*!< (@ 0x0000000F) RESET                                                      */
      __IOM uint32_t DBF        : 1;            /*!< (@ 0x00000010) DBF                                                        */
    } bit;
  } CAN_MCR;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000004) CAN_MSR                                                    */

    struct {
      __IM  uint32_t INAK       : 1;            /*!< (@ 0x00000000) INAK                                                       */
      __IM  uint32_t SLAK       : 1;            /*!< (@ 0x00000001) SLAK                                                       */
      __IOM uint32_t ERRI       : 1;            /*!< (@ 0x00000002) ERRI                                                       */
      __IOM uint32_t WKUI       : 1;            /*!< (@ 0x00000003) WKUI                                                       */
      __IOM uint32_t SLAKI      : 1;            /*!< (@ 0x00000004) SLAKI                                                      */
      __IM  uint32_t            : 3;
      __IM  uint32_t TXM        : 1;            /*!< (@ 0x00000008) TXM                                                        */
      __IM  uint32_t RXM        : 1;            /*!< (@ 0x00000009) RXM                                                        */
      __IM  uint32_t SAMP       : 1;            /*!< (@ 0x0000000A) SAMP                                                       */
      __IM  uint32_t RX         : 1;            /*!< (@ 0x0000000B) RX                                                         */
    } bit;
  } CAN_MSR;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000008) CAN_TSR                                                    */

