pointer-x/stm32f103c8_RCC_CMSIS_bitfields/CMSIS/stm32f103c8_bitfield.h
    struct {
      __IOM uint32_t RQCP0      : 1;            /*!< (@ 0x00000000) RQCP0                                                      */
      __IOM uint32_t TXOK0      : 1;            /*!< (@ 0x00000001) TXOK0                                                      */
      __IOM uint32_t ALST0      : 1;            /*!< (@ 0x00000002) ALST0                                                      */
      __IOM uint32_t TERR0      : 1;            /*!< (@ 0x00000003) TERR0                                                      */
      __IM  uint32_t            : 3;
      __IOM uint32_t ABRQ0      : 1;            /*!< (@ 0x00000007) ABRQ0                                                      */
      __IOM uint32_t RQCP1      : 1;            /*!< (@ 0x00000008) RQCP1                                                      */
      __IOM uint32_t TXOK1      : 1;            /*!< (@ 0x00000009) TXOK1                                                      */
      __IOM uint32_t ALST1      : 1;            /*!< (@ 0x0000000A) ALST1                                                      */
      __IOM uint32_t TERR1      : 1;            /*!< (@ 0x0000000B) TERR1                                                      */
      __IM  uint32_t            : 3;
      __IOM uint32_t ABRQ1      : 1;            /*!< (@ 0x0000000F) ABRQ1                                                      */
      __IOM uint32_t RQCP2      : 1;            /*!< (@ 0x00000010) RQCP2                                                      */
      __IOM uint32_t TXOK2      : 1;            /*!< (@ 0x00000011) TXOK2                                                      */
      __IOM uint32_t ALST2      : 1;            /*!< (@ 0x00000012) ALST2                                                      */
      __IOM uint32_t TERR2      : 1;            /*!< (@ 0x00000013) TERR2                                                      */
      __IM  uint32_t            : 3;
      __IOM uint32_t ABRQ2      : 1;            /*!< (@ 0x00000017) ABRQ2                                                      */
      __IM  uint32_t CODE       : 2;            /*!< (@ 0x00000018) CODE                                                       */
      __IM  uint32_t TME0       : 1;            /*!< (@ 0x0000001A) Lowest priority flag for mailbox 0                         */
      __IM  uint32_t TME1       : 1;            /*!< (@ 0x0000001B) Lowest priority flag for mailbox 1                         */
      __IM  uint32_t TME2       : 1;            /*!< (@ 0x0000001C) Lowest priority flag for mailbox 2                         */
      __IM  uint32_t LOW0       : 1;            /*!< (@ 0x0000001D) Lowest priority flag for mailbox 0                         */
      __IM  uint32_t LOW1       : 1;            /*!< (@ 0x0000001E) Lowest priority flag for mailbox 1                         */
      __IM  uint32_t LOW2       : 1;            /*!< (@ 0x0000001F) Lowest priority flag for mailbox 2                         */
    } bit;
  } CAN_TSR;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000000C) CAN_RF0R                                                   */

    struct {
      __IM  uint32_t FMP0       : 2;            /*!< (@ 0x00000000) FMP0                                                       */
      __IM  uint32_t            : 1;
      __IOM uint32_t FULL0      : 1;            /*!< (@ 0x00000003) FULL0                                                      */
      __IOM uint32_t FOVR0      : 1;            /*!< (@ 0x00000004) FOVR0                                                      */
      __IOM uint32_t RFOM0      : 1;            /*!< (@ 0x00000005) RFOM0                                                      */
    } bit;
  } CAN_RF0R;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000010) CAN_RF1R                                                   */

    struct {
      __IM  uint32_t FMP1       : 2;            /*!< (@ 0x00000000) FMP1                                                       */
      __IM  uint32_t            : 1;
      __IOM uint32_t FULL1      : 1;            /*!< (@ 0x00000003) FULL1                                                      */
      __IOM uint32_t FOVR1      : 1;            /*!< (@ 0x00000004) FOVR1                                                      */
      __IOM uint32_t RFOM1      : 1;            /*!< (@ 0x00000005) RFOM1                                                      */
    } bit;
  } CAN_RF1R;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000014) CAN_IER                                                    */

    struct {
      __IOM uint32_t TMEIE      : 1;            /*!< (@ 0x00000000) TMEIE                                                      */
      __IOM uint32_t FMPIE0     : 1;            /*!< (@ 0x00000001) FMPIE0                                                     */
      __IOM uint32_t FFIE0      : 1;            /*!< (@ 0x00000002) FFIE0                                                      */
      __IOM uint32_t FOVIE0     : 1;            /*!< (@ 0x00000003) FOVIE0                                                     */
      __IOM uint32_t FMPIE1     : 1;            /*!< (@ 0x00000004) FMPIE1                                                     */
      __IOM uint32_t FFIE1      : 1;            /*!< (@ 0x00000005) FFIE1                                                      */
      __IOM uint32_t FOVIE1     : 1;            /*!< (@ 0x00000006) FOVIE1                                                     */
      __IM  uint32_t            : 1;
      __IOM uint32_t EWGIE      : 1;            /*!< (@ 0x00000008) EWGIE                                                      */
      __IOM uint32_t EPVIE      : 1;            /*!< (@ 0x00000009) EPVIE                                                      */
      __IOM uint32_t BOFIE      : 1;            /*!< (@ 0x0000000A) BOFIE                                                      */
      __IOM uint32_t LECIE      : 1;            /*!< (@ 0x0000000B) LECIE                                                      */
      __IM  uint32_t            : 3;
      __IOM uint32_t ERRIE      : 1;            /*!< (@ 0x0000000F) ERRIE                                                      */
      __IOM uint32_t WKUIE      : 1;            /*!< (@ 0x00000010) WKUIE                                                      */
      __IOM uint32_t SLKIE      : 1;            /*!< (@ 0x00000011) SLKIE                                                      */
    } bit;
  } CAN_IER;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000018) CAN_ESR                                                    */

