pointer-x/stm32f103c8_RCC_CMSIS_bitfields/CMSIS/stm32f103c8_bitfield.h
    struct {
      __IM  uint32_t EWGF       : 1;            /*!< (@ 0x00000000) EWGF                                                       */
      __IM  uint32_t EPVF       : 1;            /*!< (@ 0x00000001) EPVF                                                       */
      __IM  uint32_t BOFF       : 1;            /*!< (@ 0x00000002) BOFF                                                       */
      __IM  uint32_t            : 1;
      __IOM uint32_t LEC        : 3;            /*!< (@ 0x00000004) LEC                                                        */
      __IM  uint32_t            : 9;
      __IM  uint32_t TEC        : 8;            /*!< (@ 0x00000010) TEC                                                        */
      __IM  uint32_t REC        : 8;            /*!< (@ 0x00000018) REC                                                        */
    } bit;
  } CAN_ESR;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000001C) CAN_BTR                                                    */

    struct {
      __IOM uint32_t BRP        : 10;           /*!< (@ 0x00000000) BRP                                                        */
      __IM  uint32_t            : 6;
      __IOM uint32_t TS1        : 4;            /*!< (@ 0x00000010) TS1                                                        */
      __IOM uint32_t TS2        : 3;            /*!< (@ 0x00000014) TS2                                                        */
      __IM  uint32_t            : 1;
      __IOM uint32_t SJW        : 2;            /*!< (@ 0x00000018) SJW                                                        */
      __IM  uint32_t            : 4;
      __IOM uint32_t LBKM       : 1;            /*!< (@ 0x0000001E) LBKM                                                       */
      __IOM uint32_t SILM       : 1;            /*!< (@ 0x0000001F) SILM                                                       */
    } bit;
  } CAN_BTR;
  __IM  uint32_t  RESERVED[88];

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000180) CAN_TI0R                                                   */

    struct {
      __IOM uint32_t TXRQ       : 1;            /*!< (@ 0x00000000) TXRQ                                                       */
      __IOM uint32_t RTR        : 1;            /*!< (@ 0x00000001) RTR                                                        */
      __IOM uint32_t IDE        : 1;            /*!< (@ 0x00000002) IDE                                                        */
      __IOM uint32_t EXID       : 18;           /*!< (@ 0x00000003) EXID                                                       */
      __IOM uint32_t STID       : 11;           /*!< (@ 0x00000015) STID                                                       */
    } bit;
  } CAN_TI0R;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000184) CAN_TDT0R                                                  */

    struct {
      __IOM uint32_t DLC        : 4;            /*!< (@ 0x00000000) DLC                                                        */
      __IM  uint32_t            : 4;
      __IOM uint32_t TGT        : 1;            /*!< (@ 0x00000008) TGT                                                        */
      __IM  uint32_t            : 7;
      __IOM uint32_t TIME       : 16;           /*!< (@ 0x00000010) TIME                                                       */
    } bit;
  } CAN_TDT0R;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000188) CAN_TDL0R                                                  */

    struct {
      __IOM uint32_t DATA0      : 8;            /*!< (@ 0x00000000) DATA0                                                      */
      __IOM uint32_t DATA1      : 8;            /*!< (@ 0x00000008) DATA1                                                      */
      __IOM uint32_t DATA2      : 8;            /*!< (@ 0x00000010) DATA2                                                      */
      __IOM uint32_t DATA3      : 8;            /*!< (@ 0x00000018) DATA3                                                      */
    } bit;
  } CAN_TDL0R;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000018C) CAN_TDH0R                                                  */

    struct {
      __IOM uint32_t DATA4      : 8;            /*!< (@ 0x00000000) DATA4                                                      */
      __IOM uint32_t DATA5      : 8;            /*!< (@ 0x00000008) DATA5                                                      */
      __IOM uint32_t DATA6      : 8;            /*!< (@ 0x00000010) DATA6                                                      */
      __IOM uint32_t DATA7      : 8;            /*!< (@ 0x00000018) DATA7                                                      */
    } bit;
  } CAN_TDH0R;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000190) CAN_TI1R                                                   */

    struct {
      __IOM uint32_t TXRQ       : 1;            /*!< (@ 0x00000000) TXRQ                                                       */
      __IOM uint32_t RTR        : 1;            /*!< (@ 0x00000001) RTR                                                        */
      __IOM uint32_t IDE        : 1;            /*!< (@ 0x00000002) IDE                                                        */
      __IOM uint32_t EXID       : 18;           /*!< (@ 0x00000003) EXID                                                       */
      __IOM uint32_t STID       : 11;           /*!< (@ 0x00000015) STID                                                       */
    } bit;
  } CAN_TI1R;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000194) CAN_TDT1R                                                  */

    struct {
      __IOM uint32_t DLC        : 4;            /*!< (@ 0x00000000) DLC                                                        */
      __IM  uint32_t            : 4;
      __IOM uint32_t TGT        : 1;            /*!< (@ 0x00000008) TGT                                                        */
      __IM  uint32_t            : 7;
      __IOM uint32_t TIME       : 16;           /*!< (@ 0x00000010) TIME                                                       */
    } bit;
  } CAN_TDT1R;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000198) CAN_TDL1R                                                  */

