pointer-x/stm32f103c8_RCC_CMSIS_bitfields/CMSIS/stm32f103c8_bitfield.h
    struct {
      __IOM uint32_t DATA0      : 8;            /*!< (@ 0x00000000) DATA0                                                      */
      __IOM uint32_t DATA1      : 8;            /*!< (@ 0x00000008) DATA1                                                      */
      __IOM uint32_t DATA2      : 8;            /*!< (@ 0x00000010) DATA2                                                      */
      __IOM uint32_t DATA3      : 8;            /*!< (@ 0x00000018) DATA3                                                      */
    } bit;
  } CAN_TDL1R;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000019C) CAN_TDH1R                                                  */

    struct {
      __IOM uint32_t DATA4      : 8;            /*!< (@ 0x00000000) DATA4                                                      */
      __IOM uint32_t DATA5      : 8;            /*!< (@ 0x00000008) DATA5                                                      */
      __IOM uint32_t DATA6      : 8;            /*!< (@ 0x00000010) DATA6                                                      */
      __IOM uint32_t DATA7      : 8;            /*!< (@ 0x00000018) DATA7                                                      */
    } bit;
  } CAN_TDH1R;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000001A0) CAN_TI2R                                                   */

    struct {
      __IOM uint32_t TXRQ       : 1;            /*!< (@ 0x00000000) TXRQ                                                       */
      __IOM uint32_t RTR        : 1;            /*!< (@ 0x00000001) RTR                                                        */
      __IOM uint32_t IDE        : 1;            /*!< (@ 0x00000002) IDE                                                        */
      __IOM uint32_t EXID       : 18;           /*!< (@ 0x00000003) EXID                                                       */
      __IOM uint32_t STID       : 11;           /*!< (@ 0x00000015) STID                                                       */
    } bit;
  } CAN_TI2R;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000001A4) CAN_TDT2R                                                  */

    struct {
      __IOM uint32_t DLC        : 4;            /*!< (@ 0x00000000) DLC                                                        */
      __IM  uint32_t            : 4;
      __IOM uint32_t TGT        : 1;            /*!< (@ 0x00000008) TGT                                                        */
      __IM  uint32_t            : 7;
      __IOM uint32_t TIME       : 16;           /*!< (@ 0x00000010) TIME                                                       */
    } bit;
  } CAN_TDT2R;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000001A8) CAN_TDL2R                                                  */

    struct {
      __IOM uint32_t DATA0      : 8;            /*!< (@ 0x00000000) DATA0                                                      */
      __IOM uint32_t DATA1      : 8;            /*!< (@ 0x00000008) DATA1                                                      */
      __IOM uint32_t DATA2      : 8;            /*!< (@ 0x00000010) DATA2                                                      */
      __IOM uint32_t DATA3      : 8;            /*!< (@ 0x00000018) DATA3                                                      */
    } bit;
  } CAN_TDL2R;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000001AC) CAN_TDH2R                                                  */

    struct {
      __IOM uint32_t DATA4      : 8;            /*!< (@ 0x00000000) DATA4                                                      */
      __IOM uint32_t DATA5      : 8;            /*!< (@ 0x00000008) DATA5                                                      */
      __IOM uint32_t DATA6      : 8;            /*!< (@ 0x00000010) DATA6                                                      */
      __IOM uint32_t DATA7      : 8;            /*!< (@ 0x00000018) DATA7                                                      */
    } bit;
  } CAN_TDH2R;

  union {
    __IM  uint32_t reg;                         /*!< (@ 0x000001B0) CAN_RI0R                                                   */

    struct {
      __IM  uint32_t            : 1;
      __IM  uint32_t RTR        : 1;            /*!< (@ 0x00000001) RTR                                                        */
      __IM  uint32_t IDE        : 1;            /*!< (@ 0x00000002) IDE                                                        */
      __IM  uint32_t EXID       : 18;           /*!< (@ 0x00000003) EXID                                                       */
      __IM  uint32_t STID       : 11;           /*!< (@ 0x00000015) STID                                                       */
    } bit;
  } CAN_RI0R;

  union {
    __IM  uint32_t reg;                         /*!< (@ 0x000001B4) CAN_RDT0R                                                  */

    struct {
      __IM  uint32_t DLC        : 4;            /*!< (@ 0x00000000) DLC                                                        */
      __IM  uint32_t            : 4;
      __IM  uint32_t FMI        : 8;            /*!< (@ 0x00000008) FMI                                                        */
      __IM  uint32_t TIME       : 16;           /*!< (@ 0x00000010) TIME                                                       */
    } bit;
  } CAN_RDT0R;

  union {
    __IM  uint32_t reg;                         /*!< (@ 0x000001B8) CAN_RDL0R                                                  */

    struct {
      __IM  uint32_t DATA0      : 8;            /*!< (@ 0x00000000) DATA0                                                      */
      __IM  uint32_t DATA1      : 8;            /*!< (@ 0x00000008) DATA1                                                      */
      __IM  uint32_t DATA2      : 8;            /*!< (@ 0x00000010) DATA2                                                      */
      __IM  uint32_t DATA3      : 8;            /*!< (@ 0x00000018) DATA3                                                      */
    } bit;
  } CAN_RDL0R;

  union {
    __IM  uint32_t reg;                         /*!< (@ 0x000001BC) CAN_RDH0R                                                  */

