pointer-x/stm32f103c8_RCC_CMSIS_bitfields/CMSIS/stm32f103c8_bitfield.h
    struct {
      __IM  uint32_t DATA4      : 8;            /*!< (@ 0x00000000) DATA4                                                      */
      __IM  uint32_t DATA5      : 8;            /*!< (@ 0x00000008) DATA5                                                      */
      __IM  uint32_t DATA6      : 8;            /*!< (@ 0x00000010) DATA6                                                      */
      __IM  uint32_t DATA7      : 8;            /*!< (@ 0x00000018) DATA7                                                      */
    } bit;
  } CAN_RDH0R;

  union {
    __IM  uint32_t reg;                         /*!< (@ 0x000001C0) CAN_RI1R                                                   */

    struct {
      __IM  uint32_t            : 1;
      __IM  uint32_t RTR        : 1;            /*!< (@ 0x00000001) RTR                                                        */
      __IM  uint32_t IDE        : 1;            /*!< (@ 0x00000002) IDE                                                        */
      __IM  uint32_t EXID       : 18;           /*!< (@ 0x00000003) EXID                                                       */
      __IM  uint32_t STID       : 11;           /*!< (@ 0x00000015) STID                                                       */
    } bit;
  } CAN_RI1R;

  union {
    __IM  uint32_t reg;                         /*!< (@ 0x000001C4) CAN_RDT1R                                                  */

    struct {
      __IM  uint32_t DLC        : 4;            /*!< (@ 0x00000000) DLC                                                        */
      __IM  uint32_t            : 4;
      __IM  uint32_t FMI        : 8;            /*!< (@ 0x00000008) FMI                                                        */
      __IM  uint32_t TIME       : 16;           /*!< (@ 0x00000010) TIME                                                       */
    } bit;
  } CAN_RDT1R;

  union {
    __IM  uint32_t reg;                         /*!< (@ 0x000001C8) CAN_RDL1R                                                  */

    struct {
      __IM  uint32_t DATA0      : 8;            /*!< (@ 0x00000000) DATA0                                                      */
      __IM  uint32_t DATA1      : 8;            /*!< (@ 0x00000008) DATA1                                                      */
      __IM  uint32_t DATA2      : 8;            /*!< (@ 0x00000010) DATA2                                                      */
      __IM  uint32_t DATA3      : 8;            /*!< (@ 0x00000018) DATA3                                                      */
    } bit;
  } CAN_RDL1R;

  union {
    __IM  uint32_t reg;                         /*!< (@ 0x000001CC) CAN_RDH1R                                                  */

    struct {
      __IM  uint32_t DATA4      : 8;            /*!< (@ 0x00000000) DATA4                                                      */
      __IM  uint32_t DATA5      : 8;            /*!< (@ 0x00000008) DATA5                                                      */
      __IM  uint32_t DATA6      : 8;            /*!< (@ 0x00000010) DATA6                                                      */
      __IM  uint32_t DATA7      : 8;            /*!< (@ 0x00000018) DATA7                                                      */
    } bit;
  } CAN_RDH1R;
  __IM  uint32_t  RESERVED1[12];

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000200) CAN_FMR                                                    */

    struct {
      __IOM uint32_t FINIT      : 1;            /*!< (@ 0x00000000) FINIT                                                      */
    } bit;
  } CAN_FMR;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000204) CAN_FM1R                                                   */

    struct {
      __IOM uint32_t FBM0       : 1;            /*!< (@ 0x00000000) Filter mode                                                */
      __IOM uint32_t FBM1       : 1;            /*!< (@ 0x00000001) Filter mode                                                */
      __IOM uint32_t FBM2       : 1;            /*!< (@ 0x00000002) Filter mode                                                */
      __IOM uint32_t FBM3       : 1;            /*!< (@ 0x00000003) Filter mode                                                */
      __IOM uint32_t FBM4       : 1;            /*!< (@ 0x00000004) Filter mode                                                */
      __IOM uint32_t FBM5       : 1;            /*!< (@ 0x00000005) Filter mode                                                */
      __IOM uint32_t FBM6       : 1;            /*!< (@ 0x00000006) Filter mode                                                */
      __IOM uint32_t FBM7       : 1;            /*!< (@ 0x00000007) Filter mode                                                */
      __IOM uint32_t FBM8       : 1;            /*!< (@ 0x00000008) Filter mode                                                */
      __IOM uint32_t FBM9       : 1;            /*!< (@ 0x00000009) Filter mode                                                */
      __IOM uint32_t FBM10      : 1;            /*!< (@ 0x0000000A) Filter mode                                                */
      __IOM uint32_t FBM11      : 1;            /*!< (@ 0x0000000B) Filter mode                                                */
      __IOM uint32_t FBM12      : 1;            /*!< (@ 0x0000000C) Filter mode                                                */
      __IOM uint32_t FBM13      : 1;            /*!< (@ 0x0000000D) Filter mode                                                */
    } bit;
  } CAN_FM1R;
  __IM  uint32_t  RESERVED2;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000020C) CAN_FS1R                                                   */

    struct {
      __IOM uint32_t FSC0       : 1;            /*!< (@ 0x00000000) Filter scale configuration                                 */
      __IOM uint32_t FSC1       : 1;            /*!< (@ 0x00000001) Filter scale configuration                                 */
      __IOM uint32_t FSC2       : 1;            /*!< (@ 0x00000002) Filter scale configuration                                 */
      __IOM uint32_t FSC3       : 1;            /*!< (@ 0x00000003) Filter scale configuration                                 */
      __IOM uint32_t FSC4       : 1;            /*!< (@ 0x00000004) Filter scale configuration                                 */
      __IOM uint32_t FSC5       : 1;            /*!< (@ 0x00000005) Filter scale configuration                                 */
      __IOM uint32_t FSC6       : 1;            /*!< (@ 0x00000006) Filter scale configuration                                 */
      __IOM uint32_t FSC7       : 1;            /*!< (@ 0x00000007) Filter scale configuration                                 */
      __IOM uint32_t FSC8       : 1;            /*!< (@ 0x00000008) Filter scale configuration                                 */
      __IOM uint32_t FSC9       : 1;            /*!< (@ 0x00000009) Filter scale configuration                                 */
      __IOM uint32_t FSC10      : 1;            /*!< (@ 0x0000000A) Filter scale configuration                                 */
      __IOM uint32_t FSC11      : 1;            /*!< (@ 0x0000000B) Filter scale configuration                                 */
      __IOM uint32_t FSC12      : 1;            /*!< (@ 0x0000000C) Filter scale configuration                                 */
      __IOM uint32_t FSC13      : 1;            /*!< (@ 0x0000000D) Filter scale configuration                                 */
    } bit;
  } CAN_FS1R;
  __IM  uint32_t  RESERVED3;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000214) CAN_FFA1R                                                  */

