pointer-x/stm32f103c8_RCC_CMSIS_bitfields/CMSIS/stm32f103c8_bitfield.h
    struct {
      __IOM uint32_t FFA0       : 1;            /*!< (@ 0x00000000) Filter FIFO assignment for filter 0                        */
      __IOM uint32_t FFA1       : 1;            /*!< (@ 0x00000001) Filter FIFO assignment for filter 1                        */
      __IOM uint32_t FFA2       : 1;            /*!< (@ 0x00000002) Filter FIFO assignment for filter 2                        */
      __IOM uint32_t FFA3       : 1;            /*!< (@ 0x00000003) Filter FIFO assignment for filter 3                        */
      __IOM uint32_t FFA4       : 1;            /*!< (@ 0x00000004) Filter FIFO assignment for filter 4                        */
      __IOM uint32_t FFA5       : 1;            /*!< (@ 0x00000005) Filter FIFO assignment for filter 5                        */
      __IOM uint32_t FFA6       : 1;            /*!< (@ 0x00000006) Filter FIFO assignment for filter 6                        */
      __IOM uint32_t FFA7       : 1;            /*!< (@ 0x00000007) Filter FIFO assignment for filter 7                        */
      __IOM uint32_t FFA8       : 1;            /*!< (@ 0x00000008) Filter FIFO assignment for filter 8                        */
      __IOM uint32_t FFA9       : 1;            /*!< (@ 0x00000009) Filter FIFO assignment for filter 9                        */
      __IOM uint32_t FFA10      : 1;            /*!< (@ 0x0000000A) Filter FIFO assignment for filter 10                       */
      __IOM uint32_t FFA11      : 1;            /*!< (@ 0x0000000B) Filter FIFO assignment for filter 11                       */
      __IOM uint32_t FFA12      : 1;            /*!< (@ 0x0000000C) Filter FIFO assignment for filter 12                       */
      __IOM uint32_t FFA13      : 1;            /*!< (@ 0x0000000D) Filter FIFO assignment for filter 13                       */
    } bit;
  } CAN_FFA1R;
  __IM  uint32_t  RESERVED4;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000021C) CAN_FA1R                                                   */

    struct {
      __IOM uint32_t FACT0      : 1;            /*!< (@ 0x00000000) Filter active                                              */
      __IOM uint32_t FACT1      : 1;            /*!< (@ 0x00000001) Filter active                                              */
      __IOM uint32_t FACT2      : 1;            /*!< (@ 0x00000002) Filter active                                              */
      __IOM uint32_t FACT3      : 1;            /*!< (@ 0x00000003) Filter active                                              */
      __IOM uint32_t FACT4      : 1;            /*!< (@ 0x00000004) Filter active                                              */
      __IOM uint32_t FACT5      : 1;            /*!< (@ 0x00000005) Filter active                                              */
      __IOM uint32_t FACT6      : 1;            /*!< (@ 0x00000006) Filter active                                              */
      __IOM uint32_t FACT7      : 1;            /*!< (@ 0x00000007) Filter active                                              */
      __IOM uint32_t FACT8      : 1;            /*!< (@ 0x00000008) Filter active                                              */
      __IOM uint32_t FACT9      : 1;            /*!< (@ 0x00000009) Filter active                                              */
      __IOM uint32_t FACT10     : 1;            /*!< (@ 0x0000000A) Filter active                                              */
      __IOM uint32_t FACT11     : 1;            /*!< (@ 0x0000000B) Filter active                                              */
      __IOM uint32_t FACT12     : 1;            /*!< (@ 0x0000000C) Filter active                                              */
      __IOM uint32_t FACT13     : 1;            /*!< (@ 0x0000000D) Filter active                                              */
    } bit;
  } CAN_FA1R;
  __IM  uint32_t  RESERVED5[8];

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000240) Filter bank 0 register 1                                   */

    struct {
      __IOM uint32_t FB0        : 1;            /*!< (@ 0x00000000) Filter bits                                                */
      __IOM uint32_t FB1        : 1;            /*!< (@ 0x00000001) Filter bits                                                */
      __IOM uint32_t FB2        : 1;            /*!< (@ 0x00000002) Filter bits                                                */
      __IOM uint32_t FB3        : 1;            /*!< (@ 0x00000003) Filter bits                                                */
      __IOM uint32_t FB4        : 1;            /*!< (@ 0x00000004) Filter bits                                                */
      __IOM uint32_t FB5        : 1;            /*!< (@ 0x00000005) Filter bits                                                */
      __IOM uint32_t FB6        : 1;            /*!< (@ 0x00000006) Filter bits                                                */
      __IOM uint32_t FB7        : 1;            /*!< (@ 0x00000007) Filter bits                                                */
      __IOM uint32_t FB8        : 1;            /*!< (@ 0x00000008) Filter bits                                                */
      __IOM uint32_t FB9        : 1;            /*!< (@ 0x00000009) Filter bits                                                */
      __IOM uint32_t FB10       : 1;            /*!< (@ 0x0000000A) Filter bits                                                */
      __IOM uint32_t FB11       : 1;            /*!< (@ 0x0000000B) Filter bits                                                */
      __IOM uint32_t FB12       : 1;            /*!< (@ 0x0000000C) Filter bits                                                */
      __IOM uint32_t FB13       : 1;            /*!< (@ 0x0000000D) Filter bits                                                */
      __IOM uint32_t FB14       : 1;            /*!< (@ 0x0000000E) Filter bits                                                */
      __IOM uint32_t FB15       : 1;            /*!< (@ 0x0000000F) Filter bits                                                */
      __IOM uint32_t FB16       : 1;            /*!< (@ 0x00000010) Filter bits                                                */
      __IOM uint32_t FB17       : 1;            /*!< (@ 0x00000011) Filter bits                                                */
      __IOM uint32_t FB18       : 1;            /*!< (@ 0x00000012) Filter bits                                                */
      __IOM uint32_t FB19       : 1;            /*!< (@ 0x00000013) Filter bits                                                */
      __IOM uint32_t FB20       : 1;            /*!< (@ 0x00000014) Filter bits                                                */
      __IOM uint32_t FB21       : 1;            /*!< (@ 0x00000015) Filter bits                                                */
      __IOM uint32_t FB22       : 1;            /*!< (@ 0x00000016) Filter bits                                                */
      __IOM uint32_t FB23       : 1;            /*!< (@ 0x00000017) Filter bits                                                */
      __IOM uint32_t FB24       : 1;            /*!< (@ 0x00000018) Filter bits                                                */
      __IOM uint32_t FB25       : 1;            /*!< (@ 0x00000019) Filter bits                                                */
      __IOM uint32_t FB26       : 1;            /*!< (@ 0x0000001A) Filter bits                                                */
      __IOM uint32_t FB27       : 1;            /*!< (@ 0x0000001B) Filter bits                                                */
      __IOM uint32_t FB28       : 1;            /*!< (@ 0x0000001C) Filter bits                                                */
      __IOM uint32_t FB29       : 1;            /*!< (@ 0x0000001D) Filter bits                                                */
      __IOM uint32_t FB30       : 1;            /*!< (@ 0x0000001E) Filter bits                                                */
      __IOM uint32_t FB31       : 1;            /*!< (@ 0x0000001F) Filter bits                                                */
    } bit;
  } F0R1;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000244) Filter bank 0 register 2                                   */

