pointer-x/stm32f103c8_RCC_CMSIS_bitfields/CMSIS/stm32f103c8_bitfield.h
    struct {
      __IOM uint32_t FB0        : 1;            /*!< (@ 0x00000000) Filter bits                                                */
      __IOM uint32_t FB1        : 1;            /*!< (@ 0x00000001) Filter bits                                                */
      __IOM uint32_t FB2        : 1;            /*!< (@ 0x00000002) Filter bits                                                */
      __IOM uint32_t FB3        : 1;            /*!< (@ 0x00000003) Filter bits                                                */
      __IOM uint32_t FB4        : 1;            /*!< (@ 0x00000004) Filter bits                                                */
      __IOM uint32_t FB5        : 1;            /*!< (@ 0x00000005) Filter bits                                                */
      __IOM uint32_t FB6        : 1;            /*!< (@ 0x00000006) Filter bits                                                */
      __IOM uint32_t FB7        : 1;            /*!< (@ 0x00000007) Filter bits                                                */
      __IOM uint32_t FB8        : 1;            /*!< (@ 0x00000008) Filter bits                                                */
      __IOM uint32_t FB9        : 1;            /*!< (@ 0x00000009) Filter bits                                                */
      __IOM uint32_t FB10       : 1;            /*!< (@ 0x0000000A) Filter bits                                                */
      __IOM uint32_t FB11       : 1;            /*!< (@ 0x0000000B) Filter bits                                                */
      __IOM uint32_t FB12       : 1;            /*!< (@ 0x0000000C) Filter bits                                                */
      __IOM uint32_t FB13       : 1;            /*!< (@ 0x0000000D) Filter bits                                                */
      __IOM uint32_t FB14       : 1;            /*!< (@ 0x0000000E) Filter bits                                                */
      __IOM uint32_t FB15       : 1;            /*!< (@ 0x0000000F) Filter bits                                                */
      __IOM uint32_t FB16       : 1;            /*!< (@ 0x00000010) Filter bits                                                */
      __IOM uint32_t FB17       : 1;            /*!< (@ 0x00000011) Filter bits                                                */
      __IOM uint32_t FB18       : 1;            /*!< (@ 0x00000012) Filter bits                                                */
      __IOM uint32_t FB19       : 1;            /*!< (@ 0x00000013) Filter bits                                                */
      __IOM uint32_t FB20       : 1;            /*!< (@ 0x00000014) Filter bits                                                */
      __IOM uint32_t FB21       : 1;            /*!< (@ 0x00000015) Filter bits                                                */
      __IOM uint32_t FB22       : 1;            /*!< (@ 0x00000016) Filter bits                                                */
      __IOM uint32_t FB23       : 1;            /*!< (@ 0x00000017) Filter bits                                                */
      __IOM uint32_t FB24       : 1;            /*!< (@ 0x00000018) Filter bits                                                */
      __IOM uint32_t FB25       : 1;            /*!< (@ 0x00000019) Filter bits                                                */
      __IOM uint32_t FB26       : 1;            /*!< (@ 0x0000001A) Filter bits                                                */
      __IOM uint32_t FB27       : 1;            /*!< (@ 0x0000001B) Filter bits                                                */
      __IOM uint32_t FB28       : 1;            /*!< (@ 0x0000001C) Filter bits                                                */
      __IOM uint32_t FB29       : 1;            /*!< (@ 0x0000001D) Filter bits                                                */
      __IOM uint32_t FB30       : 1;            /*!< (@ 0x0000001E) Filter bits                                                */
      __IOM uint32_t FB31       : 1;            /*!< (@ 0x0000001F) Filter bits                                                */
    } bit;
  } F4R2;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000268) Filter bank 5 register 1                                   */

    struct {
      __IOM uint32_t FB0        : 1;            /*!< (@ 0x00000000) Filter bits                                                */
      __IOM uint32_t FB1        : 1;            /*!< (@ 0x00000001) Filter bits                                                */
      __IOM uint32_t FB2        : 1;            /*!< (@ 0x00000002) Filter bits                                                */
      __IOM uint32_t FB3        : 1;            /*!< (@ 0x00000003) Filter bits                                                */
      __IOM uint32_t FB4        : 1;            /*!< (@ 0x00000004) Filter bits                                                */
      __IOM uint32_t FB5        : 1;            /*!< (@ 0x00000005) Filter bits                                                */
      __IOM uint32_t FB6        : 1;            /*!< (@ 0x00000006) Filter bits                                                */
      __IOM uint32_t FB7        : 1;            /*!< (@ 0x00000007) Filter bits                                                */
      __IOM uint32_t FB8        : 1;            /*!< (@ 0x00000008) Filter bits                                                */
      __IOM uint32_t FB9        : 1;            /*!< (@ 0x00000009) Filter bits                                                */
      __IOM uint32_t FB10       : 1;            /*!< (@ 0x0000000A) Filter bits                                                */
      __IOM uint32_t FB11       : 1;            /*!< (@ 0x0000000B) Filter bits                                                */
      __IOM uint32_t FB12       : 1;            /*!< (@ 0x0000000C) Filter bits                                                */
      __IOM uint32_t FB13       : 1;            /*!< (@ 0x0000000D) Filter bits                                                */
      __IOM uint32_t FB14       : 1;            /*!< (@ 0x0000000E) Filter bits                                                */
      __IOM uint32_t FB15       : 1;            /*!< (@ 0x0000000F) Filter bits                                                */
      __IOM uint32_t FB16       : 1;            /*!< (@ 0x00000010) Filter bits                                                */
      __IOM uint32_t FB17       : 1;            /*!< (@ 0x00000011) Filter bits                                                */
      __IOM uint32_t FB18       : 1;            /*!< (@ 0x00000012) Filter bits                                                */
      __IOM uint32_t FB19       : 1;            /*!< (@ 0x00000013) Filter bits                                                */
      __IOM uint32_t FB20       : 1;            /*!< (@ 0x00000014) Filter bits                                                */
      __IOM uint32_t FB21       : 1;            /*!< (@ 0x00000015) Filter bits                                                */
      __IOM uint32_t FB22       : 1;            /*!< (@ 0x00000016) Filter bits                                                */
      __IOM uint32_t FB23       : 1;            /*!< (@ 0x00000017) Filter bits                                                */
      __IOM uint32_t FB24       : 1;            /*!< (@ 0x00000018) Filter bits                                                */
      __IOM uint32_t FB25       : 1;            /*!< (@ 0x00000019) Filter bits                                                */
      __IOM uint32_t FB26       : 1;            /*!< (@ 0x0000001A) Filter bits                                                */
      __IOM uint32_t FB27       : 1;            /*!< (@ 0x0000001B) Filter bits                                                */
      __IOM uint32_t FB28       : 1;            /*!< (@ 0x0000001C) Filter bits                                                */
      __IOM uint32_t FB29       : 1;            /*!< (@ 0x0000001D) Filter bits                                                */
      __IOM uint32_t FB30       : 1;            /*!< (@ 0x0000001E) Filter bits                                                */
      __IOM uint32_t FB31       : 1;            /*!< (@ 0x0000001F) Filter bits                                                */
    } bit;
  } F5R1;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000026C) Filter bank 5 register 2                                   */

