pointer-x/stm32f103c8_RCC_CMSIS_bitfields/CMSIS/stm32f103c8_bitfield.h
    struct {
      __IOM uint32_t FB0        : 1;            /*!< (@ 0x00000000) Filter bits                                                */
      __IOM uint32_t FB1        : 1;            /*!< (@ 0x00000001) Filter bits                                                */
      __IOM uint32_t FB2        : 1;            /*!< (@ 0x00000002) Filter bits                                                */
      __IOM uint32_t FB3        : 1;            /*!< (@ 0x00000003) Filter bits                                                */
      __IOM uint32_t FB4        : 1;            /*!< (@ 0x00000004) Filter bits                                                */
      __IOM uint32_t FB5        : 1;            /*!< (@ 0x00000005) Filter bits                                                */
      __IOM uint32_t FB6        : 1;            /*!< (@ 0x00000006) Filter bits                                                */
      __IOM uint32_t FB7        : 1;            /*!< (@ 0x00000007) Filter bits                                                */
      __IOM uint32_t FB8        : 1;            /*!< (@ 0x00000008) Filter bits                                                */
      __IOM uint32_t FB9        : 1;            /*!< (@ 0x00000009) Filter bits                                                */
      __IOM uint32_t FB10       : 1;            /*!< (@ 0x0000000A) Filter bits                                                */
      __IOM uint32_t FB11       : 1;            /*!< (@ 0x0000000B) Filter bits                                                */
      __IOM uint32_t FB12       : 1;            /*!< (@ 0x0000000C) Filter bits                                                */
      __IOM uint32_t FB13       : 1;            /*!< (@ 0x0000000D) Filter bits                                                */
      __IOM uint32_t FB14       : 1;            /*!< (@ 0x0000000E) Filter bits                                                */
      __IOM uint32_t FB15       : 1;            /*!< (@ 0x0000000F) Filter bits                                                */
      __IOM uint32_t FB16       : 1;            /*!< (@ 0x00000010) Filter bits                                                */
      __IOM uint32_t FB17       : 1;            /*!< (@ 0x00000011) Filter bits                                                */
      __IOM uint32_t FB18       : 1;            /*!< (@ 0x00000012) Filter bits                                                */
      __IOM uint32_t FB19       : 1;            /*!< (@ 0x00000013) Filter bits                                                */
      __IOM uint32_t FB20       : 1;            /*!< (@ 0x00000014) Filter bits                                                */
      __IOM uint32_t FB21       : 1;            /*!< (@ 0x00000015) Filter bits                                                */
      __IOM uint32_t FB22       : 1;            /*!< (@ 0x00000016) Filter bits                                                */
      __IOM uint32_t FB23       : 1;            /*!< (@ 0x00000017) Filter bits                                                */
      __IOM uint32_t FB24       : 1;            /*!< (@ 0x00000018) Filter bits                                                */
      __IOM uint32_t FB25       : 1;            /*!< (@ 0x00000019) Filter bits                                                */
      __IOM uint32_t FB26       : 1;            /*!< (@ 0x0000001A) Filter bits                                                */
      __IOM uint32_t FB27       : 1;            /*!< (@ 0x0000001B) Filter bits                                                */
      __IOM uint32_t FB28       : 1;            /*!< (@ 0x0000001C) Filter bits                                                */
      __IOM uint32_t FB29       : 1;            /*!< (@ 0x0000001D) Filter bits                                                */
      __IOM uint32_t FB30       : 1;            /*!< (@ 0x0000001E) Filter bits                                                */
      __IOM uint32_t FB31       : 1;            /*!< (@ 0x0000001F) Filter bits                                                */
    } bit;
  } F13R2;
} CAN_Type;                                     /*!< Size = 688 (0x2b0)                                                        */



/* =========================================================================================================================== */
/* ================                                            DAC                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Digital to analog converter (DAC)
  */

typedef struct {                                /*!< (@ 0x40007400) DAC Structure                                              */

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000000) Control register (DAC_CR)                                  */

    struct {
      __IOM uint32_t EN1        : 1;            /*!< (@ 0x00000000) DAC channel1 enable                                        */
      __IOM uint32_t BOFF1      : 1;            /*!< (@ 0x00000001) DAC channel1 output buffer disable                         */
      __IOM uint32_t TEN1       : 1;            /*!< (@ 0x00000002) DAC channel1 trigger enable                                */
      __IOM uint32_t TSEL1      : 3;            /*!< (@ 0x00000003) DAC channel1 trigger selection                             */
      __IOM uint32_t WAVE1      : 2;            /*!< (@ 0x00000006) DAC channel1 noise/triangle wave generation enable         */
      __IOM uint32_t MAMP1      : 4;            /*!< (@ 0x00000008) DAC channel1 mask/amplitude selector                       */
      __IOM uint32_t DMAEN1     : 1;            /*!< (@ 0x0000000C) DAC channel1 DMA enable                                    */
      __IM  uint32_t            : 3;
      __IOM uint32_t EN2        : 1;            /*!< (@ 0x00000010) DAC channel2 enable                                        */
      __IOM uint32_t BOFF2      : 1;            /*!< (@ 0x00000011) DAC channel2 output buffer disable                         */
      __IOM uint32_t TEN2       : 1;            /*!< (@ 0x00000012) DAC channel2 trigger enable                                */
      __IOM uint32_t TSEL2      : 3;            /*!< (@ 0x00000013) DAC channel2 trigger selection                             */
      __IOM uint32_t WAVE2      : 2;            /*!< (@ 0x00000016) DAC channel2 noise/triangle wave generation enable         */
      __IOM uint32_t MAMP2      : 4;            /*!< (@ 0x00000018) DAC channel2 mask/amplitude selector                       */
      __IOM uint32_t DMAEN2     : 1;            /*!< (@ 0x0000001C) DAC channel2 DMA enable                                    */
    } bit;
  } CR;

  union {
    __OM  uint32_t reg;                         /*!< (@ 0x00000004) DAC software trigger register (DAC_SWTRIGR)                */

