pointer-x/stm32f103c8_RCC_CMSIS_bitfields/CMSIS/stm32f103c8_bitfield.h
    struct {
      __OM  uint32_t SWTRIG1    : 1;            /*!< (@ 0x00000000) DAC channel1 software trigger                              */
      __OM  uint32_t SWTRIG2    : 1;            /*!< (@ 0x00000001) DAC channel2 software trigger                              */
    } bit;
  } SWTRIGR;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000008) DAC channel1 12-bit right-aligned data holding
                                                                    register(DAC_DHR12R1)                                      */

    struct {
      __IOM uint32_t DACC1DHR   : 12;           /*!< (@ 0x00000000) DAC channel1 12-bit right-aligned data                     */
    } bit;
  } DHR12R1;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000000C) DAC channel1 12-bit left aligned data holding
                                                                    register (DAC_DHR12L1)                                     */

    struct {
      __IM  uint32_t            : 4;
      __IOM uint32_t DACC1DHR   : 12;           /*!< (@ 0x00000004) DAC channel1 12-bit left-aligned data                      */
    } bit;
  } DHR12L1;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000010) DAC channel1 8-bit right aligned data holding
                                                                    register (DAC_DHR8R1)                                      */

    struct {
      __IOM uint32_t DACC1DHR   : 8;            /*!< (@ 0x00000000) DAC channel1 8-bit right-aligned data                      */
    } bit;
  } DHR8R1;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000014) DAC channel2 12-bit right aligned data holding
                                                                    register (DAC_DHR12R2)                                     */

    struct {
      __IOM uint32_t DACC2DHR   : 12;           /*!< (@ 0x00000000) DAC channel2 12-bit right-aligned data                     */
    } bit;
  } DHR12R2;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000018) DAC channel2 12-bit left aligned data holding
                                                                    register (DAC_DHR12L2)                                     */

    struct {
      __IM  uint32_t            : 4;
      __IOM uint32_t DACC2DHR   : 12;           /*!< (@ 0x00000004) DAC channel2 12-bit left-aligned data                      */
    } bit;
  } DHR12L2;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000001C) DAC channel2 8-bit right-aligned data holding
                                                                    register (DAC_DHR8R2)                                      */

    struct {
      __IOM uint32_t DACC2DHR   : 8;            /*!< (@ 0x00000000) DAC channel2 8-bit right-aligned data                      */
    } bit;
  } DHR8R2;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000020) Dual DAC 12-bit right-aligned data holding register
                                                                    (DAC_DHR12RD), Bits 31:28 Reserved, Bits
                                                                    15:12 Reserved                                             */

    struct {
      __IOM uint32_t DACC1DHR   : 12;           /*!< (@ 0x00000000) DAC channel1 12-bit right-aligned data                     */
      __IM  uint32_t            : 4;
      __IOM uint32_t DACC2DHR   : 12;           /*!< (@ 0x00000010) DAC channel2 12-bit right-aligned data                     */
    } bit;
  } DHR12RD;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000024) DUAL DAC 12-bit left aligned data holding register
                                                                    (DAC_DHR12LD), Bits 19:16 Reserved, Bits
                                                                    3:0 Reserved                                               */

    struct {
      __IM  uint32_t            : 4;
      __IOM uint32_t DACC1DHR   : 12;           /*!< (@ 0x00000004) DAC channel1 12-bit left-aligned data                      */
      __IM  uint32_t            : 4;
      __IOM uint32_t DACC2DHR   : 12;           /*!< (@ 0x00000014) DAC channel2 12-bit right-aligned data                     */
    } bit;
  } DHR12LD;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000028) DUAL DAC 8-bit right aligned data holding register
                                                                    (DAC_DHR8RD), Bits 31:16 Reserved                          */

    struct {
      __IOM uint32_t DACC1DHR   : 8;            /*!< (@ 0x00000000) DAC channel1 8-bit right-aligned data                      */
      __IOM uint32_t DACC2DHR   : 8;            /*!< (@ 0x00000008) DAC channel2 8-bit right-aligned data                      */
    } bit;
  } DHR8RD;

  union {
    __IM  uint32_t reg;                         /*!< (@ 0x0000002C) DAC channel1 data output register (DAC_DOR1)               */

    struct {
      __IM  uint32_t DACC1DOR   : 12;           /*!< (@ 0x00000000) DAC channel1 data output                                   */
    } bit;
  } DOR1;

  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000030) DAC channel2 data output register (DAC_DOR2)               */

    struct {
      __IM  uint32_t DACC2DOR   : 12;           /*!< (@ 0x00000000) DAC channel2 data output                                   */
    } bit;
  } DOR2;
} DAC_Type;                                     /*!< Size = 52 (0x34)                                                          */



/* =========================================================================================================================== */
/* ================                                            DBG                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Debug support (DBG)
  */

