pointer-x/stm32f103c8_RCC_CMSIS_bitfields/CMSIS/stm32f103c8_bitfield.h
typedef struct {                                /*!< (@ 0xE0042000) DBG Structure                                              */

  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000000) DBGMCU_IDCODE                                              */

    struct {
      __IM  uint32_t DEV_ID     : 12;           /*!< (@ 0x00000000) DEV_ID                                                     */
      __IM  uint32_t            : 4;
      __IM  uint32_t REV_ID     : 16;           /*!< (@ 0x00000010) REV_ID                                                     */
    } bit;
  } IDCODE;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000004) DBGMCU_CR                                                  */

    struct {
      __IOM uint32_t DBG_SLEEP  : 1;            /*!< (@ 0x00000000) DBG_SLEEP                                                  */
      __IOM uint32_t DBG_STOP   : 1;            /*!< (@ 0x00000001) DBG_STOP                                                   */
      __IOM uint32_t DBG_STANDBY : 1;           /*!< (@ 0x00000002) DBG_STANDBY                                                */
      __IM  uint32_t            : 2;
      __IOM uint32_t TRACE_IOEN : 1;            /*!< (@ 0x00000005) TRACE_IOEN                                                 */
      __IOM uint32_t TRACE_MODE : 2;            /*!< (@ 0x00000006) TRACE_MODE                                                 */
      __IOM uint32_t DBG_IWDG_STOP : 1;         /*!< (@ 0x00000008) DBG_IWDG_STOP                                              */
      __IOM uint32_t DBG_WWDG_STOP : 1;         /*!< (@ 0x00000009) DBG_WWDG_STOP                                              */
      __IOM uint32_t DBG_TIM1_STOP : 1;         /*!< (@ 0x0000000A) DBG_TIM1_STOP                                              */
      __IOM uint32_t DBG_TIM2_STOP : 1;         /*!< (@ 0x0000000B) DBG_TIM2_STOP                                              */
      __IOM uint32_t DBG_TIM3_STOP : 1;         /*!< (@ 0x0000000C) DBG_TIM3_STOP                                              */
      __IOM uint32_t DBG_TIM4_STOP : 1;         /*!< (@ 0x0000000D) DBG_TIM4_STOP                                              */
      __IOM uint32_t DBG_CAN1_STOP : 1;         /*!< (@ 0x0000000E) DBG_CAN1_STOP                                              */
      __IOM uint32_t DBG_I2C1_SMBUS_TIMEOUT : 1;/*!< (@ 0x0000000F) DBG_I2C1_SMBUS_TIMEOUT                                     */
      __IOM uint32_t DBG_I2C2_SMBUS_TIMEOUT : 1;/*!< (@ 0x00000010) DBG_I2C2_SMBUS_TIMEOUT                                     */
      __IOM uint32_t DBG_TIM8_STOP : 1;         /*!< (@ 0x00000011) DBG_TIM8_STOP                                              */
      __IOM uint32_t DBG_TIM5_STOP : 1;         /*!< (@ 0x00000012) DBG_TIM5_STOP                                              */
      __IOM uint32_t DBG_TIM6_STOP : 1;         /*!< (@ 0x00000013) DBG_TIM6_STOP                                              */
      __IOM uint32_t DBG_TIM7_STOP : 1;         /*!< (@ 0x00000014) DBG_TIM7_STOP                                              */
      __IOM uint32_t DBG_CAN2_STOP : 1;         /*!< (@ 0x00000015) DBG_CAN2_STOP                                              */
    } bit;
  } CR;
} DBG_Type;                                     /*!< Size = 8 (0x8)                                                            */



/* =========================================================================================================================== */
/* ================                                           UART4                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief Universal asynchronous receiver  transmitter (UART4)
  */

typedef struct {                                /*!< (@ 0x40004C00) UART4 Structure                                            */

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000000) UART4_SR                                                   */

    struct {
      __IM  uint32_t PE         : 1;            /*!< (@ 0x00000000) Parity error                                               */
      __IM  uint32_t FE         : 1;            /*!< (@ 0x00000001) Framing error                                              */
      __IM  uint32_t NE         : 1;            /*!< (@ 0x00000002) Noise error flag                                           */
      __IM  uint32_t ORE        : 1;            /*!< (@ 0x00000003) Overrun error                                              */
      __IM  uint32_t IDLE       : 1;            /*!< (@ 0x00000004) IDLE line detected                                         */
      __IOM uint32_t RXNE       : 1;            /*!< (@ 0x00000005) Read data register not empty                               */
      __IOM uint32_t TC         : 1;            /*!< (@ 0x00000006) Transmission complete                                      */
      __IM  uint32_t TXE        : 1;            /*!< (@ 0x00000007) Transmit data register empty                               */
      __IOM uint32_t LBD        : 1;            /*!< (@ 0x00000008) LIN break detection flag                                   */
    } bit;
  } SR;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000004) UART4_DR                                                   */

    struct {
      __IOM uint32_t DR         : 9;            /*!< (@ 0x00000000) DR                                                         */
    } bit;
  } DR;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000008) UART4_BRR                                                  */

    struct {
      __IOM uint32_t DIV_Fraction : 4;          /*!< (@ 0x00000000) DIV_Fraction                                               */
      __IOM uint32_t DIV_Mantissa : 12;         /*!< (@ 0x00000004) DIV_Mantissa                                               */
    } bit;
  } BRR;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000000C) UART4_CR1                                                  */

