pointer-x/stm32f103c8_RCC_CMSIS_bitfields/CMSIS/stm32f103c8_bitfield.h
    struct {
      __IOM uint32_t SBK        : 1;            /*!< (@ 0x00000000) Send break                                                 */
      __IOM uint32_t RWU        : 1;            /*!< (@ 0x00000001) Receiver wakeup                                            */
      __IOM uint32_t RE         : 1;            /*!< (@ 0x00000002) Receiver enable                                            */
      __IOM uint32_t TE         : 1;            /*!< (@ 0x00000003) Transmitter enable                                         */
      __IOM uint32_t IDLEIE     : 1;            /*!< (@ 0x00000004) IDLE interrupt enable                                      */
      __IOM uint32_t RXNEIE     : 1;            /*!< (@ 0x00000005) RXNE interrupt enable                                      */
      __IOM uint32_t TCIE       : 1;            /*!< (@ 0x00000006) Transmission complete interrupt enable                     */
      __IOM uint32_t TXEIE      : 1;            /*!< (@ 0x00000007) TXE interrupt enable                                       */
      __IOM uint32_t PEIE       : 1;            /*!< (@ 0x00000008) PE interrupt enable                                        */
      __IOM uint32_t PS         : 1;            /*!< (@ 0x00000009) Parity selection                                           */
      __IOM uint32_t PCE        : 1;            /*!< (@ 0x0000000A) Parity control enable                                      */
      __IOM uint32_t WAKE       : 1;            /*!< (@ 0x0000000B) Wakeup method                                              */
      __IOM uint32_t M          : 1;            /*!< (@ 0x0000000C) Word length                                                */
      __IOM uint32_t UE         : 1;            /*!< (@ 0x0000000D) USART enable                                               */
    } bit;
  } CR1;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000010) UART4_CR2                                                  */

    struct {
      __IOM uint32_t ADD        : 4;            /*!< (@ 0x00000000) Address of the USART node                                  */
      __IM  uint32_t            : 1;
      __IOM uint32_t LBDL       : 1;            /*!< (@ 0x00000005) lin break detection length                                 */
      __IOM uint32_t LBDIE      : 1;            /*!< (@ 0x00000006) LIN break detection interrupt enable                       */
      __IM  uint32_t            : 5;
      __IOM uint32_t STOP       : 2;            /*!< (@ 0x0000000C) STOP bits                                                  */
      __IOM uint32_t LINEN      : 1;            /*!< (@ 0x0000000E) LIN mode enable                                            */
    } bit;
  } CR2;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000014) UART4_CR3                                                  */

    struct {
      __IOM uint32_t EIE        : 1;            /*!< (@ 0x00000000) Error interrupt enable                                     */
      __IOM uint32_t IREN       : 1;            /*!< (@ 0x00000001) IrDA mode enable                                           */
      __IOM uint32_t IRLP       : 1;            /*!< (@ 0x00000002) IrDA low-power                                             */
      __IOM uint32_t HDSEL      : 1;            /*!< (@ 0x00000003) Half-duplex selection                                      */
      __IM  uint32_t            : 2;
      __IOM uint32_t DMAR       : 1;            /*!< (@ 0x00000006) DMA enable receiver                                        */
      __IOM uint32_t DMAT       : 1;            /*!< (@ 0x00000007) DMA enable transmitter                                     */
    } bit;
  } CR3;
} UART4_Type;                                   /*!< Size = 24 (0x18)                                                          */



/* =========================================================================================================================== */
/* ================                                           UART5                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief Universal asynchronous receiver  transmitter (UART5)
  */

typedef struct {                                /*!< (@ 0x40005000) UART5 Structure                                            */

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000000) UART4_SR                                                   */

    struct {
      __IM  uint32_t PE         : 1;            /*!< (@ 0x00000000) PE                                                         */
      __IM  uint32_t FE         : 1;            /*!< (@ 0x00000001) FE                                                         */
      __IM  uint32_t NE         : 1;            /*!< (@ 0x00000002) NE                                                         */
      __IM  uint32_t ORE        : 1;            /*!< (@ 0x00000003) ORE                                                        */
      __IM  uint32_t IDLE       : 1;            /*!< (@ 0x00000004) IDLE                                                       */
      __IOM uint32_t RXNE       : 1;            /*!< (@ 0x00000005) RXNE                                                       */
      __IOM uint32_t TC         : 1;            /*!< (@ 0x00000006) TC                                                         */
      __IM  uint32_t TXE        : 1;            /*!< (@ 0x00000007) TXE                                                        */
      __IOM uint32_t LBD        : 1;            /*!< (@ 0x00000008) LBD                                                        */
    } bit;
  } SR;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000004) UART4_DR                                                   */

    struct {
      __IOM uint32_t DR         : 9;            /*!< (@ 0x00000000) DR                                                         */
    } bit;
  } DR;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000008) UART4_BRR                                                  */

