pointer-x/stm32f103c8_RCC_CMSIS_bitfields/CMSIS/stm32f103c8_bitfield.h
    struct {
      __IOM uint32_t DIV_Fraction : 4;          /*!< (@ 0x00000000) DIV_Fraction                                               */
      __IOM uint32_t DIV_Mantissa : 12;         /*!< (@ 0x00000004) DIV_Mantissa                                               */
    } bit;
  } BRR;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000000C) UART4_CR1                                                  */

    struct {
      __IOM uint32_t SBK        : 1;            /*!< (@ 0x00000000) SBK                                                        */
      __IOM uint32_t RWU        : 1;            /*!< (@ 0x00000001) RWU                                                        */
      __IOM uint32_t RE         : 1;            /*!< (@ 0x00000002) RE                                                         */
      __IOM uint32_t TE         : 1;            /*!< (@ 0x00000003) TE                                                         */
      __IOM uint32_t IDLEIE     : 1;            /*!< (@ 0x00000004) IDLEIE                                                     */
      __IOM uint32_t RXNEIE     : 1;            /*!< (@ 0x00000005) RXNEIE                                                     */
      __IOM uint32_t TCIE       : 1;            /*!< (@ 0x00000006) TCIE                                                       */
      __IOM uint32_t TXEIE      : 1;            /*!< (@ 0x00000007) TXEIE                                                      */
      __IOM uint32_t PEIE       : 1;            /*!< (@ 0x00000008) PEIE                                                       */
      __IOM uint32_t PS         : 1;            /*!< (@ 0x00000009) PS                                                         */
      __IOM uint32_t PCE        : 1;            /*!< (@ 0x0000000A) PCE                                                        */
      __IOM uint32_t WAKE       : 1;            /*!< (@ 0x0000000B) WAKE                                                       */
      __IOM uint32_t M          : 1;            /*!< (@ 0x0000000C) M                                                          */
      __IOM uint32_t UE         : 1;            /*!< (@ 0x0000000D) UE                                                         */
    } bit;
  } CR1;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000010) UART4_CR2                                                  */

    struct {
      __IOM uint32_t ADD        : 4;            /*!< (@ 0x00000000) ADD                                                        */
      __IM  uint32_t            : 1;
      __IOM uint32_t LBDL       : 1;            /*!< (@ 0x00000005) LBDL                                                       */
      __IOM uint32_t LBDIE      : 1;            /*!< (@ 0x00000006) LBDIE                                                      */
      __IM  uint32_t            : 5;
      __IOM uint32_t STOP       : 2;            /*!< (@ 0x0000000C) STOP                                                       */
      __IOM uint32_t LINEN      : 1;            /*!< (@ 0x0000000E) LINEN                                                      */
    } bit;
  } CR2;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000014) UART4_CR3                                                  */

    struct {
      __IOM uint32_t EIE        : 1;            /*!< (@ 0x00000000) Error interrupt enable                                     */
      __IOM uint32_t IREN       : 1;            /*!< (@ 0x00000001) IrDA mode enable                                           */
      __IOM uint32_t IRLP       : 1;            /*!< (@ 0x00000002) IrDA low-power                                             */
      __IOM uint32_t HDSEL      : 1;            /*!< (@ 0x00000003) Half-duplex selection                                      */
      __IM  uint32_t            : 3;
      __IOM uint32_t DMAT       : 1;            /*!< (@ 0x00000007) DMA enable transmitter                                     */
    } bit;
  } CR3;
} UART5_Type;                                   /*!< Size = 24 (0x18)                                                          */



/* =========================================================================================================================== */
/* ================                                            CRC                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief CRC calculation unit (CRC)
  */

typedef struct {                                /*!< (@ 0x40023000) CRC Structure                                              */

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000000) Data register                                              */

    struct {
      __IOM uint32_t DR         : 32;           /*!< (@ 0x00000000) Data Register                                              */
    } bit;
  } DR;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000004) Independent Data register                                  */

    struct {
      __IOM uint32_t IDR        : 8;            /*!< (@ 0x00000000) Independent Data register                                  */
    } bit;
  } IDR;

  union {
    __OM  uint32_t reg;                         /*!< (@ 0x00000008) Control register                                           */

    struct {
      __OM  uint32_t RESET      : 1;            /*!< (@ 0x00000000) Reset bit                                                  */
    } bit;
  } CR;
} CRC_Type;                                     /*!< Size = 12 (0xc)                                                           */



/* =========================================================================================================================== */
/* ================                                           FLASH                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief FLASH (FLASH)
  */
typedef struct {                                /*!< (@ 0x40022000) FLASH Structure                                            */

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000000) Flash access control register                              */

