pointer-x/stm32f103c8_RCC_CMSIS_bitfields/CMSIS/stm32f103c8_bitfield.h
    struct {
      __IOM uint32_t LATENCY    : 3 ;            /*!< (@ 0x00000000) Latency                                                    */
      __IOM uint32_t HLFCYA     : 1 ;            /*!< (@ 0x00000003) Flash half cycle access enable                             */
      __IOM uint32_t PRFTBE     : 1 ;            /*!< (@ 0x00000004) Prefetch buffer enable                                     */
      __IM  uint32_t PRFTBS     : 1 ;            /*!< (@ 0x00000005) Prefetch buffer status                                     */
      __IM  uint32_t		    : 26 ;


    } bit;
  } ACR;

  union {
    __OM  uint32_t reg;                         /*!< (@ 0x00000004) Flash key register                                         */

    struct {
      __OM  uint32_t KEY        : 32;           /*!< (@ 0x00000000) FPEC key                                                   */
    } bit;
  } KEYR;

  union {
    __OM  uint32_t reg;                         /*!< (@ 0x00000008) Flash option key register                                  */

    struct {
      __OM  uint32_t OPTKEY     : 32;           /*!< (@ 0x00000000) Option byte key                                            */
    } bit;
  } OPTKEYR;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000000C) Status register                                            */

    struct {
      __IM  uint32_t BSY        : 1;            /*!< (@ 0x00000000) Busy                                                       */
      __IM  uint32_t            : 1;
      __IOM uint32_t PGERR      : 1;            /*!< (@ 0x00000002) Programming error                                          */
      __IM  uint32_t            : 1;
      __IOM uint32_t WRPRTERR   : 1;            /*!< (@ 0x00000004) Write protection error                                     */
      __IOM uint32_t EOP        : 1;            /*!< (@ 0x00000005) End of operation                                           */
      __IOM uint32_t 	        : 26;

    } bit;
  } SR;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000010) Control register                                           */

    struct {
      __IOM uint32_t PG         : 1;            /*!< (@ 0x00000000) Programming                                                */
      __IOM uint32_t PER        : 1;            /*!< (@ 0x00000001) Page Erase                                                 */
      __IOM uint32_t MER        : 1;            /*!< (@ 0x00000002) Mass Erase                                                 */
      __IM  uint32_t            : 1;
      __IOM uint32_t OPTPG      : 1;            /*!< (@ 0x00000004) Option byte programming                                    */
      __IOM uint32_t OPTER      : 1;            /*!< (@ 0x00000005) Option byte erase                                          */
      __IOM uint32_t STRT       : 1;            /*!< (@ 0x00000006) Start                                                      */
      __IOM uint32_t LOCK       : 1;            /*!< (@ 0x00000007) Lock                                                       */
      __IM  uint32_t            : 1;
      __IOM uint32_t OPTWRE     : 1;            /*!< (@ 0x00000009) Option bytes write enable                                  */
      __IOM uint32_t ERRIE      : 1;            /*!< (@ 0x0000000A) Error interrupt enable                                     */
      __IM  uint32_t            : 1;
      __IOM uint32_t EOPIE      : 1;            /*!< (@ 0x0000000C) End of operation interrupt enable                          */
    } bit;
  } CR;

  union {
    __OM  uint32_t reg;                         /*!< (@ 0x00000014) Flash address register                                     */

    struct {
      __OM  uint32_t FAR        : 32;           /*!< (@ 0x00000000) Flash Address                                              */
    } bit;
  } AR;
  __IM  uint32_t  RESERVED;

  union {
    __IM  uint32_t reg;                         /*!< (@ 0x0000001C) Option byte register                                       */

    struct {
      __IM  uint32_t OPTERR     : 1;            /*!< (@ 0x00000000) Option byte error                                          */
      __IM  uint32_t RDPRT      : 1;            /*!< (@ 0x00000001) Read protection                                            */
      __IM  uint32_t WDG_SW     : 1;            /*!< (@ 0x00000002) WDG_SW                                                     */
      __IM  uint32_t nRST_STOP  : 1;            /*!< (@ 0x00000003) nRST_STOP                                                  */
      __IM  uint32_t nRST_STDBY : 1;            /*!< (@ 0x00000004) nRST_STDBY                                                 */
      __IM  uint32_t            : 5;
      __IM  uint32_t Data0      : 8;            /*!< (@ 0x0000000A) Data0                                                      */
      __IM  uint32_t Data1      : 8;            /*!< (@ 0x00000012) Data1                                                      */
    } bit;
  } OBR;

  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000020) Write protection register                                  */

    struct {
      __IM  uint32_t WRP        : 32;           /*!< (@ 0x00000000) Write protect                                              */
    } bit;
  } WRPR;
} FLASH_Type;                                   /*!< Size = 36 (0x24)                                                          */



/* =========================================================================================================================== */
/* ================                                           NVIC                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Nested Vectored Interrupt  Controller (NVIC) deleted
  */

/* =========================================================================================================================== */
/* ================                                            USB                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Universal serial bus full-speed device  interface (USB)
  */

typedef struct {                                /*!< (@ 0x40005C00) USB Structure                                              */

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000000) endpoint 0 register                                        */

