pointer-x/stm32f103c8_RCC_CMSIS_bitfields/CMSIS/stm32f103c8_bitfield.h
    struct {
      __IOM uint32_t EA         : 4;            /*!< (@ 0x00000000) Endpoint address                                           */
      __IOM uint32_t STAT_TX    : 2;            /*!< (@ 0x00000004) Status bits, for transmission transfers                    */
      __IOM uint32_t DTOG_TX    : 1;            /*!< (@ 0x00000006) Data Toggle, for transmission transfers                    */
      __IOM uint32_t CTR_TX     : 1;            /*!< (@ 0x00000007) Correct Transfer for transmission                          */
      __IOM uint32_t EP_KIND    : 1;            /*!< (@ 0x00000008) Endpoint kind                                              */
      __IOM uint32_t EP_TYPE    : 2;            /*!< (@ 0x00000009) Endpoint type                                              */
      __IOM uint32_t SETUP      : 1;            /*!< (@ 0x0000000B) Setup transaction completed                                */
      __IOM uint32_t STAT_RX    : 2;            /*!< (@ 0x0000000C) Status bits, for reception transfers                       */
      __IOM uint32_t DTOG_RX    : 1;            /*!< (@ 0x0000000E) Data Toggle, for reception transfers                       */
      __IOM uint32_t CTR_RX     : 1;            /*!< (@ 0x0000000F) Correct transfer for reception                             */
    } bit;
  } EP0R;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000004) endpoint 1 register                                        */

    struct {
      __IOM uint32_t EA         : 4;            /*!< (@ 0x00000000) Endpoint address                                           */
      __IOM uint32_t STAT_TX    : 2;            /*!< (@ 0x00000004) Status bits, for transmission transfers                    */
      __IOM uint32_t DTOG_TX    : 1;            /*!< (@ 0x00000006) Data Toggle, for transmission transfers                    */
      __IOM uint32_t CTR_TX     : 1;            /*!< (@ 0x00000007) Correct Transfer for transmission                          */
      __IOM uint32_t EP_KIND    : 1;            /*!< (@ 0x00000008) Endpoint kind                                              */
      __IOM uint32_t EP_TYPE    : 2;            /*!< (@ 0x00000009) Endpoint type                                              */
      __IOM uint32_t SETUP      : 1;            /*!< (@ 0x0000000B) Setup transaction completed                                */
      __IOM uint32_t STAT_RX    : 2;            /*!< (@ 0x0000000C) Status bits, for reception transfers                       */
      __IOM uint32_t DTOG_RX    : 1;            /*!< (@ 0x0000000E) Data Toggle, for reception transfers                       */
      __IOM uint32_t CTR_RX     : 1;            /*!< (@ 0x0000000F) Correct transfer for reception                             */
    } bit;
  } EP1R;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000008) endpoint 2 register                                        */

    struct {
      __IOM uint32_t EA         : 4;            /*!< (@ 0x00000000) Endpoint address                                           */
      __IOM uint32_t STAT_TX    : 2;            /*!< (@ 0x00000004) Status bits, for transmission transfers                    */
      __IOM uint32_t DTOG_TX    : 1;            /*!< (@ 0x00000006) Data Toggle, for transmission transfers                    */
      __IOM uint32_t CTR_TX     : 1;            /*!< (@ 0x00000007) Correct Transfer for transmission                          */
      __IOM uint32_t EP_KIND    : 1;            /*!< (@ 0x00000008) Endpoint kind                                              */
      __IOM uint32_t EP_TYPE    : 2;            /*!< (@ 0x00000009) Endpoint type                                              */
      __IOM uint32_t SETUP      : 1;            /*!< (@ 0x0000000B) Setup transaction completed                                */
      __IOM uint32_t STAT_RX    : 2;            /*!< (@ 0x0000000C) Status bits, for reception transfers                       */
      __IOM uint32_t DTOG_RX    : 1;            /*!< (@ 0x0000000E) Data Toggle, for reception transfers                       */
      __IOM uint32_t CTR_RX     : 1;            /*!< (@ 0x0000000F) Correct transfer for reception                             */
    } bit;
  } EP2R;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000000C) endpoint 3 register                                        */

    struct {
      __IOM uint32_t EA         : 4;            /*!< (@ 0x00000000) Endpoint address                                           */
      __IOM uint32_t STAT_TX    : 2;            /*!< (@ 0x00000004) Status bits, for transmission transfers                    */
      __IOM uint32_t DTOG_TX    : 1;            /*!< (@ 0x00000006) Data Toggle, for transmission transfers                    */
      __IOM uint32_t CTR_TX     : 1;            /*!< (@ 0x00000007) Correct Transfer for transmission                          */
      __IOM uint32_t EP_KIND    : 1;            /*!< (@ 0x00000008) Endpoint kind                                              */
      __IOM uint32_t EP_TYPE    : 2;            /*!< (@ 0x00000009) Endpoint type                                              */
      __IOM uint32_t SETUP      : 1;            /*!< (@ 0x0000000B) Setup transaction completed                                */
      __IOM uint32_t STAT_RX    : 2;            /*!< (@ 0x0000000C) Status bits, for reception transfers                       */
      __IOM uint32_t DTOG_RX    : 1;            /*!< (@ 0x0000000E) Data Toggle, for reception transfers                       */
      __IOM uint32_t CTR_RX     : 1;            /*!< (@ 0x0000000F) Correct transfer for reception                             */
    } bit;
  } EP3R;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000010) endpoint 4 register                                        */

    struct {
      __IOM uint32_t EA         : 4;            /*!< (@ 0x00000000) Endpoint address                                           */
      __IOM uint32_t STAT_TX    : 2;            /*!< (@ 0x00000004) Status bits, for transmission transfers                    */
      __IOM uint32_t DTOG_TX    : 1;            /*!< (@ 0x00000006) Data Toggle, for transmission transfers                    */
      __IOM uint32_t CTR_TX     : 1;            /*!< (@ 0x00000007) Correct Transfer for transmission                          */
      __IOM uint32_t EP_KIND    : 1;            /*!< (@ 0x00000008) Endpoint kind                                              */
      __IOM uint32_t EP_TYPE    : 2;            /*!< (@ 0x00000009) Endpoint type                                              */
      __IOM uint32_t SETUP      : 1;            /*!< (@ 0x0000000B) Setup transaction completed                                */
      __IOM uint32_t STAT_RX    : 2;            /*!< (@ 0x0000000C) Status bits, for reception transfers                       */
      __IOM uint32_t DTOG_RX    : 1;            /*!< (@ 0x0000000E) Data Toggle, for reception transfers                       */
      __IOM uint32_t CTR_RX     : 1;            /*!< (@ 0x0000000F) Correct transfer for reception                             */
    } bit;
  } EP4R;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000014) endpoint 5 register                                        */

