pointer-x/stm32f103c8_RCC_CMSIS_bitfields/CMSIS/stm32f103c8_bitfield.h
    struct {
      __IOM uint32_t EA         : 4;            /*!< (@ 0x00000000) Endpoint address                                           */
      __IOM uint32_t STAT_TX    : 2;            /*!< (@ 0x00000004) Status bits, for transmission transfers                    */
      __IOM uint32_t DTOG_TX    : 1;            /*!< (@ 0x00000006) Data Toggle, for transmission transfers                    */
      __IOM uint32_t CTR_TX     : 1;            /*!< (@ 0x00000007) Correct Transfer for transmission                          */
      __IOM uint32_t EP_KIND    : 1;            /*!< (@ 0x00000008) Endpoint kind                                              */
      __IOM uint32_t EP_TYPE    : 2;            /*!< (@ 0x00000009) Endpoint type                                              */
      __IOM uint32_t SETUP      : 1;            /*!< (@ 0x0000000B) Setup transaction completed                                */
      __IOM uint32_t STAT_RX    : 2;            /*!< (@ 0x0000000C) Status bits, for reception transfers                       */
      __IOM uint32_t DTOG_RX    : 1;            /*!< (@ 0x0000000E) Data Toggle, for reception transfers                       */
      __IOM uint32_t CTR_RX     : 1;            /*!< (@ 0x0000000F) Correct transfer for reception                             */
    } bit;
  } EP5R;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000018) endpoint 6 register                                        */

    struct {
      __IOM uint32_t EA         : 4;            /*!< (@ 0x00000000) Endpoint address                                           */
      __IOM uint32_t STAT_TX    : 2;            /*!< (@ 0x00000004) Status bits, for transmission transfers                    */
      __IOM uint32_t DTOG_TX    : 1;            /*!< (@ 0x00000006) Data Toggle, for transmission transfers                    */
      __IOM uint32_t CTR_TX     : 1;            /*!< (@ 0x00000007) Correct Transfer for transmission                          */
      __IOM uint32_t EP_KIND    : 1;            /*!< (@ 0x00000008) Endpoint kind                                              */
      __IOM uint32_t EP_TYPE    : 2;            /*!< (@ 0x00000009) Endpoint type                                              */
      __IOM uint32_t SETUP      : 1;            /*!< (@ 0x0000000B) Setup transaction completed                                */
      __IOM uint32_t STAT_RX    : 2;            /*!< (@ 0x0000000C) Status bits, for reception transfers                       */
      __IOM uint32_t DTOG_RX    : 1;            /*!< (@ 0x0000000E) Data Toggle, for reception transfers                       */
      __IOM uint32_t CTR_RX     : 1;            /*!< (@ 0x0000000F) Correct transfer for reception                             */
    } bit;
  } EP6R;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000001C) endpoint 7 register                                        */

    struct {
      __IOM uint32_t EA         : 4;            /*!< (@ 0x00000000) Endpoint address                                           */
      __IOM uint32_t STAT_TX    : 2;            /*!< (@ 0x00000004) Status bits, for transmission transfers                    */
      __IOM uint32_t DTOG_TX    : 1;            /*!< (@ 0x00000006) Data Toggle, for transmission transfers                    */
      __IOM uint32_t CTR_TX     : 1;            /*!< (@ 0x00000007) Correct Transfer for transmission                          */
      __IOM uint32_t EP_KIND    : 1;            /*!< (@ 0x00000008) Endpoint kind                                              */
      __IOM uint32_t EP_TYPE    : 2;            /*!< (@ 0x00000009) Endpoint type                                              */
      __IOM uint32_t SETUP      : 1;            /*!< (@ 0x0000000B) Setup transaction completed                                */
      __IOM uint32_t STAT_RX    : 2;            /*!< (@ 0x0000000C) Status bits, for reception transfers                       */
      __IOM uint32_t DTOG_RX    : 1;            /*!< (@ 0x0000000E) Data Toggle, for reception transfers                       */
      __IOM uint32_t CTR_RX     : 1;            /*!< (@ 0x0000000F) Correct transfer for reception                             */
    } bit;
  } EP7R;
  __IM  uint32_t  RESERVED[8];

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000040) control register                                           */

    struct {
      __IOM uint32_t FRES       : 1;            /*!< (@ 0x00000000) Force USB Reset                                            */
      __IOM uint32_t PDWN       : 1;            /*!< (@ 0x00000001) Power down                                                 */
      __IOM uint32_t LPMODE     : 1;            /*!< (@ 0x00000002) Low-power mode                                             */
      __IOM uint32_t FSUSP      : 1;            /*!< (@ 0x00000003) Force suspend                                              */
      __IOM uint32_t RESUME     : 1;            /*!< (@ 0x00000004) Resume request                                             */
      __IM  uint32_t            : 3;
      __IOM uint32_t ESOFM      : 1;            /*!< (@ 0x00000008) Expected start of frame interrupt mask                     */
      __IOM uint32_t SOFM       : 1;            /*!< (@ 0x00000009) Start of frame interrupt mask                              */
      __IOM uint32_t RESETM     : 1;            /*!< (@ 0x0000000A) USB reset interrupt mask                                   */
      __IOM uint32_t SUSPM      : 1;            /*!< (@ 0x0000000B) Suspend mode interrupt mask                                */
      __IOM uint32_t WKUPM      : 1;            /*!< (@ 0x0000000C) Wakeup interrupt mask                                      */
      __IOM uint32_t ERRM       : 1;            /*!< (@ 0x0000000D) Error interrupt mask                                       */
      __IOM uint32_t PMAOVRM    : 1;            /*!< (@ 0x0000000E) Packet memory area over / underrun interrupt
                                                                    mask                                                       */
      __IOM uint32_t CTRM       : 1;            /*!< (@ 0x0000000F) Correct transfer interrupt mask                            */
    } bit;
  } CNTR;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000044) interrupt status register                                  */

