pointer-x/stm32f103c8_RCC_CMSIS_bitfields/CMSIS/stm32f103c8_bitfield.h
    struct {
      __IOM uint32_t EP_ID      : 4;            /*!< (@ 0x00000000) Endpoint Identifier                                        */
      __IOM uint32_t DIR        : 1;            /*!< (@ 0x00000004) Direction of transaction                                   */
      __IM  uint32_t            : 3;
      __IOM uint32_t ESOF       : 1;            /*!< (@ 0x00000008) Expected start frame                                       */
      __IOM uint32_t SOF        : 1;            /*!< (@ 0x00000009) start of frame                                             */
      __IOM uint32_t RESET      : 1;            /*!< (@ 0x0000000A) reset request                                              */
      __IOM uint32_t SUSP       : 1;            /*!< (@ 0x0000000B) Suspend mode request                                       */
      __IOM uint32_t WKUP       : 1;            /*!< (@ 0x0000000C) Wakeup                                                     */
      __IOM uint32_t ERR        : 1;            /*!< (@ 0x0000000D) Error                                                      */
      __IOM uint32_t PMAOVR     : 1;            /*!< (@ 0x0000000E) Packet memory area over / underrun                         */
      __IOM uint32_t CTR        : 1;            /*!< (@ 0x0000000F) Correct transfer                                           */
    } bit;
  } ISTR;

  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000048) frame number register                                      */

    struct {
      __IM  uint32_t FN         : 11;           /*!< (@ 0x00000000) Frame number                                               */
      __IM  uint32_t LSOF       : 2;            /*!< (@ 0x0000000B) Lost SOF                                                   */
      __IM  uint32_t LCK        : 1;            /*!< (@ 0x0000000D) Locked                                                     */
      __IM  uint32_t RXDM       : 1;            /*!< (@ 0x0000000E) Receive data - line status                                 */
      __IM  uint32_t RXDP       : 1;            /*!< (@ 0x0000000F) Receive data + line status                                 */
    } bit;
  } FNR;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000004C) device address                                             */

    struct {
      __IOM uint32_t ADD        : 7;            /*!< (@ 0x00000000) Device address                                             */
      __IOM uint32_t EF         : 1;            /*!< (@ 0x00000007) Enable function                                            */
    } bit;
  } DADDR;

  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000050) Buffer table address                                       */

    struct {
      __IM  uint32_t            : 3;
      __IOM uint32_t BTABLE     : 13;           /*!< (@ 0x00000003) Buffer table                                               */
    } bit;
  } BTABLE;
} USB_Type;                                     /*!< Size = 84 (0x54)                                                          */


/** @} */ /* End of group Device_Peripheral_peripherals */


/* =========================================  End of section using anonymous unions  ========================================= */
#if defined (__CC_ARM)
  #pragma pop
#elif defined (__ICCARM__)
  /* leave anonymous unions enabled */
#elif (__ARMCC_VERSION >= 6010050)
  #pragma clang diagnostic pop
#elif defined (__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined (__TMS470__)
  /* anonymous unions are enabled by default */
#elif defined (__TASKING__)
  #pragma warning restore
#elif defined (__CSMC__)
  /* anonymous unions are enabled by default */
#endif


/* =========================================================================================================================== */
/* ================                          Device Specific Peripheral Address Map                           ================ */
/* =========================================================================================================================== */


/** @addtogroup Device_Peripheral_peripheralAddr
  * @{
  */

#define FSMC_BASE                   0xA0000000UL
#define PWR_BASE                    0x40007000UL
#define RCC_BASE                    0x40021000UL
#define GPIOA_BASE                  0x40010800UL
#define GPIOB_BASE                  0x40010C00UL
#define GPIOC_BASE                  0x40011000UL
#define GPIOD_BASE                  0x40011400UL
#define GPIOE_BASE                  0x40011800UL
#define GPIOF_BASE                  0x40011C00UL
#define GPIOG_BASE                  0x40012000UL
#define AFIO_BASE                   0x40010000UL
#define EXTI_BASE                   0x40010400UL
#define DMA1_BASE                   0x40020000UL
#define DMA2_BASE                   0x40020400UL
#define SDIO_BASE                   0x40018000UL
#define RTC_BASE                    0x40002800UL
#define BKP_BASE                    0x40006C04UL
#define IWDG_BASE                   0x40003000UL
#define WWDG_BASE                   0x40002C00UL
#define TIM1_BASE                   0x40012C00UL
#define TIM8_BASE                   0x40013400UL
#define TIM2_BASE                   0x40000000UL
#define TIM3_BASE                   0x40000400UL
#define TIM4_BASE                   0x40000800UL
#define TIM5_BASE                   0x40000C00UL
#define TIM9_BASE                   0x40014C00UL
#define TIM12_BASE                  0x40001800UL
#define TIM10_BASE                  0x40015000UL
#define TIM11_BASE                  0x40015400UL
#define TIM13_BASE                  0x40001C00UL
#define TIM14_BASE                  0x40002000UL
#define TIM6_BASE                   0x40001000UL
#define TIM7_BASE                   0x40001400UL
#define I2C1_BASE                   0x40005400UL
#define I2C2_BASE                   0x40005800UL
#define SPI1_BASE                   0x40013000UL
#define SPI2_BASE                   0x40003800UL
#define SPI3_BASE                   0x40003C00UL
#define USART1_BASE                 0x40013800UL
#define USART2_BASE                 0x40004400UL
#define USART3_BASE                 0x40004800UL
#define ADC1_BASE                   0x40012400UL
#define ADC2_BASE                   0x40012800UL
#define ADC3_BASE                   0x40013C00UL
#define CAN_BASE                    0x40006400UL
#define DAC_BASE                    0x40007400UL
#define DBG_BASE                    0xE0042000UL
#define UART4_BASE                  0x40004C00UL
#define UART5_BASE                  0x40005000UL
#define CRC_BASE                    0x40023000UL
#define FLASH_BASE                  0x40022000UL
#define USB_BASE                    0x40005C00UL

/** @} */ /* End of group Device_Peripheral_peripheralAddr */


/* =========================================================================================================================== */
/* ================                                  Peripheral declaration                                   ================ */
/* =========================================================================================================================== */


/** @addtogroup Device_Peripheral_declaration
  * @{
  */

#define FSMC                        ((FSMC_Type*)              FSMC_BASE)
#define PWR                         ((PWR_Type*)               PWR_BASE)
#define RCC                         ((RCC_Type*)               RCC_BASE)
#define GPIOA                       ((GPIOA_Type*)             GPIOA_BASE)
#define GPIOB                       ((GPIOA_Type*)             GPIOB_BASE)
#define GPIOC                       ((GPIOA_Type*)             GPIOC_BASE)
#define GPIOD                       ((GPIOA_Type*)             GPIOD_BASE)
#define GPIOE                       ((GPIOA_Type*)             GPIOE_BASE)
#define GPIOF                       ((GPIOA_Type*)             GPIOF_BASE)
#define GPIOG                       ((GPIOA_Type*)             GPIOG_BASE)
#define AFIO                        ((AFIO_Type*)              AFIO_BASE)
#define EXTI                        ((EXTI_Type*)              EXTI_BASE)
#define DMA1                        ((DMA1_Type*)              DMA1_BASE)
#define DMA2                        ((DMA1_Type*)              DMA2_BASE)
#define SDIO                        ((SDIO_Type*)              SDIO_BASE)
#define RTC                         ((RTC_Type*)               RTC_BASE)
#define BKP                         ((BKP_Type*)               BKP_BASE)
#define IWDG                        ((IWDG_Type*)              IWDG_BASE)
#define WWDG                        ((WWDG_Type*)              WWDG_BASE)
#define TIM1                        ((TIM1_Type*)              TIM1_BASE)
#define TIM8                        ((TIM1_Type*)              TIM8_BASE)
#define TIM2                        ((TIM2_Type*)              TIM2_BASE)
#define TIM3                        ((TIM2_Type*)              TIM3_BASE)
#define TIM4                        ((TIM2_Type*)              TIM4_BASE)
#define TIM5                        ((TIM2_Type*)              TIM5_BASE)
#define TIM9                        ((TIM9_Type*)              TIM9_BASE)
#define TIM12                       ((TIM9_Type*)              TIM12_BASE)
#define TIM10                       ((TIM10_Type*)             TIM10_BASE)
#define TIM11                       ((TIM10_Type*)             TIM11_BASE)
#define TIM13                       ((TIM10_Type*)             TIM13_BASE)
#define TIM14                       ((TIM10_Type*)             TIM14_BASE)
#define TIM6                        ((TIM6_Type*)              TIM6_BASE)
#define TIM7                        ((TIM6_Type*)              TIM7_BASE)
#define I2C1                        ((I2C1_Type*)              I2C1_BASE)
#define I2C2                        ((I2C1_Type*)              I2C2_BASE)
#define SPI1                        ((SPI1_Type*)              SPI1_BASE)
#define SPI2                        ((SPI1_Type*)              SPI2_BASE)
#define SPI3                        ((SPI1_Type*)              SPI3_BASE)
#define USART1                      ((USART1_Type*)            USART1_BASE)
#define USART2                      ((USART1_Type*)            USART2_BASE)
#define USART3                      ((USART1_Type*)            USART3_BASE)
#define ADC1                        ((ADC1_Type*)              ADC1_BASE)
#define ADC2                        ((ADC2_Type*)              ADC2_BASE)
#define ADC3                        ((ADC2_Type*)              ADC3_BASE)
#define CAN                         ((CAN_Type*)               CAN_BASE)
#define DAC                         ((DAC_Type*)               DAC_BASE)
#define DBG                         ((DBG_Type*)               DBG_BASE)
#define UART4                       ((UART4_Type*)             UART4_BASE)
#define UART5                       ((UART5_Type*)             UART5_BASE)
#define CRC                         ((CRC_Type*)               CRC_BASE)
#define FLASH                       ((FLASH_Type*)             FLASH_BASE)
#define USB                         ((USB_Type*)               USB_BASE)

/** @} */ /* End of group Device_Peripheral_declaration */


#ifdef __cplusplus
}
#endif

#endif /* STM32F103XX_H */


/** @} */ /* End of group STM32F103xx */

/** @} */ /* End of group  */

